{
  "credits" : {
    "Mike Leake" : "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light."
  },
  "prayers" : [
    {
      "title" : "we would be satisfied in God alone",
      "passage" : "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalm 16:11",
      "devotion" : "To my knowledge I have started every prayer challenge with this passage and with this theme. That is intentional. I believe the greatest thing we can pray for people - and ultimately for our church is that we will be eternally satisfied in God alone. The promises of Psalm 16 are vast. It is easy for churches and individuals to get distracted and wooed away by lesser loves. It is only in the Lord that we will find fullness of joy which is without bottom and pleasures which are without end. So pray today that those in our church would find satisfaction in God alone.",
      "prayer" : "Father, in You alone is eternal satisfaction. I confess that so often my heart is drawn to things that do not satisfy. Rescue my heart - and the hearts of my brothers and sisters in Christ - from looking to other things to find satisfaction. May our passion be to help others find their satisfaction in God alone. Only You can satisfy. Help us believe this with all of our being. Amen."
    },
    {
      "title" : "our aim would be to please God",
      "passage" : "So whether we are at home or away, we make it our aim to please him.\n2 Corinthians 5:9",
      "devotion" : "Church can be foggy, and that’s not surprising when you consider the nature of the church. God draws diverse people who are sinners into a relationship with Himself, which by necessity also puts redeemed sinners in close proximity to one another. That’s diverse people put together who are all likely at a different spot in their growth in the Lord. When these people try to make decisions together, things can get foggy. The needs around us, the needs within our own body, the dreams and passions that we have for serving the Lord, the whole lot of things can create a fog. There is one thing which can clear the focus; namely, every member make it his/her life’s aim to please God. Focus there and the fog has a tendency to lift.",
      "prayer" : "Father, we thank You  for Your work of drawing diverse peoples to Yourself. And yet we are broken people, living in a broken world, who are being redeemed by You. We acknowledge that we are still sinners, and as such when we relate to one another things can sometimes get foggy. Lord, help it to be our aim to please You. No matter where we find ourselves serving within Your church, help our singular aim be Your pleasure. Thank You that Your ultimate pleasure in us has already been satisfied at the Cross. Help us live out what You’ve already purchased. Amen."
    },
    {
      "title" : "we would see what is true",
      "passage" : "Then Elisha prayed and said, \"O Lord, please open his eyes that he may see.\" So the Lord opened the eyes of the young man, and he saw, and behold, the mountain was full of horses and chariots of fire all around Elisha.\n2 Kings 6:17",
      "devotion" : "When Elisha’s servant woke up in the morning, he discovered that he and Elisha were surrounded by the enemy. Ever feel that way? Does it ever seem like your church is being overcome by darkness rather than the other way around? Do you get discouraged by the encroaching secularism all around? If so, you understand what Elisha’s servant felt that morning.\n\nBut notice what Elisha prays for his wearied servant. \"Help him see what is really there.\" And with this the servant is able to see that they are surrounded by angel armies. There is nothing to fear because the Sovereign Lord is in control of history. We need Elisha’s prayer today.",
      "prayer" : "Father, we feel at times like the darkness is winning. Often we can only see with our physical eyes, and this discourages us. Lord, help us to believe there is much that is unseen. Help us to see what is true. Create in us a boldness based upon the reality of your Sovereign care. We know that in the end, You win. Help us to believe this as a church and to live accordingly. Help us not to fear the outside world but to love with Your love. Amen."
    },
    {
      "title" : "God’s name would be exalted through us",
      "passage" : "Our Father in heaven, hallowed be your name.\nMatthew 6:9",
      "devotion" : "It has been said that your life either tells the truth about God, or it tells a lie. I suppose this same thing could be extended to the church at large. If your local church is all the outside world used to formulate a view of God, would they largely know the truth of God or a lie? I’m convinced that if anyone will exalt the name of the Lord it will be through the labors of ordinary Christians in the local church. Let us, then, live lives which accurately reflect God and His gospel. May His name be exalted through us.",
      "prayer" : "Father,You are good, and You are holy. We confess that at times our churches and our own lives do not accurately reflect You. Forgive us for these times. We thank You that even in our brokenness and failings we can somehow reflect You and magnify Your love and grace toward us. Help our church be an accurate reflection of You. May Your name be hallowed on earth as it is in heaven. Help the world, through us, to hear and see Your precious gospel. Amen."
    },
    {
      "title" : "we would love one another deeply from the heart",
      "passage" : "Having purified your souls by your obedience to the truth for a sincere brotherly love, love one another earnestly from a pure heart.\n1 Peter 1:22\n\nAbove all, keep loving one another earnestly, since love covers a multitude of sins.\n1 Peter 4:8",
      "devotion" : "When we read something like \"love one another deeply from the heart\" our minds might be a bit too informed by Hollywood. But Hollywood doesn’t give us our best image of this \"earnest love\". The word Paul uses here is the same word used of Jesus when He is praying earnestly and sweating drops of blood in the Garden of Gethsemane. It is with this type of passion and intentionality that we are to love our brothers and sisters in Christ. This deep love is not original with us. It is, as we read in 1 Peter 1:22, one which comes to us by having purified our souls. The gospel is what gives us a new heart. It is from this new heart that we are able to love each other with a love modeled for us in the Garden of Gethsemane.",
      "prayer" : "Father, we thank You for Your deep love for us. We thank You that You have given us new hearts which are able to love with Your cruciform cross love. We also confess that at times our love is shallow. We are asking that You would strengthen our love for one another. Help us to love one another deeply from our Christ-purchased hearts. Give us the passion and intentionality for one another that was modeled for us in the Garden of Gethsemane. Amen."
    },
    {
      "title" : "we would receive God’s word humbly",
      "passage" : "All these things my hand has made, and so all these things came to be, declares the LORD. But this is the one to whom I will look: he who is humble and contrite in spirit and trembles at my word.\nIsaiah 66:2\n\nTherefore put away all filthiness and rampant wickedness and receive with meekness the implanted word, which is able to save your souls.\nJames 1:21",
      "devotion" : "There is a way in which a church can receive the Word which is counter-productive. It is one thing to receive the Word as a humble Berean, searching the Scriptures to see if what is being said is so. It is quite another to be an arrogant soul hiding behind the illusion of being a Berean, but in reality no better than a Monday-morning quarterback. In these moments we are doing what Soren Kierkegaard called \"defending oneself against God’s Word\". We must hear God’s Word with a humble posture; a trembling posture which comes to grips with our own sinfulness and finitude. Yet also the posture of a meek lamb - desperately dependent upon the Lord to feed us. Pray today that our church would not only be passionate about mastering God’s Word but that we would be equally passionate about being mastered by God’s Word.",
      "prayer" : "Father, break us where we need broken and heal us where we need healing. We want to receive Your word with humility. Every good and perfect gift comes from You and so we are dependent upon You for the blessing of truly receiving Your Word. Lord, rescue us from our foolish defense of ourselves. Help us to see that because of Jesus we do not have to hide from the work of Your Word. Your Word incarnate is our lone defense. May we rest in Him and humbly receive the Word You’ve placed in our heart. Amen."
    },
    {
      "title" : "we would joyously be led",
      "passage" : "Obey your leaders and submit to them, for they are keeping watch over your souls, as those who will have to give an account. Let them do this with joy and not with groaning, for that would be of no advantage to you.\nHebrews 13:17",
      "devotion" : "John Brown, the 18th century Scottish author and pastor, once encouraged a newly ordained young man with these words:\n\n\"I know the vanity of your heart, and that you will feel mortified that your congregation is very small, in comparison with those of your brethren around you; but assure yourself on the word of an old man, that when you come to give an account of them to the Lord Christ, at His judgment-seat, you will think you have had enough.\"\n\nBrown is correct; Pastors will give an account to God for their flock. This means that pastors bear a weight that those without that charge cannot fully feel*. In light of this truth, the author to Hebrews encourages his readers to obey and submit to their leaders in such a way that helps them fulfill their calling joyously. There is much which could be said here about abuse of power and the like. Yet, let us not lose the beauty of this text because it has been abused. Our ability to submit, honor, and obey those in leadership is a reflection of our ability to submit, honor, and obey the Lord. It is to our advantage to pursue the joy of those leading us.\n\n* Of course there is a weight those who are not pastors will bear that we pastors do not carry.",
      "prayer" : "Lord, we thank You for good biblical leaders. We thank You for those who care for us and watch over us and fight for our joy in Christ. We pray today that You would help them to have joy in You. Give us the desire to be intentional about helping our leaders be satisfied in You. Help us to be a joy to lead. May we honor You in the way we honor our leaders. Amen."
    },
    {
      "title" : "we would see our community with the eyes of Jesus",
      "passage" : "When he went ashore he saw a great crowd, and he had compassion on them, because they were like sheep without a shepherd. And he began to teach them many things.\nMark 6:34",
      "devotion" : "I doubt the massive and needy crowd would have gotten a warm reception from the hungry and exhausted disciples. Yet, Jesus sees this desperate crowd with the eyes of compassion and causes Him to act. He feeds them not only the physical food of miraculous bread but also the spiritual food of teaching from heaven. Jesus’ compassion is always greater than the strength of His disciples. I’m convinced this is one reason we are sometimes guilty of turning a blind eye to the suffering within our communities - we know what will happen if we view our community with the eyes of Jesus. Seeing things with the eyes of Jesus will put us in situations of which we aren’t comfortable, it will demand things of us which we don’t have the strength for, and ultimately push us outside of ourselves. Yet, we must view our community with the eyes of Jesus.",
      "prayer" : "Lord, we thank you for the compassion with which You look upon us. We are grateful for Your tender mercies to us when You would have been perfectly just to have left us in our sin. We know that you view the hapless crowd with the eyes of compassion. Lord, help us do the same. Help us to see our communities the way that you see them and to respond accordingly. May your compassion move us to action. Amen."
    },
    {
      "title" : "we would be grounded and not tossed to and fro",
      "passage" : "So that we may no longer be children, tossed to and fro by the waves and carried about by every wind of doctrine, by human cunning, by craftiness in deceitful schemes.\nEphesians 4:14",
      "devotion" : "It is easy for churches to get tossed to and fro and carried about by every wind of doctrine. If you don’t believe me, check the clearance aisle at your local Christian book store. We love to chase fads looking for a talisman to reach people and ignite our churches. It seldom works.\n\nWhat is interesting is that God has already given us the remedy for being grounded. If you look at the logic and order in this verse we see first that God gives the church leaders to equip the saints for the work of ministry. And then as the saints do ministry alongside one another we grow in Christ-likeness (4:13). The result of this being built up is our not being tossed to and fro. But instead (4:15) we are speaking the truth in love to one another and being built up in Christ. Our answer, then, isn’t to develop a new fad to help us not be tossed to and fro - our answer is simply and faithfully do life together.",
      "prayer" : "Lord, you have given us everything we need for life and godliness. You have equipped Your church to do what You have called her to do. Let us have faith in Your power and Your word and not flit away our time pursuing the latest fad. Keep us grounded in Your provision. Forgive us for the times we go about chasing the wind. Thank You for loving us through our wandering. Anchor us in You. Amen."
    },
    {
      "title" : "our sufficiency would be from God",
      "passage" : "Such is the confidence that we have through Christ toward God. Not that we are sufficient in ourselves to claim anything as coming from us, but our sufficiency is from God, who has made us sufficient to be ministers of a new covenant, not of the letter but of the Spirit. For the letter kills, but the Spirit gives life.\n2 Corinthians 3:4-6",
      "devotion" : "We don’t have what it takes. Seriously. When you consider the depravity of humanity, the foolishness of the gospel, and our own inadequacies, we really do not have what it takes to do what God is calling us to do. But that isn’t where our confidence lies, is it? We have confidence \"through Christ\" and \"toward God\". We are not sufficient in ourselves but because of Christ we have everything we need. We have Jesus. We have what it takes.",
      "prayer" : "Father, help us to see that our sufficiency is in You and from You. In ourselves we acknowledge that we do not have the resources we need to accomplish Your mission. If left up to us we’d shipwreck the whole thing. But we boldly believe that we are equipped by You with everything we need to be ministers of the new covenant. Thank you for this grand privilege. Help us be faithful to our calling and to rest on You for every ounce of our sufficiency. Amen"
    },
    {
      "title" : "we would give joyously and generously",
      "passage" : "We want you to know, brothers, about the grace of God that has been given among the churches of Macedonia, for in a severe test of affliction, their abundance of joy and their extreme poverty have overflowed in a wealth of generosity on their part.\n2 Corinthians 8:1-2",
      "devotion" : "Imagine you and I have invented a new ice cream and set about with a lofty goal of getting this ice cream into the hands of every single person in the world. To do such a thing is going to require a self-sacrificing conformity to this shared vision. That’s what the Bible calls \"koinonia.\" Now what if I told you that I’m all in on this venture but I wasn’t willing to give up my Mt. Dew addiction in order to get more ice cream to the nations? You’d call my bluff and realize I’m not very serious about getting our new ice cream into the hands of every person.\n\nThe same goes for missions. The churches of Macedonia were \"all-in\" and Paul commended them for it. They joyously gave even in the midst of extreme poverty because they believed the gospel was more precious than anything else. Let us pray today that churches would carry the torch and get the gospel to every person. That’ll take sacrifice. And it will take joyous generosity. Only God is big enough to conquer Mammon. May this lesser god topple.",
      "prayer" : "Father, You are very good to us. You have given to us more than we could ever dare hope for. We confess that at times we have a death grip on the resources and gifts that You’ve given to us. Help us to view our possessions with a kingdom-minded perspective. Rescue us from the luster of Mammon and enamor us with the great cause of global missions. Help the folks in our church to give joyously and generously. Help our church use the giving faithfully for Your kingdom. Amen."
    },
    {
      "title" : "we would bear one another’s burdens",
      "passage" : "Brothers, if anyone is caught in any transgression, you who are spiritual should restore him in a spirit of gentleness. Keep watch on yourself, lest you too be tempted. Bear one another’s burdens, and so fulfill the law of Christ.\nGalatians 6:1-2",
      "devotion" : "I see two admonitions in this passage. One of them is to be the type of person who will bear the burdens of a struggling brother. In 1 Thessalonians 5, Paul mentions those who are \"weak\" and he encourages others to \"help\" them. The words used there bring to mind the concept of being the legs of the legless. This, in part, is what it means to shoulder the load of our brothers and sisters in Christ.\n\nThe other person in this text is the one who has the heavy load he is lifting. He too has an admonition in this verse. We must drop our self-reliance and realize that we have brothers and sisters in the church who God has sovereignly ordained to help us. And so we truly are called to bear one another’s burdens. We are in this together. When you hurt, I hurt. When you are overjoyed, I’m overjoyed.",
      "prayer" : "Father, I thank You for giving us the church. Thank You for brothers and sisters in Christ who pray for me. Thank You for those who willingly shoulder some of my load. Help me be vulnerable and allow people to help. In the same way, help me be a conduit of your grace and care. Give me the strength to bear the burdens that my brothers and sisters face. May we fight sin together, and with one heart and mind, grab hold of Christ - who is our portion forever. Amen."
    },
    {
      "title" : "we would stand firm",
      "passage" : "So then, brothers, stand firm and hold to the traditions that you were taught by us, either by our spoken word or by our letter.\n2 Thessalonians 2:15",
      "devotion" : "Standing firm in traditions will get you a bad rap in our day. Granted, there are some traditions which are not worth standing upon. This is seen by the fact that the majority of times this word is used in the New Testament, it is upon the lips of Jesus condemning the Pharisees for clinging to their traditions. But there are also some traditions which are grounded in the gospel upon which we ought to stand firm. What we are really to be standing firm upon is the apostolic tradition as given to us in Word of God. The word itself comes from a military formation. What this means is that believers - and churches - should not break rank. Regardless of the cultural climate around us we must remain faithful.",
      "prayer" : "Father, You have graciously communicated Your will to us through Your Word. Help us as a church to boldly stand firm on Your Word to us. There are times when it can be tempting to compromise. Protect us from ourselves and from the fear of man. Give us the courage to stand firmly and to not break rank. Give us the boldness to die upon the hills we should die and to not bother climbing the ones which are the mere traditions of men. Grant us the wisdom to know the difference. Amen."
    },
    {
      "title" : "we would be patient",
      "passage" : "Be patient, therefore, brothers, until the coming of the Lord. See how the farmer waits for the precious fruit of the earth, being patient about it, until it receives the early and the late rains. You also, be patient. Establish your hearts, for the coming of the Lord is at hand. Do not grumble against one another, brothers, so that you may not be judged; behold, the Judge is standing at the door.\nJames 5:7-9",
      "devotion" : "James 5 tells us that there will be times when it seems that evil is winning. The same thing that tempted Asaph in Psalm 73 is still true today - the righteous sometimes suffer while the wicked are living it up. In times like these, it is easy for churches to panic and to become impatient. Such impatience inevitably leads to grumbling against one another. The remedy for this is given to us in this passage as well when James reminds us that \"the Lord is at hand\". Jesus will one day make all things right. He fights our battles so we do not have to. Let us be patient and trusting of the Lord’s sovereign care.",
      "prayer" : "Father, You are sovereign over us. There is not one day which the world is spinning apart from Your care. You will never be dethroned. And yet we confess there are times with our limited perspective that things seem out of whack. In these times help us to trust You. Help us as a church to be patient and confident in You. Keep us from caving into fear and responding with grumbling against one another. May Your return and Your rule cause us to be patient. Come Lord Jesus. Amen."
    },
    {
      "title" : "we would surrender our rights for the sake of Jesus",
      "passage" : "But I have made no use of any of these rights, nor am I writing these things to secure any such provision. For I would rather die than have anyone deprive me of my ground for boasting.\n1 Corinthians 9:15",
      "devotion" : "1 Corinthians 9 isn’t about 1 Corinthians 9 - it’s about 1 Corinthians 8 and 10. The folks at Corinth were split into factions. Some, those termed \"the weaker brothers\", were struggling with eating food offered up to idols. The other group, those termed \"the strong\", were standing upon their rights as believers in Jesus. In order to teach both groups, Paul uses himself as an example. He was willing to give up any rights that he had for the sake of Jesus. He didn’t fight for his rights. He laid them down so that others could find freedom.\n\nWhen churches follow Paul, who follows Christ, in this regard they’ll live in the true freedom that Jesus purchased. But a church which is consistently fighting for her rights - whether among one another or out in the marketplace - will inevitably be distracted by lesser things. She will die on the hill of her own perceived rights. If Jesus has already purchased everything we need for life and godliness, and if the Lord is our portion, then why do we need to fight for our rights?",
      "prayer" : "Father, we thank You for the freedoms that You have given to us. We believe that You are our portion. We believe You are our shield and our protector. As such, we are willing to surrender our rights for the sake of Jesus. Help us fight for others to have joy in Jesus. Thank You for already giving us everything we need. Amen."
    },
    {
      "title" : "we would be filled with the Spirit",
      "passage" : "And do not get drunk with wine, for that is debauchery, but be filled with the Spirit,\nEphesians 5:18",
      "devotion" : "If the Holy Spirit decided to abandon your church, what programs and ministries would be shut down? I can’t remember where I first heard that question, but it has stuck with me. I’d like to say that we’d have to shut down everything - but truth be told, there might be some things we do as a church which could go on mostly unchanged. This should not be so.\n\nAlthough there is much which could be said about Ephesians 5:18 and the concept of being filled with the Spirit, I simply want to draw your attention to two things from this verse. First, you do not get drunk on wine by merely having a sip or dabbling in wine. You get drunk by drinking a few glasses. In the same way churches should not be content with merely sipping on the Spirit. We should not be content until he has the whole of us.\n\nSecondly, to be filled with the Spirit essentially means to be pressured, permeated, and dominated by the Spirit. For a church to be filled with (or by) the Spirit, we’d absolutely know the answer to the opening question. If we are to do anything of lasting value as a church, it will be through the work of the Spirit.",
      "prayer" : "Father, we thank You for the gift of Your Spirit. We thank You that You’ve taken up residence in our lives and that You are absolutely dedicated to seeing us fully redeemed. We pray, Lord, that You’d create in us a hunger which can only be satisfied by You. Fill us with Your Spirit. May the peace of Christ rule every sector of our hearts. This is Your church. Fill it up with Yourself. Amen."
    },
    {
      "title" : "we wouldn’t be satisfied with shadows",
      "passage" : "Therefore let no one pass judgment on you in questions of food and drink, or with regard to a festival or a new moon or a Sabbath. These are a shadow of the things to come, but the substance belongs to Christ. Let no one disqualify you, insisting on asceticism and worship of angels, going on in detail about visions, puffed up without reason by his sensuous mind, and not holding fast to the Head, from whom the whole body, nourished and knit together through its joints and ligaments, grows with a growth that is from God.\nColossians 2:16-19",
      "devotion" : "What would you think of me if I took my wife on a date and, while eating pizza, I only talked to her shadow and ignored her? Or if while watching a movie, I tried cuddling up to her shadow? Or when we went out dancing I started slow dancing with her shadow? You’d think I was a nut and rightly so. You don’t dance with shadows when the substance is right there. And yet so many Christians and churches are satisfied with shadows. We spend our time focusing on food, drink, festivals, new moons, and Sabbath’s and miss the gospel. Let us not think that what we need is asceticism, or visions, or anything of the sort. Instead, may we as churches realize that we have been given the substance - Jesus Christ. No more dancing with shadows.",
      "prayer" : "Father, we thank You for the gift of Your Son. In Him is Your fullness. We have everything we need in Jesus. And yet, we confess our propensity to dance with shadows. Perhaps, given our finitude, shadows are more comfortable. Rescue us from this foolishness. Help us to not be satisfied with shadows but to actively pursue lasting enjoyment of You - our substance."
    },
    {
      "title" : "we would be abounding in thanksgiving",
      "passage" : "Therefore, as you received Christ Jesus the Lord, so walk in him, rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving.\nColossians 2:6-7",
      "devotion" : "If you ever see a turtle on a fence post you know he didn’t get there by himself. In the same way, if you see a believer in Jesus living a life for the glory of God, you know he didn’t get there by himself. As such, we should live lives marked by thanksgiving. We should be continually thankful to God, and we should also express thanksgiving to the people God has placed in our lives. A church marked by thanksgiving is likely a church which is thriving in missions. Grateful people tend to be outward focused. We have an eternal amount of reasons to be thankful; let us notice them.",
      "prayer" : "Father, You have given us many reasons to sing. You are so good to us, and we do not deserve a drop of Your mercy. Yet You lavish upon us eternal good. We will have eternity to sing of Your goodness to us. Give us eyes of gratitude. Help us to see Your hand in all things, and help us to be thankful for the clouds and the rainbows. You always aim to do us good. Help us believe this. Thank you. Amen."
    },
    {
      "title" : "we would exalt his name together",
      "passage" : "Oh, magnify the LORD with me, and let us exalt his name together!\nPsalm 34:3",
      "devotion" : "When we magnify God, we aren’t exaggerating His greatness. Rather we’re using all of our resources to see and show how great He really is. As John Piper has helpfully illustrated magnifying God is like using a telescope and not a microscope. I love how David calls upon the people to join Him in this work of exalting God’s name. God is so great that it takes the entire church to even scratch the surface of His greatness. Shouldn’t this be the goal of every Christian and every church?\n\nI like how Piper makes this practical by showing how thanksgiving is the chief way to magnify God’s greatness:\n\nTherefore, when gratitude springs up in the human heart toward God He is magnified as the wealthy source of our blessing. He is acknowledged as giver and benefactor and therefore as glorious. But when gratitude does not spring up in our hearts at God’s great goodness to us, it probably means that we don’t want to pay Him a compliment; we don’t want to magnify Him as our benefactor.",
      "prayer" : "Father, You have been so good to us. Give us hearts of gratitude which magnify Your greatness. You are so grand, and we are so feeble; we need Your grace to exalt You. We know, Lord, that if given to ourselves we’ll go about our lives trying to magnify our own names. Rescue us from this ignorance. May we be found in You - the truly great One. May our church be united in our singular aim of exalting Your name together. We are fine if nobody remembers us or our church - so long as You are exalted."
    },
    {
      "title" : "we would fear the Lord",
      "passage" : "Oh, fear the LORD, you his saints, for those who fear him have no lack!\nPsalm 34:9",
      "devotion" : "I have made several dumb decisions in my life. Almost every one of them can be traced back to a lack of fearing the Lord. I believe the same is true of churches. A lack of fearing the LORD causes us to put our eyes in the wrong spot. Rather than living life under the authority of God and to the glory of God, we live our lives as if we were in a fishbowl. We ask horizontal questions and make horizontal decisions, while giving a mere hat tip to the vertical. The fear of the Lord changes this. Those who fear Him have no lack because God is a great Father.",
      "prayer" : "Father, You are very good to us. and You are absolutely holy. Your ways are not our ways and Your thoughts are not our thoughts. Yet You’ve condescended to make Yourself known by us creatures. We thank You that You’ve even made Yourself known. We also thank You for rescuing us as believers from terror fear. We know that Jesus drank the full cup of Your wrath. Yet we still relate to You as wholly other. Give us - and our churches - a holy and reverent fear of You."
    },
    {
      "title" : "we would fight the good fight",
      "passage" : "Fight the good fight of the faith. Take hold of the eternal life to which you were called and about which you made the good confession in the presence of many witnesses.\n1 Timothy 6:12",
      "devotion" : "It feels kind of strange praying that churches would fight, yet there is a type of fight which is absolutely vital to a churches health. Paul in 2 Timothy 4:7, at the end of his life, said that he had fought the good fight and that he had kept the faith. Here he encourages young Timothy to keep fighting for faith. This tells us that we will not drift into holiness. Keeping our faith is not a passive or simple thing. We must fight. We must, as 1 Timothy 6:11 says, flee some things and pursue others. Let us pray today that our churches would fight for the right things, that we would put more energy into fighting for holiness as we do getting our favorite carpet colors.",
      "prayer" : "Father, we are prone to fight the wrong battles. We are prone to make the significant insignificant and that which is not vital we are prone to give our lives for. We thank you, Jesus, for giving your life for our good and the glory of God. Help us, Lord, to fight the good fight of faith. Help us to not take our faith for granted but to labor to stoke the flames of faith. You are worth every drop of sweat. May way take hold of the eternal life to which you’ve called us. Amen."
    },
    {
      "title" : "we would not give the devil a foothold",
      "passage" : "Be angry and do not sin; do not let the sun go down on your anger, and give no opportunity to the devil.\nEphesians 4:26-27",
      "devotion" : "We often use the concept of not giving the devil a foothold as an admonishment to not flirt with sin. While that is certainly true, this particular passage is actually in the context of our relationships with one another in the church. When we let anger boil we are giving the devil a foothold in our church. We often pray that the Lord would bind the works of the enemy as we gather together. Perhaps as we pray this, we should also take seriously what the Bible says about pursuing broken relationships within the church. Not following passages such as Matthew 18, is to give the devil a foothold. Therefore, let us pursue unity and reconciliation as we fight the enemy.",
      "prayer" : "Father, we thank you for your work through Jesus of destroying the works of the devil. We thank you for uniting sinners like us into fellowship with You and also with each other. Yet we still live as broken people in a broken world and as such we continue to have broken relationships. Empower us to follow Your Word as we pursue reconciliation with one another. Keep us from being so self-righteous and self-dependent as to give the devil a foothold. Help us see our desperation for You as we reach out to one another in love. Amen."
    },
    {
      "title" : "we would receive the whole counsel of God’s Word",
      "passage" : "Therefore I testify to you this day that I am innocent of the blood of all, for I did not shrink from declaring to you the whole counsel of God.\nActs 20:26-27",
      "devotion" : "Paul could have easily said, \"I declared to you the whole counsel of God’s Word\" but he didn’t. He added, \"I did not shrink from.\" This implies that there is a real temptation for preachers to shrink from declaring the whole counsel of God. There are parts of Scripture which are uncomfortable to hear - and therefore they are uncomfortable to preach. But the faithful minister will not shrink from this task. He’ll stand before the people and declare, \"Thus says the Lord,\" even if he knows it is going to step on some toes.\n\nThere is also, I believe, an admonishment in this text for listeners. When we are sitting under the preaching of the Word of God we should be hungry for the Word. We should not be satisfied with shrinking preachers. In fact we should work to cultivate such an environment in our churches where the pastor feels it his joyful duty to preach the whole counsel of God’s Word and not his dreaded burden. Let us be hungry for the whole of Scripture.",
      "prayer" : "Father, Your Word to us is very good. We acknowledge that there are parts in Scripture which are hard for us to swallow. We confess to You our tendency to shrink away from the hard stuff. We also confess our tendency to go the other way and fall into a faux-boldness which only ravages hearts with uncomfortable truths. Help us, dear Lord, with preachers who proclaim Your whole counsel. Give us hearts that are hungry for every bit of Your Word and minds filled with wisdom to know how to graciously apply Your precious truths. Amen."
    },
    {
      "title" : "we would know the hope to which we are called",
      "passage" : "I do not cease to give thanks for you, remembering you in my prayers, that the God of our Lord Jesus Christ, the Father of glory, may give you the Spirit of wisdom and of revelation in the knowledge of him, having the eyes of your hearts enlightened, that you may know what is the hope to which he has called you, what are the riches of his glorious inheritance in the saints, and what is the immeasurable greatness of his power toward us who believe, according to the working of his great might\nEphesians 1:16-19",
      "devotion" : "The hope to which God has called us is so great that it takes the power of God - yes, the same power which resurrected the crucified son of God - for us to even begin to comprehend its greatness. But knowing this hope has an impact on the way we live our lives.\n\nWatching a taped sports game illustrates this. If you know your team won that third quarter interception doesn’t get you nearly as upset. Knowing the outcome changes things. Likewise knowing the hope to which we are called changes things for the church. It helps us to know what battles need to be fought and which battles we should walk away from. It causes us to labor for the things which truly matter. So let us pray that we as a church will be able to comprehend the greatness of this hope to which we are called.",
      "prayer" : "Father, the gifts You have lavished upon us are so great that it takes Your power for us to even begin to comprehend them. We deserve hell, but You have given us this great hope. Lord, give us the strength to believe Your promises. Give us the wisdom to discern Your hope and to live accordingly. Help us to see the greatness of the hope to which You’ve called us and to labor diligently to give others this great hope in Jesus."
    },
    {
      "title" : "we would enjoy what Christ has purchased",
      "passage" : "And so, from the day we heard, we have not ceased to pray for you, asking that you may be filled with the knowledge of his will in all spiritual wisdom and understanding, so as to walk in a manner worthy of the Lord, fully pleasing to Him, bearing fruit in every good work and increasing in the knowledge of God. May you be strengthened with all power, according to his glorious might, for all endurance and patience with joy, giving thanks to the Father, who has qualified you to share in the inheritance of the saints in light. He has delivered us from the domain of darkness and transferred us to the kingdom of his beloved Son, in whom we have redemption, the forgiveness of sins.\nColossians 1:9-14",
      "devotion" : "Jerry Bridges tells a story in his book The Gospel for Real Life about a Southern plantation owner who leaves $50,000 (a great sum of money in the 1800s) to a former slave that served him faithfully his entire life.  A lawyer of the estate notified the former slave of his vast inheritance.  Weeks went by, and the former slave never requested any of his inheritance.  Finally, they decided to send a banker out to explain to this man what his inheritance was and that he could draw out money any time.\n\nThe old man replied, ‘Sir, do you think I can have fifty cents to buy a sack of cornmeal?’  He could have asked for much more - but he died having only withdrawn 50 cents from a $50,000 inheritance.\n\nI take Paul’s prayer to be that the Colossians (and we) might really come to understand what spiritual blessings we have so that we enjoy what Christ has purchased and not live as if He’s only purchased a little, only redeemed us a little, only forgiven us a little, only triumphed on our behalf just a little.",
      "prayer" : "Father, You have given us far more than we can even fathom. We confess that so often we treat Your gospel and the gift of Yourself as if its but a little. We lament that our churches so often reflect this fact that we don’t truly believe that You’ve given us all of these riches in the gospel. Still, You are still good to us and lavish Your grace upon us. Lord, help us to enjoy what You have already purchased on our behalf. Keep us from flitting away our lives trying to earn what You’ve already given. And keep us from being so dense as to live our lives trying to get by on a little cornmeal when You’ve given us everything we need for life and godliness."
    },
    {
      "title" : "we would not be idle",
      "passage" : "For we hear that some among you walk in idleness, not busy at work, but busybodies.\n2 Thessalonians 3:11",
      "devotion" : "The folks at Thessalonica were so convinced of the imminence of second coming that they stopped working. Right theology wrongly applied can have terrible consequences. Though it shouldn’t, I wonder if at times the doctrine of eternal security can create in us a similar type of idleness. Idleness and being a busybody are clearly forbidden in Scripture. They are a reflection of a heart that does not truly understand the implications of the second coming of Christ. An idle church is a dying church.\n\nShow me a church which is not busy at work pushing back the darkness with the light of Jesus and I’ll show you a church that is bickering amongst themselves. In contrast show me a church whose members are pooling their resources to fall so in love with Jesus that it explodes into missions, and I’ll show you a church that wouldn’t think of arguing about minor issues.",
      "prayer" : "Father, thank You for involving us in Your grand global purpose of filling the world with Your glory and replacing all sin and unbelief with passionate worshippers. Give us a heart which bleeds for the things which fit this grand plan. Rescue us from idleness and from wrongly applying our theology. Keep us from checking out. Give us the endurance to spill our lives for the cause of Christ. Amen."
    },
    {
      "title" : "we would not be ashamed of the gospel",
      "passage" : "For I am not ashamed of the gospel, for it is the power of God for salvation to everyone who believes, to the Jew first and also to the Greek. For in it the righteousness of God is revealed from faith for faith, as it is written, \"The righteous shall live by faith.\"\nRomans 1:16-17",
      "devotion" : "Surely a church wouldn’t be ashamed of the gospel…right?!?!? Yet, every time we depend upon something other than the gospel for the conversion of sinners, we are subtly ashamed of the gospel. When we uncritically pursue relevance because we think that this will somehow adorn the gospel we are communicating what we actually believe about the gospel - that it alone is not powerful enough to save. Likewise, when we only share portions of the gospel to \"hook them\" and then try to slip the harder stuff in the backdoor, we are betraying our lack of confidence in God’s ability to use His gospel to convert sinners. Let us not be ashamed of the gospel but boldly believe and live as if it truly is the power of God to save sinners.",
      "prayer" : "Father, You are strong. You saved me when I was far from You and my heart was darkened and dead. There was nothing within me that would have found You appealing, and yet through the power of Your gospel You wooed me. You took my heart of stone and made it a heart of flesh. You did what You said You would do in Your Word. Help us to believe that You will do the same through us as we share Your gospel. Keep our churches from being ashamed of the gospel - give us a holy confidence in Your ability to accomplish Your purposes."
    },
    {
      "title" : "we would comfort as we have been comforted",
      "passage" : "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and God of all comfort, who comforts us in all our affliction, so that we may be able to comfort those who are in any affliction, with the comfort with which we ourselves are comforted by God. For as we share abundantly in Christ’s sufferings, so through Christ we share abundantly in comfort too. If we are afflicted, it is for your comfort and salvation; and if we are comforted, it is for your comfort, which you experience when you patiently endure the same sufferings that we suffer. Our hope for you is unshaken, for we know that as you share in our sufferings, you will also share in our comfort.\n2 Corinthians 1:3-7",
      "devotion" : "Maybe I’m alone in this, but I’ve felt way over my head at every stage in my life. I had no idea what I was doing when I went off to college. Same with marriage. Same with children. Same with being a youth pastor. Same with being a pastor. And when difficult times, filled with suffering or persecution hit I feel as if I’m in way over my head. But every single time the Lord has seen me through. He has provided comfort when I needed comfort. On occasion, one of the means he will use to comfort will be dear saints who have traveled the same road I’m now upon. They were comforted by the Lord as well and so they are equipped to comfort me in my present affliction. Likewise, I’m finding that the areas of great pain in my life are now some of the greatest places for ministry. Don’t waste your sorrow, but use it for the glory of God.",
      "prayer" : "Father, You are the God of all comfort. When we are afflicted You are always there to comfort us in ways which we do not have words for. Help us, Lord, to not check out and live individual lives where we waste our sorrows. Use us to comfort those who are at present hurting. You’ve done so much on our behalf may we always be looking at those who are traveling along this same narrow road - and encourage them that through Your strength and Your comfort we’re going to make it."
    },
    {
      "title" : "we would fix our eyes on Jesus",
      "passage" : "Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfector of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God.\nHebrews 12:1-2",
      "devotion" : "What is your church all about? I imagine we could have several good answers to that question. We are all about missions. We are all about training leaders. We are all about love. We are all about grace. But if we really stop and think about the picture that God has given to us of the churches relationship to Christ, we’d have to admit that none of these are truly what we are all about. To be a faithful bride, we should really be all about our husband. I’m not intending to cheapen our relationship with Christ by recalling images of shallow puppy love. Yet, shouldn’t the church be smitten with Christ in such a way that we are all about Him? Shouldn’t our eyes be fixed upon our Savior much the way a newlywed couple can’t seem to take their eyes off one another?\n\nWhat would change in our churches if we truly went about fixing our eyes upon Him? I bet we’d still have missions and discipleship and grace and love and all of those precious things. But we’d be passionate about them because we first saw them in the eyes of our Savior. We’d be less like a shamed husband buying guilty flowers for his wife and more like the smitten husband who can’t keep from buying flowers because of His affection for her. ",
      "prayer" : "Father, You have given us everything we need in Jesus. As the old hymn says, help us to turn our eyes upon Jesus. Help us Lord to fix our eyes there. Our hearts are so jaded and corrupt that we can look upon the absolute beauty and radiance of Jesus and somehow want to look away. Help us to see Our Lord as He truly is. Chain our wandering hearts to thee. Amen."
    },
    {
      "title" : "we would be salt and light",
      "passage" : "You are the salt of the earth, but if salt has lost its taste, how shall its saltiness be restored? It is no longer good for anything except to be thrown out and trampled under people’s feet. You are the light of the world. A city set on a hill cannot be hidden. Nor do people light a lamp and put it under a basket, but on a stand, and it gives light to all in the house. In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.\nMatthew 5:13-16",
      "devotion" : "Hidden. Trampled. Thrown out. Those are words which describe a useless church. When we become silent in times when we should be proclaiming truth, we aren’t shining our light before others. In the same way when we are noisy when we ought to be silent we aren’t seasoning the world with grace. Christ calls his bride to be salt and light in the earth. We are to fight for their good and not for our rights. Salt isn’t meant to be enjoyed by itself - it seasons something else. Likewise, light is meant to be a blessing to others - to push back the darkness. May we as the church be spent for the good of others.",
      "prayer" : "Father, we thank You that through Your power we have seen light and tasted the salt of grace. We thank You for those You brought into our lives who shined the light of Jesus into the darkness of our hearts. We thank You for allowing us to hear Your Word through jars of clay. Now we ask, dear Lord, that You would cause us to be shining vessels as well. May Your light shine through us. Give us wisdom to know when to speak and when to be silent. Might we, as your Son, be full of grace and truth. Amen."
    },
    {
      "title" : "we would persevere in prayer",
      "passage" : "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus,\nRomans 15:5",
      "devotion" : "You did it! I’ve ended every thirty-one day challenge with an exhortation to keep on praying. I pray your soul has been nourished for these thirty-one days, and I’m confident the Lord has heard the prayers of His saints. So today I want to pray that we would continue praying for our churches. As you keep going, I pray that the God of endurance and encouragement would cause you to endure in love for your church. May Christ be glorified as you continue to minister to your church through praying for her.",
      "prayer" : "Lord, thank You for all those that have prayed for their church. I pray that they would continue. Help me to continue praying for our church as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our churches, our homes, our communities, and our world for His name. May our time of prayer ever remind our souls of our utter dependence upon You. Amen."
    }
  ]
}