{
  "name": "Pray For Your Daughter",
  "credits": {
    "Mike Leake": "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light.",
    "Corey Whittaker": "Corey Whittaker has two teens and has been a youth pastor for over 20 years. He has a MA in youth ministry from Trinity School and a MA from Liberty University in counseling. He currently serves at Christ the King in Durham, NC as the youth pastor and various and sundry other roles.",
    "Bethany Wilhite": "Bethany Wilhite is mom to Abigail, age 6, and wife of Michael who is the meteorologist at SouthernIndianaWeather.com. Bethany attends True Vine Baptist Church in Ferdinand, IN.",
    "Sarah Van Beveren": "Sarah Van Beveren is a wife and mother raising her three girls in Ontario, Canada. She's a book and coffee lover who is currently in recovery for knowing it all. She's also rocked by grace.",
    "Joey Cochran": "Joey Cochran is the father of Chloe and Adalie. He is the Church Planting Intern at Redeemer Fellowship St. Charles and blogs at jtcochran.com. Follow @joeycochran on twitter.",
    "Joan Hartley": "Joan Hartley is a member of Grace Presbyterian, OPC in northern Ohio - wife, mother of four, and \"Mimi\" to two grandsons. She is the founder of Winsome Arrows Educational Services and is training two therapy dogs, Justice and Mercy, for ministry.",
    "Ryan Freeman, Wesley Freeman": "Ryan Freeman is husband to Janis, father of Wesley, Jaedyn and Tobias, and a Deacon and founding member of Grace Fellowship Church of West Toronto. He is the president of Strider Search Marketing, a small online marketing firm serving SMBs, non-profits, and churches.\n\nWesley Freeman is the proud protector of his sister, Jaedyn, and cousins Susannah, Caitlyn, and Madalyn, and mentor to younger brother Tobias.",
    "Nick Horton": "Nick Horton lives and serves the Lord with his wife Amy and son Gabriel in the Shenandoah Valley of Virginia. He loves his Lord, his family, his church, and lives to proclaim the Gospel in whatever way he can.",
    "Persis": "Persis is an ordinary mom who loves the Lord, her family, and the local church. You can find her at Tried With Fire and Out of the Ordinary.",
    "Aaron Armstrong": "Aaron Armstrong is the author of Awaiting a Savior and Contend. He and his wife, Emily, have three kids (two girls and one boy). Aaron blogs daily at bloggingtheologically.com.",
    "John Coakey, Jr.": "John Coakey, Jr. and Danielle have been married for 14 years, they have two daughters (14 & 10), and they all live in Columbia, MD. John has served in the US Army for the past 17 years and is currently a lay elder serving First Baptist Church of Brooklyn (Baltimore, MD). He blogs at Christ Focused Living.",
    "Cliff Craig": "Cliff Craig lives in southwest Missouri and is a father to five daughters and one son. He attends James River Church and serves in ministry there.",
    "Gary L. Shultz, Jr.": "Gary L. Shultz, Jr. is the senior pastor of First Baptist Church in Fulton, MO, and he teaches theology and church history for Baptist Bible Theological Seminary and Liberty University Online. He has been married to his wife Kristin for ten years, and they have two daughters, ages two and eight months.",
    "Nikki Leake": "Nikki Leake is an Ozzy Osbourne, Colbie Caillat loving pastor's wife who once got to pet an elephant for her birthday. Oh yeah, and she has two kids. They're pretty neat too."
  },
  "prayers": [{
    "title": "she would have an abiding satisfaction in God",
    "passage": "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalm 16:11",
    "devotion": "The greatest thing that we can pray for our daughters is that they will be eternally satisfied in God. At his right hand is where pleasure is to be found, and in his presence alone fullness of joy is to be found; for our daughters to drink from any other fountain will only multiply her sorrows (Psalm 16:4). Therefore, we must pray that our daughters find their deepest satisfaction in God.",
    "prayer": "Father, I pray that you would cause my daughter to find her deepest satisfaction in You. Rescue her from looking to other things to find satisfaction and pleasures. Help me to lead her in my enjoyment of You. At your right hand is where joy is found. Help us to truly believe this and live accordingly. In Jesus' name, Amen.",
    "credit": "Mike Leake"
  }, {
    "title": "she would be filled with true joy",
    "passage": "Though you have not seen him, you love him; and even though you do not see him now, you believe in him and are filled with an inexpressible and glorious joy, for you are receiving the goal of your faith, the salvation of your souls.\n1 Peter 1:8-9",
    "devotion": "Our daughters are faced with so many promises about what will make them happy: toys, clothes, trophies, parties, and beauty. All of these and more are said to fill them with happiness. Yet, these toys end up under the bed, clothes go out of fashion, and trophies gather dust in the garage. Only through Jesus can our daughters have real joy. They are torn in a culture that celebrates excessive partying and also revels in the dark side of depression and angst. So too, girls fluctuate between naïve giddiness and moody gloominess. God's desire is that they find joy, not just happiness, in their relationship with him. His desire is that our greatest joy comes from salvation in him in in others finding that salvation. Only God will help them get off the roller coaster and find enduring peace and joy in the presence of the Lord.",
    "prayer": "Jesus, our Prince of Peace, I pray that you would fill my daughter with your joy, a deep and abiding joy that persists in the best and worst of times. I pray that you would make her certain of her salvation and determined to invite other to know you as well. Please give her eyes that see through the vain and hollow promises of worldly happiness to the truth of being whole and satisfied in you. Surround her with godly boys and girls who will seek to encourage and build her up in the joy that you offer. Let her be a wellspring of joy in the lives of others as well. Remind me also to seek God's joy, not the toys of the world, as an example to her.",
    "credit": "Corey Whittaker"
  }, {
    "title": "God would be magnified in her heart",
    "passage": "Oh, magnify the Lord with me, and let us exalt his name together!\nPsalm 34:3",
    "devotion": "Whether your daughter is young or old, there are many things in her life competing for her time, talents, affection, and worship. So much of her energy can be wasted on the wrong things that this world has to offer. Even good things, that the Lord created to point us to praise for Him, can become bigger than they should. Let's pray for our daughters to flee from idolatry and into the arms of Jesus--the only one who can satisfy her heart.",
    "prayer": "Magnify yourself, Lord, in my daughter's heart. Draw her to you and pursue her with your unfailing love. I pray that she will see that any joy and pleasure in this life is nothing compared to what you offer and is only meant to point her to you. Help her to see you working in her life and to praise you, even if it hurts, while she is struggling with following after your will versus hers. Holy Spirit, please empower her to praise you at all times. Lord, help her to worship you, the Creator, over your good creation.",
    "credit": "Bethany Wilhite"
  }, {
    "title": "she would learn to decrease",
    "passage": "He must increase, but I must decrease.\nJohn 3:30",
    "devotion": "As our daughters grow, their hearts will attempt to lead them astray and turn their attention and affection toward themselves. They will struggle with the urge to keep their eyes locked on Christ, wanting to receive glory instead of give it. Yet God tells us that our joy is complete in Christ. When we've loosened our grip on all that we are and all that we have, we will find the love and identity that we once sought by trying to raise ourselves to higher heights. Decreasing gives way for Christ to enter. Let us pray that our daughters will become less.",
    "prayer": "Lord, thank you that our glory is not dependent upon ourselves. I pray that my daughter would know that she doesn't need to look to herself for joy, but that all she searches for has been purchased for her by your sacrifice. Help me to model this joy that is found in giving all to you and in dying to myself. May she desire your glory more than this world, and find her life in you alone. Keep her eyes fixed on you. Thank you for chasing after her heart. Amen.",
    "credit": "Sarah Van Beveren"
  }, {
    "title": "her hands would serve",
    "passage": "You are serving the Lord Christ.\nColossians 3:24b",
    "devotion": "Language is beautiful. We often use language to create images that catch our attention or communicate in a vivid way. For instance, in this prayer we focus on our daughter's hands. Those hands represent the whole posture of her life. We want to see our daughters serve Christ. Every time I look at my daughter's little hands I am reminded of Christ. When she whispers to her brother, \"Let me do that for you,\" or when she giggles as she gets a utensil for mommy out of the kitchen door, I rejoice as I watch her little hands serve. Though she is young and only beginning to understand the posture of service, she delights in the Lord's work.",
    "prayer": "Lord, I pray that my daughter will not serve to get served in return. I pray that she will discover that she serves others as she serves Christ. Fill her heart with eagerness to serve. Ready her hands for selfless effort. May those little hands get most excited about embracing You, her Father in Heaven, with the same fierceness that they embrace her daddy on earth.",
    "credit": "Joey Cochran"
  }, {
    "title": "her beauty would be found in the Lord",
    "passage": "Charm is deceitful, and beauty is vain, but a woman who fears the Lord is to be praised.\nProverbs 31:30",
    "devotion": "\"Pink! Pink! Pink! Why is everything Barbie so pink!?!\"\n\nI can still picture our youngest daughter who, at age five, spoke these words with such comical earnestness that my husband and I still chuckle when we repeat them - now some twenty years later. Why, indeed, is everything Barbie so over-the-top pink and frilly and ridiculously \"feminine\"? And how is it that at least three generations of American girls have had their ideas of beauty so universally influenced by an eleven inch molded piece of plastic? Young women compare themselves to Photoshopped images of celebrities with personal trainers, and mature women wince at their HD images when they take that FaceTime call from their grandchildren. May our daughters be set free from such things as they grow in godly beauty from the inside outward.",
    "prayer": "Heavenly Father, you made all things with beauty in mind. Today, I pray that my daughter would know and accept that her true beauty comes from knowing you. Lord Jesus, remind her even now that youth and outward beauty will fade with time, but true beauty only grows as the years pass. Encourage her to cultivate that beauty, to spend time in your Word, in prayer, and with other spiritually beautiful women. May she compare herself only to the standard of your holy Word, and may the only thing she finds repulsive be the ugliness of sin. Lord, grant her grace to develop the true loveliness that comes only from you.",
    "credit": "Joan Hartley"
  }, {
    "title": "she would be a loving sister",
    "passage": "I entreat Euodia and I entreat Syntyche to agree in the Lord.\nPhilippians 4:2",
    "devotion": "Sisters have a truly unique kind of relationship with their siblings. In his good creation, God made women with an amazing and deep capacity for relationship; this is never more so on display than within the family of the local church. Here, Christian women become sisters of numerous brothers and sisters, both older and younger, playing an integral role in the unity and health of the local church body. However, for as long as we are still battling that abiding sin nature, relationships will also have the potential for argument, hurt, resentment and gossip. Let us pray that God will help our daughters to be supportive and encouraging sisters who are united by a love for Christ and his church and who refuse to be divided by petty differences.",
    "prayer": "Father, I am in wonder of the way you have created women, and I praise you for their unique gifts in creating and fostering relationships. Thank you for using them to strengthen and grow your church! I ask that you would bless my daughter with the grace and abundant love to use her gifts for the unity of the church, speaking words of wisdom and peace, avoiding all manner of back-biting, bitterness and gossip.\n\nPlease help my daughter to be a loving sister for the advancement of the church, to the glory of Jesus Christ our Lord. Amen.",
    "credit": "Ryan Freeman, Wesley Freeman"
  }, {
    "title": "she would be content in the Lord's provision",
    "passage": "Remove far from me falsehood and lying; give me neither poverty nor riches; feed me with the food that is needful for me, lest I be full and deny you and say, \"Who is the Lord?\" or lest I be poor and steal and profane the name of my God.\nProverbs 30:8-9",
    "devotion": "Our world is consumed with the pursuit of things. Our culture values wealth and prosperity, brand names and big cars, large houses and large living. Money is a constant draw on the hearts of many, and our daughters are not immune. She will contend with the idols of this land, whether she has little or much. She, like we, cannot serve God and money. (Matt. 6:24)",
    "prayer": "Oh God, protect the heart of my daughter from the idols of money and prosperity. Guard her desires and keep her content with what you provide, not with what the world says she should have. Do not give her so much that she forgets you, or so little",
    "credit": "Nick Horton"
  }, {
    "title": "she would run to the throne of grace",
    "passage": "For we do not have a high priest who is unable to sympathize with our weaknesses, but one who in every respect has been tempted as we are, yet without sin. Let us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.\nHebrews 4:15-16",
    "devotion": "As a parent, I've tried to reassure my daughter that she can come to me about anything. I want her to be confident that my love for her will not waiver. How much more should I desire her to draw near to her Heavenly Father? As a child of God, she can be confident that he will receive her. She doesn't come to him on the strength of her record but on the perfect record of Jesus Christ.",
    "prayer": "Father, I thank you for saving my daughter. I thank you she can draw near to you, not in the hope that her good deeds outweigh the bad, but because of Jesus. He has taken her record of wrongs on the cross and has transferred his record of righteousness to her. May she hold fast to this truth when she is struggling with sin and discouraged with her Christian walk. I pray the gospel will be louder and clearer than the voices that tell her she needs to try harder and do better before she can come to You. May she run to your throne of grace with confidence, knowing that grace and mercy flow freely to your children. In Jesus' Name, Amen.",
    "credit": "Persis"
  }, {
    "title": "she would live to please Christ and not others",
    "passage": "For am I now seeking the approval of man, or of God? Or am I trying to please man? If I were still trying to please man, I would not be a servant of Christ.\nGalatians 1:10",
    "devotion": "My oldest daughter is our big helper; she's always quick to help when asked, and wants to do whatever she can to please us. But as you can imagine, this has a dark side. When she knows we're disappointed in something she's done, it crushes her. A stern look can send her into tears. As nice as it is that she wants us to be happy with her behavior, I want my little girl to see that pleasing us isn't the point. If we were trying to please people, we wouldn't be servants of Christ (Gal. 1:10). Instead, we live to please Christ-and this is something we can do only when we're relying on His righteousness.",
    "prayer": "Father, thank you for reminding us our \"goodness\" is never good enough-that we must always rely on Christ's perfect righteousness to stand before you. I pray my daughter's desire would be to please you before anyone else, that all she does would be to bring glory to your name, and she would do this first as foremost by trusting in the gospel. Amen.",
    "credit": "Aaron Armstrong"
  }, {
    "title": "she would place her life in the care of the Almighty",
    "passage": "And who knows whether you have not come to the kingdom for such a time as this?\nEsther 4:14b",
    "devotion": "Esther became a woman of notoriety during a tumultuous time in Israel. She did not choose it, and in fact, initially shrank back from it. Yet in the end, rather than seeing herself as a mere victim of circumstance, she placed her life in the care of God Almighty and stepped into history with her eyes set firmly on him. Rather than use her beauty and intelligence for her own gain, she trusted God with the very blessings he had given her and secured the salvation of many by her faith and willing obedience.",
    "prayer": "Heavenly Father, we cannot control the course of history or choose the times into which our daughters are born. We can and must, however, choose to entrust our daughters to you \"for such a time as this.\" Lord, we ask that you would give them wisdom. We ask that you would enable them to use the gifts you have bestowed upon them for your glory. Make them confident in you and bold to obey you. And may they, by this obedience, bring the hope of the gospel to many.",
    "credit": "Joan Hartley"
  }, {
    "title": "Christ would heal her wounds",
    "passage": "He heals the brokenhearted and binds up their wounds.\nPsalm 147:3",
    "devotion": "We prayed this same thing for our wives and for our sons in those respective challenges. We live in a culture filled with wounded and broken people. Sometimes broken because of their own rebellion; sometimes broken because of the rebellion of someone else. God heals up the brokenhearted and binds up their wounds. No matter their age, our daughters likely carry with them wounds; some emotional, some physical, others mental or spiritual. Christ is redeeming this brokenness. Whatever wound your daughter is carrying, pray today that Jesus would give her healing. No wound is too deep for Christ to fill up with his goodness and mercy.",
    "prayer": "Father, I am grateful that you heal the brokenhearted and bind up our wounds. Lord, I know that my daughter has wounds. It pains me to think that some of them are there from my own sin. I also know that praying for her healing might mean that you have to reopen the wounds to give her redemption in these areas. Heal the places in her heart that are broken. Bind up her wounds. Overwhelm her with your grace and mercy. Where there were once ashes, replace them with your beauty. Amen.",
    "credit": "Mike Leake"
  }, {
    "title": "she would step out in faith",
    "passage": "Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me.\nIsaiah 6:8",
    "devotion": "Too often we are prone to go with the flow; following the crowd and trying our best to fit in. Jesus' call to us is to follow him no matter how we may be perceived or treated. This can be terrifying for us, especially for the young. We live in an age of conformity where our fashion, our music, our trends must conform to social norms or we are seen as odd. It takes great courage to step out in faith to live radically different for God. Even parents have a hard time allowing their kids to choose ministry over sports and academics, to choose missions over careers, and to choose to stand apart rather than fit in. Our daughters need courage and vision to stand up and step out for the sake of the Gospel.",
    "prayer": "Lord, I pray for my daughter, that you would inspire her, fill her with your Holy Spirit and empower her to stand up before you and say, \"Here am I, send me.\" I pray that you equip her and surround her with your church so that she is well prepared to do the good works that you have prepared for her to do. Lead her, teach her, and live through her in every way that will bring you glory. Give her the humility and courage to decide that standing up for her faith and following you is more important than fitting in and being liked. Comfort her when she is persecuted, strengthen her when she is weak, and protect her from the attacks of the enemy.",
    "credit": "Corey Whittaker"
  }, {
    "title": "she would be blessed with a godly husband",
    "passage": "\"Therefore a man shall leave his father and mother and hold fast to his wife, and the two shall become one flesh.\" This mystery is profound, and I am saying that it refers to Christ and the church. However, let each one of you love his wife as himself, and let the wife see that she respects her husband.\nEphesians 5:25-33",
    "devotion": "Parents (Dare I say it? Especially fathers!) feel an incredible need to protect, cherish and guard over our daughters. One of the scariest moments we face in life is entrusting the care and provision for our daughter into the hands of another man. After all, who could possible measure up to our standards, right? And yet, there is no joy like knowing that your daughter has found a man who is dedicated to loving her in a Christ-like manner, devoting himself to her care and wellbeing. This is something that we should be praying for our daughters of any age - newborn, teenager, or adult! One of the greatest blessings our daughter can find in this life is a man who will love her like Christ loved the church.",
    "prayer": "Father, it's never easy for me to admit that I really have no control of my own over my daughter's life. Her days are completely in your hands, as much in her marriage as in her health, growth and salvation. So I pray to you, the source and giver of every good gift, that you would provide my daughter with a godly man for a husband: a man who loves Christ first and won't idolize her; a man who loves her so much more than himself; a man who will wash her with your word and cherish her every day. Please bless her with the wisdom to trust in you to provide such a man, if you so choose, and to not settle for anything less. Amen.",
    "credit": "Ryan Freeman, Wesley Freeman"
  }, {
    "title": "she would be content in her circumstances",
    "passage": "And he made from one man every nation of mankind to live on all the face of the earth, having determined allotted periods and the boundaries of their dwelling place...\nActs 17:26",
    "devotion": "Our younger daughter is our little go-ahead girl. When she was 18 months old, she decided it was time for her to go to school. So, when my wife was dropping off our oldest at her class, she decided to go hop into the coat room and start taking her boots off, too. When my wife realized what was happening and explained to Hannah that she couldn't go to school yet, she was heartbroken. Then, she examined the other children and said to her mom, \"I need a pack- pack.\" Since then, this tendency has only increased. She's always up to something. She's very, very bright (terrifyingly smart, actually) and just wants to go and do the next thing. The struggle for her is contentment-accepting the limitations that exist (primarily due to her age-it's tough being not-quite four), and enjoying her present circumstances. She needs to see that while there are lots of exciting adventures to come, we need to appreciate our current circumstances, for God has placed us here at this time for our good.",
    "prayer": "Father, thank you that you establish the times in which we live, and that you know all our days from beginning to end. Please help my daughter to be content in her circumstances and to enjoy the day you've given her even as you prepare her for the next. Amen.",
    "credit": "Mike Leake"
  }, {
    "title": "she would seek knowledge for the sake of knowing God",
    "passage": "I keep asking that the God of our Lord Jesus Christ, the glorious Father, may give you the Spirit of wisdom and revelation, so that you may know him better.\nEphesians 1:17",
    "devotion": "I often pray that my daughter would develop a passion for learning and studying God's Word. I also often forget the point of seeking this knowledge. Head knowledge has the potential to do nothing but enlarge the ego and create a false sense of self- righteousness and good standing before God. Paul tells us that the pursuit of wisdom and revelation is indeed a worthy one, yet we do this so that we may know our Father better. The world may occasionally dress us up with accolades and praise for any knowledge we possess, but God looks at the heart. Let us pray that our daughters choose to forego the praise of man in favor of a heart clothed with the longing to know God more deeply.",
    "prayer": "Father, I thank you for the ability we have to expand our knowledge of you and grow in understanding. I pray that you would plant in my daughter a deep desire to seek you and know you. Keep her free from the chains of impressing others and from the vanity that knowledge can create. I pray that learning would lead her to greater worship and give her power to understand your incredible love for her. In Christ's name, I pray, Amen.",
    "credit": "Sarah Van Beveren"
  }, {
    "title": "she would not be embarrassed of her femininity",
    "passage": "So God created man in his own image, in the image of God he created him; male and female he created them.\nGenesis 1:27",
    "devotion": "Elisabeth Eliot wrote this 15 years ago, it is even more true today: \"I find myself in the sometimes quite uncomfortable position of having to belabor the obvious, and hold up examples of femininity to women who almost feel apologetic for being feminine or being womanly. I would remind you that femininity is not a curse. It is not even a triviality. It is a gift, a divine gift, to be accepted with both hands, and to thank God for. Because remember, it was His idea...\"\n\nThe world would have our daughters believe their femininity is something for which to apologize. It is not. Let us praise God for giving us the gift of femininity in our homes. Also, let us pray that she might not be embarrassed by her femininity but \"accept it with both hands\" and glorify God through the gift of being female.",
    "prayer": "Lord, thank you for my daughter's femininity. Thank you for her tenderness and sensitivity. I'm glad that she is a woman-and I'm thankful for all that this means. I pray Lord that she delights in this sacred calling of bearing your image as a female. Help her rejoice in this gift and not be embarrassed by her femininity. Help her be the woman that you call her to be. May she reflect your glory.",
    "credit": "Mike Leake"
  }, {
    "title": "she would be saved",
    "passage": "...because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.\nRomans 10:9",
    "devotion": "The prayer of every parent for his or her daughter is that she \"will be saved\". We pray that she will one day be with us in heaven singing praises to a glorious and transcendent God. As parents, the desire to care for our daughters is fused into our DNA. Whatever we can do for them, we want to do. But this is something they must do on their own. They must confess for themselves. They must believe for themselves. We must lift them before our glorious God in prayer that he draw them to himself so that they may indeed believe and confess. And we must trust God to accomplish his will in this, all for his glory alone.",
    "prayer": "Lord, thank you for being mighty to save. You sent your Son to die for an undeserving people. In His death, we are saved from our sins and adopted into your family. We are called to confess that Jesus is Lord and to believe that you have raised him from the dead. Help my daughter in her belief. Pour out your grace on her in such a way that she has no other option but to submit her life to your authority. May she see your goodness as shown through your Son and my savior - Jesus Christ. May she one day soon confess and believe and be saved. I thank you, Lord, for your goodness in her salvation. Amen.",
    "credit": "John Coakey, Jr."
  }, {
    "title": "her parent(s) would persevere in prayer",
    "passage": "But while he was still a long way off, his father saw him.\nLuke 15:20",
    "devotion": "It's been said that the waiting is always the hardest part. For a parent watching a child go through a prodigal journey, this is especially true. As hours turn into days, days turn into months, and months turn into years, a parent can become frustrated. \"It has not changed; it will never change,\" we'll say to ourselves in sorrow. In these times, our feelings become a terrible enemy. But we must keep praying and watching as the father in Luke 15 did-waiting for his beloved child to return. Be still and know that he is God and is able to bring her safely home.",
    "prayer": "Father, it is amazing to me when I realize that your love for my daughter is even greater than the love I have for her and that the depth of your feeling for her goes even deeper than my own. I am comforted to know that you care for her and that she is always before you. As I watch my daughter and her prodigal journey, I know that though she is now far from you, she is not out of your sight. Lord, help me to persevere in prayer for her-trusting in your ability to bring her safely home.",
    "credit": "Cliff Craig"
  }, {
    "title": "her heart would be guarded from anxiety and fear",
    "passage": "Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.\nPhilippians 4:6, 7",
    "devotion": "I am a vivid dreamer. One inch, flying kangaroos! Russian mafia hit men! Cars careening off cliffs into dark waters below! Fears can crowd me in the night. Foggy and fictitious, they wake me and then leave me, heart pounding, in a blackened bedroom with my husband sleeping soundly nearby. A common concern of many women with whom I speak is anxiety, and it appears it becomes increasingly pervasive as we age. Little fears of our youth that could easily be put to rest with a nap or good night's sleep grow into tsunami size worries as families grow and we lose the control we never really had. May this not be so for our daughters as they grow in faith and trust in our sovereign Lord.",
    "prayer": "Lord Jesus, you have promised that you will guard our hearts and minds as we come to you with our requests. With this in mind, I place my daughter before you and ask you to encourage her to pray and praise. Lord, please give her a heart of thanksgiving and a sure knowledge that when she flees to you with her requests you will respond with the peace that passes all understanding. Guard her heart and mind, dear Lord, so that she might become the woman of faith you desire her to be.",
    "credit": "Joan Hartley"
  }, {
    "title": "she would delight in God",
    "passage": "Delight yourself in the LORD; And He will give you the desires of your heart. Commit your way to the LORD, Trust also in Him, and He will do it.\nPsalm 37:4-5",
    "devotion": "Our hearts are prone to find delight in almost anything and everything other than the source of true delight, God himself. We are constantly tempted to try and satisfy the desires of our hearts with anything and everything other than the only one who can do it, God himself. Yet it is only when we delight in the Lord and orient our hearts toward him that our desires are truly met and truly satisfied. When we commit ourselves to God in Christ through his Spirit, we find the fulfillment we were created to experience. We can only delight in the Lord and commit ourselves to him, however, through his power and help. So let us pray for our daughters, that their hearts would turn toward God, finding their delight in him, committing themselves to him, and having their deepest desires met by him.",
    "prayer": "Father in Heaven, thank you for creating us to find our satisfaction and fulfillment in you, and then allowing us to experience it through Jesus Christ. Help my daughter today to delight in you and your provision of salvation. Keep her from anything that would lessen her delight in you. Fill her with you Spirit that she may desire you and your ways above all else, and find her heart's desires satisfied in you. Help her to commit herself to you and trust you. We thank you that we can find our delight in you, that we can trust you, and that your promises are sure and certain. In Jesus' name, Amen.",
    "credit": "Gary L. Shultz, Jr."
  }, {
    "title": "she would be modest in character and conduct",
    "passage": "... likewise also that women should adorn themselves in respectable apparel, with modesty and self-control, not with braided hair and gold or pearls or costly attire, but with what is proper for women who profess godliness-with good works.\n1 Timothy 2:9-10",
    "devotion": "Our daughters are living in a culture saturated with lies; that their value is determined by their looks, by their career, by their social status. Whether growing up or as an adult, our daughters are taught the importance of elevating themselves above others. This takes many forms: boastful talk of personal or kids' achievements; seeking positions of power; undercutting others through gossip; and yes - revealing clothes. Let's pray that our daughters embrace humility and a modest character in order to glorify Christ, letting him in turn be the one to exalt them in the proper time.",
    "prayer": "Father, you have said that we should seek to humble ourselves, and that women in particular should pursue modesty in their lifestyle. I pray that you would enable my daughter's heart to believe your truth, not the lies of this world that teach the prideful idolatry of self-exaltation. Please help her to consider others first, to love others more than herself, and to seek to let her life shine as an example of gospel love - so that Christ Jesus would be the one exalted through her words and deeds, and that nothing she says, does, or wears would distract others from him. Amen.",
    "credit": "Ryan Freeman, Wesley Freeman"
  }, {
    "title": "she would delight in who God has called her to be",
    "passage": "Older women likewise are to be reverent in behavior, not slanderers or slaves to much wine. They are to teach what is good, and so train the young women to love their husbands and children, to be self-controlled, pure, working at home, kind, and submissive to their own husbands, that the word of God may not be reviled.\nTitus 2:3-5",
    "devotion": "As parents we must have godly dreams for our daughters; this will alleviate undue pressures. God's plan for our daughters is beautiful and suited to how he created them. Let us pray today that her parents would celebrate who God has created her to be. Furthermore, let's pray that she will surround herself with godly women to help her delight in his call on her life.",
    "prayer": "Thank you, God, for your tender care of our daughter and for the \"divine poetry\" that took place when you knit her together in the womb. Lord, give us the strength to model unhindered and unashamed joy in your will for us and in who you've created us to be. We pray that you would surround our daughter with many other women who will teach and BE Titus 2 for her. Give us open hands and enough faith in you to encourage our daughter to embrace your call on her life with joy.",
    "credit": "Nikki Leake"
  }, {
    "title": "she would view life from the perspective of eternity",
    "passage": "So we do not lose heart. Though our outer self is wasting away, our inner self is being renewed day by day. For this light momentary affliction is preparing for us an eternal weight of glory beyond all comparison, as we look not to the things that are seen but to the things that are unseen. For the things that are seen are transient, but the things that are unseen are eternal.\n2 Corinthians 4:16-18",
    "devotion": "Our daughters must know that life is hard. They must know that, in life, they will experience pain...and hurt...and struggle. But, they must also know that all that they feel in this life is temporary. As believers in the one true God, we are not dependent on what we see, but on what we don't see. Our hope and expectation are in an eternal life, not this temporary existence. So, their current troubles are nothing compared to their future happiness.",
    "prayer": "Lord, thank you for eternity. In eternity, my daughter will no longer feel the hurt of temporary things. In eternity, my daughter will not focus on things that are not forever. In eternity, may she not even be able to look back and see what she went through because what she has in you is so glorious. I thank you now for her happiness in your Son, who you sent to die on our behalf so that we could one day experience the \"eternal weight of glory beyond all comparison.\" Amen.",
    "credit": "John Coakey, Jr."
  }, {
    "title": "she would find her identity in Christ",
    "passage": "How great is the love the Father has lavished on us, that we should be called children of God! And that is what we are!\n1 John 3:1",
    "devotion": "Who am I? This is the cry of every young girl. Where do I fit in? Am I acceptable to others? Am I good enough, pretty enough, or smart enough? Our culture pushes so many values at our daughters, insisting that they can be everything and have everything. It tells girls that the approval of others is what really matters. As a result, they spend so much time worrying about accomplishments and appearance instead of seeking first God's kingdom and his righteousness. If they could grasp what it means to be loved by God and adopted as his daughters, perhaps the rest would become less important.",
    "prayer": "Father in heaven, I thank you for the love that you have lavished on my daughter. You have loved her from eternity and desire her love in return. Please speak louder than the world to her heart and mind, so that she may know your love for her. Help her to cherish your love above all else and to understand what it means to be a daughter of the King. Help me, as her parent, to assist her in prioritizing the message of scripture above the lies of the world. I want to lead her with my life and my lips. I pray that whenever she feels alone, insignificant, or unlovely that you will remind her of who she is to you.",
    "credit": "Corey Whittaker"
  }, {
    "title": "she would remember that she is not perfect",
    "passage": "This God - His way is perfect.\nPsalm 18:30",
    "devotion": "It is easy to neglect praying for how we relate to our children. We need to understand them in light of their fallen nature. It is equally easy to fall into a pattern of demanding obedience apart from the hope of the gospel. Thus, our children find morality more therapeutic than the gospel. They find their satisfaction in doing right rather than knowing the Righteous One. They develop self- righteousness. We need to remind ourselves that they are imperfect and are only made perfect by Christ. We want to teach them to love the Law of God. We want them to see how Christ's fulfillment of the Law of God as the Word incarnate covers the gap of their imperfections. His grace woos our daughters as it woos her parents.",
    "prayer": "Lord, today my daughter will betray you. Today, she will reveal her imperfection. She may act selfishly. She may say something mean to her mommy, friend, or sibling. She may be defiant. Not a day goes by where she will not betray your perfection. Yet, you lavish your grace upon her. Your grace is so bountiful; your grace is so lovely. May she not exploit your grace; may your grace compel her to loving obedience. Continue to remind me that she is not perfect. As I see her imperfections, help me extend grace out of patience. Remind me of my position as a sinner. In those moments when I want to grit my teeth and bellow an angry response to her defiance, change my disposition. Remind me of how you love. Remind me of how you're patient. Help me to speak tender words to her. Help me to firmly love her. And help me to preach the gospel to her constantly so she will remember and celebrate your bountiful grace.",
    "credit": "Joey Cochran"
  }, {
    "title": "she would delight in righteousness",
    "passage": "He has told you, O man, what is good; and what does the Lord require of you but to do justice, and to love kindness, and to walk humbly with your God?\nMicah 6:8",
    "devotion": "Our daughters will be tempted to act like the culture that surrounds them which is proud, selfish, and anything but humble toward God. Culture says, \"Serve yourself.\" It likes kindness so long as it costs you and not them. The God of the Bible is increasingly mocked and and ridiculed, and the temptation is to either walk away from God or compromise his Word and bring shame on his name. Yet, what is counter-cultural is the Christian's loving humility when no reward of man will ever come.",
    "prayer": "Father, help my daughter to shine like a city on a hill. Let her soul flow with humility towards you, understanding her sin and brokenness, and that the only way to walk with you is through your Son, Jesus Christ. Lord, keep her from pride so that she may respond to a hostile world in the love and kindness of Christ. Make her soul delight in righteousness so that justice may flow from her. Keep her humble toward you, God, so that in life she may glorify you and not bring shame upon your name. Lead my daughter not into temptation, but deliver her from evil. For in humility toward God, from which flow justice, love, and kindness, you are glorified! Glorify your name, O God!",
    "credit": "Nick Horton"
  }, {
    "title": "she would believe the Lord and be blessed",
    "passage": "And blessed is she who believed that there would be a fulfillment of what had been spoken to her by the Lord.\nLuke 1:45",
    "devotion": "When Mary found out she was pregnant with Jesus, she went to visit her cousin Elizabeth. Once there, the Holy Spirit led Elizabeth to praise God for what he was doing in their lives, especially by giving them Jesus. Elizabeth stated that Mary was blessed, Jesus was blessed, and she herself was blessed to be in their presence. She ends her song of praise by stating that Mary was blessed because she trusted God to do what he promised her to do. While our daughters will never experience the blessing of being the mother of Jesus Christ, they can experience the blessing of believing he will do what he has said he will do. Let us pray that our daughters would have faith and experience the blessings of faith.",
    "prayer": "Father in Heaven, thank you for sending your Son to us and for the blessings that come to us through faith in him. Please help my daughter put her faith and trust in you and your word that she may believe everything you have said to us. Help her trust that your promises are sure and certain and that we can count on you in all times and in all circumstances. Help her know and experience the blessings that faith in you brings. Thank you for saving us through faith, keeping us through faith, and blessing us with every spiritual blessings in Christ. In his name we pray, Amen.",
    "credit": "Gary L. Shultz, Jr."
  }, {
    "title": "she would come without shame",
    "passage": "Come, all you who are thirsty, come to the waters; and you who have no money, come, buy and eat! Come, buy wine and milk without money and without cost.\nIsaiah 55:1",
    "devotion": "It's possible to live an entire life struggling with the lie that you need to earn God's love. It is so counter intuitive to think that God's gift of salvation is free, and that we are not forever bound by an outstanding debt. We don't feel worthy to have been ransomed. But the weight that is lifted when we accept God's gift is the most humbling and breaking experience we'll encounter. Let us pray that our daughters would know this freedom.",
    "prayer": "Father, I thank you with all of the words I can muster that you beckon us to come! And not only do you ask us to come, but to come freely and without guilt. You give us more than we can ever earn, and I pray that my daughter would know this freedom. Let her always find joy in your presence and find comfort at your feet without shame. Thank you, God, for extending your hand. In Christ's name, Amen.",
    "credit": "Sarah Van Beveren"
  }, {
    "title": "she would be tender-hearted",
    "passage": "Finally, all of you, have unity of mind, sympathy, brotherly love, a tender heart, and a humble mind.\n1 Peter 3:8",
    "devotion": "I remember, early in my walk with Christ, listening to a live Keith Green album. Before one of his songs, Green prayed that his heart would have \"baby skin all over it\". I want this same thing for my precious daughter. I want her to be tender-hearted as the Scriptures command her to be. As a three-year old, her heart still has baby skin. But I know that the harshness of life outside of Eden will tempt her to harden her heart for protection. I want to take her natural tenderness and fan it into flame. May we have tender-hearted daughters.",
    "prayer": "Father, I pray that you cause my daughter's heart to have \"baby skin all over it\". Create and sustain within her a tender heart. Though the world may mock a sensitive heart, help her to know that it is very pleasing to you. May her heart be tender toward those you've put into her life. More than anything, I pray that her heart is tender toward you. I pray that the tender heart of Jesus shines through the heart of my little girl. Amen.",
    "credit": "Mike Leake"
  }, {
    "title": "her parents would continue to pray for her",
    "passage": "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus.\nRomans 15:5",
    "devotion": "This is my prayer for you. I pray that you would continue to pray for your daughter. Furthermore, I pray that you would encourage other parents to take this challenge and pray for their daughters. As you do this I pray that the God of endurance and encouragement would cause you to endure in your care for your daughter. I hope that you have grown in the Lord this month and that you have been encouraged. May Christ be glorified as you continue to love your daughter by praying for her.",
    "prayer": "Lord, thank you for all those that have prayed for their daughters. I pray that they would continue. Help me to continue praying for my precious daughter as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our homes for his name. Use us as living examples of your parental care. Amen.",
    "credit": "Mike Leake"
  }]
}