{
  "credits" : {
    "Mike Leake" : "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light.",
    "Rondi Lauterback" : "Rondi Lauterbach is married to Mark and has prayed for him for 35 years through the ups and downs of ministry, kids, and grandkids. She loves to help her friends and family see Jesus, at feastingonchrist.com.",
    "Sarah Van Beveren" : "Sarah Van Beveren is a wife and mother who spends her days raising three little girls, reading, and drinking coffee. She also writes at sarahvanbeveren.com.",
    "Catherine Parks" : "Catherine Parks is a Christ-follower, wife to Erik, mom, member of @cbc_nashville, co-author of A Christ-Centered Wedding (bhpub 2014)",
    "Bethany Wilhite" : "Bethany Wilhite is wife of Michael who is the meterologist at SouthernIndianaWeather.com, and the mother of Abigail, age 7 .  Bethany attends True Vine Baptist Church in Ferdinand, IN.",
    "Marci Preheim" : "Marci Preheim is wife to Arnie, mother of two teenagers, and women's Bible Study teacher at Community Bible Church in Nashville, TN. She is the author of Grace is Free: One Woman's Journey From Fundamentalism to Failure to Faith, and A Study in James: But He Gives Us More Grace. You can read more of her writing at www.marcipreheim.com.",
    "Kim Shay" : "Kim Shay is a wife, mother, bible teacher and blogger who lives in Canada. She has been married for 27 years, and has three young adult children. She blogs regularly at The Upward Call.",
    "Kimberley Suchta" : "Kimberley is the wife to Mark, who is an investigator for the Minneapolis Police Department. He also serves as a pastor at Redeemer Bible Church in Minnetonka, MN. They have 5 children.  She loves writing about the gospel and how grace affects every area of our lives, including marriage and parenting. She blogs at kimberleysuchta.com.",
    "Danielle Tejes" : "Danielle Tejes is a disciple of Christ, wife to Benjamin, and a member at Garden City Church in San Jose, CA.",
    "Joanna Teigen" : "Joanna Teigen shares life with her husband Rob, two sons, and three daughters in Michigan. She is the co-author of 88 Great Daddy-Daughter Dates, A Dad's Prayers for His Daughter, and A Mom's Prayers for Her Son.",
    "Nikki Leake" : "Nikki Leake is the wife of Mike and mother of two adorable children. She enjoys decorating, soul-food, elephant-petting, and worshipping Jesus.",
    "Ivonne Dueri" : "Ivonne is the wife of the Senior Pastor Johnny Dueri of the Iglesia en La Psz, Bolivia. She has been married 34 and a half years and has three adult children. The oldest Pablo is married to Monica. Claudia is 30 and Cecilia is 23. We are an adopted Church of Sovereign Grace Ministries."
  },
  "prayers" : [
    {
      "title" : "he will count on Jesus as his first and best friend",
      "passage" : "Greater love has no one than this, that someone lay down his life for his friends. You are my friends if you do what I command you. No longer do I call you servants, for the servant does not know what his master is doing; but I have called you friend, for all that I have heard from my Father I have made known to you.\nJohn 15:13-15",
      "devotion" : "Men seem to have a harder time making friends than women do, but they need them just as much. Our husbands need a friend who is more than just a golf buddy. They need a friend who is even closer than a brother. Jesus offers to be that friend to all who believe the gospel. It is a two-way relationship of deep intimacy and sacrificial love.",
      "prayer" : "Jesus, thank you for all the ways you love my husband, including as a friend. I pray he would receive the gift of friendship from you today and grow in experiencing all that this means. I pray he would share his heart with you and hear you share yours. I pray the Scriptures would become alive to him as your \"secret counsel\". I pray he would be eager to do all that you command as a gesture of loyalty to his first and best friend. You are the faithful one he can count on.",
      "credit" : "Rondi Lauterbach"
    },
    {
      "title" : "he would hold on to hope",
      "passage" : "Let us hold unswervingly to the hope we profess, for he who promised is faithful.\nHebrews 10:23",
      "devotion" : "In a world marred by sin, it can be difficult to stay focused. The heaviness of living a human life, unanswered questions, and everyday struggles can shift our gaze from the face of Christ. Jesus understood this plight, and instructed us to not lose heart, for we place our hope in the glory of God. Let us pray that our husbands would hold fast to this truth.",
      "prayer" : "Father, I thank you for your faithfulness and enduring love. I pray that the truth of your faithfulness would come alive to my husband, and that you would wash all doubt and fear of the unknown from his mind. Give him an unswerving confidence in your promises, and a peace that only your Spirit can bring. I pray that he would love you more than anything, and that he would desire you above all else. In Christ's name, amen.",
      "credit" : "Sarah Van Beveren"
    },
    {
      "title" : "he might find his greatest joy in God's glory",
      "passage" : "I will say to the north, Give up, and to the south, Do not withhold; bring my sons from afar and my daughters from the end of the earth, everyone who is called by my name, whom I created for my glory, whom I formed and made.\nIsaiah 43:6-7",
      "devotion" : "God's message through Isaiah to His people tells us why we were formed and made–for His glory. Let us pray for our husbands today that they might find their greatest joy in fulfilling the purpose for which they were created, enabled by saving work of Christ.",
      "prayer" : "Father, you created my husband for a singular purpose–the one thing for which you designed him, and the one thing that will truly bring him joy. May your Holy Spirit work in His heart to show Him your glory in the face of Jesus Christ through your Word, causing Him to find in You His greatest joy. May all his aims and ambitions be directed toward your own glory, and may he rejoice and be made glad in this. Amen.",
      "credit" : "Catherine Parks"
    },
    {
      "title" : "he would be sustained by God",
      "passage" : "I lay down and slept; I woke again, for the LORD sustained me.\nPsalm 3:5",
      "devotion" : "It is not easy for our husbands to keep going everyday. They get tired; sometimes they don't want to get out of bed and face the day. We understand because we feel the same way on some days. And yet, day after day they work to provide for us and our children. On other occasions, they may be worried with all the responsibilities of being a husband and father and they lie awake at night wrestling with burdens - financial, spiritual, etc. Today, let's pray for the Lord to sustain our husbands for the days ahead, the restless nights, and for us to show them respect.",
      "prayer" : "Lord God, You are sovereign. You are the ultimate provider and lover of our souls.  And yet, you have given a role that mirrors your relationship to your bride, the church, to our husbands.  This is not an easy road of loving, providing, and being a spiritual head.  Lord, please shower our husbands with your mercy and grace.  Be their rest as they lie down in peace and safety.  Lord, be their courage as they get up another day to live a life of worship to you as they reflect your love, grace, provision and protection to their family.  God you are so good to us, thank you for the gift of our husbands.  Continue to help us work out our salvation together in our roles as husband and wife.  Help us to show respect to them in our attitude and actions; help our hearts to submit to you Lord, as we lovingly and respectfully submit to our husbands without fear.  In all these things we pray in Jesus name, Amen.",
      "credit" : "Bethany Wilhite"
    },
    {
      "title" : "he would sacrifice as Christ",
      "passage" : "Husbands, love your wives, as Christ loved the church and gave himself up for her...\nEphesians 5:25",
      "devotion" : "There was a time, several years ago, when I suffered a protracted period of deep depression from which I was unsure I would emerge. My marriage was in peril. I could not eat. I could not sleep. God, in his mercy, pulled me from that miry pit (Psalm 40:2), yet he did so by the very human hand of my husband. I cannot describe in this short space the many ways my husband gave himself up for me when I could give him nothing in return, but his rescue mission left an indelible mark on my soul. In giving of himself for me, my husband not only saved my life, he redeemed our marriage and the future family relationships of generations to come.",
      "prayer" : "Lord Jesus, how you have loved us! How you have given yourself for us, your bride, your church. Lord, I would ask today that you call my husband to the same kind of love and self-sacrifice. I didn't deserve it from you, and I don't deserve it from him, but I so need it. Father, equip him, strengthen him, encourage him to love his bride as you have loved yours.",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would make war",
      "passage" : "Finally, my brethren, be strong in the Lord, and in the power of his might.  Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\nEphesians 6:10-11",
      "devotion" : "God wants us and our husbands to make war.  Against the world with all its temptations, against their flesh that so easily sways them, and against our enemy the devil who wants to steal, in any way possible, the glory that is due to God.  Our hearts are idol making factories (Calvin) with an assembly line churning out more and more every minute.  Pray with me that your husband would be able to make war against lust, greed, pride, and a whole other host of sins to the glory of God.  With the world, our flesh, and the devil trying to take us down - now is not the time for him (and us) to rest on our laurels and give up the fight just because he has been given the greatest gift of all - salvation.  If your husband is not yet saved, I would pray that his eyes are opened as he sees you fighting the fight.",
      "prayer" : "Father God, you are wonderful.  You have captivated our hearts and set your love on us.  We are yours and so grateful to be called your children.  Thank you for your everlasting love, for the grace you have given us and the abundant mercy you have shown.  Lord, we come for our own sake and for the sake of our husbands that you would help us in our fight against sin.  Help us to see worldly temptations for what they are, garbage, compared to the kingdom that awaits us.  Help our husband to make war against the flesh that lies and tells him that what he wants right now is the only thing that matters.  Help him to see that the father of lies wants to steal glory from you Father and help our husbands to know that the blood you shed is the victory over satan and the wickedness he is trying to sell.  God we are so weak.  We need you to be our help, our strength, and our armor.  Help us to fight as we know that you are fighting for us.  Show us where we have failed you and lead us in the right direction.  We want our husbands and our families to be holy and wholly devoted to you Lord.  We pray that you transform our hearts and help us to be an example, and encouragement, and respectful wife to our husbands.  In Jesus Name, Amen.",
      "credit" : "Bethany Wilhite"
    },
    {
      "title" : "he would gently lead",
      "passage" : "Therefore, as God's chosen people, holy and dearly loved, clothe yourselves with compassion, kindness, humility, gentleness and patience. Bear with each other and forgive whatever grievances you may have against one another. Forgive as the Lord forgave you. And over all these virtues put on love, which binds them all together in perfect unity\nColossians 3:12-14",
      "devotion" : "Jesus was the truest gentle-man that ever lived. He set the example for living with women in an understanding way. It wasn't just that He acted like a gentleman, but He was truly gentle with women. Women responded by opening their hearts to Him, sometimes in seemingly inappropriate ways (Matt 26:6-13). Paul instructs believers that the key to getting along with each other is kindness, humility and gentleness. These do not come naturally. They are the fruit of the Spirit (Galatians 5:23). Understanding fuels forgiveness. Gentleness and humility pave the way for understanding. What binds them all together is love.",
      "prayer" : "Lord, I pray that my husband will experience your gentle and kind love for him. I pray that his love for me would be an overflow of the love and grace he experiences from you. I ask that you would compel him to seek and desire you, more than he seeks and desires me. I know that if this is the case, his love for me will be pure, and not based on my performance, which falls short everyday. Lord may our marriage be characterized by grace and forgiveness. I pray that he would gently lead me, and our children to you. These things I pray in your sweet name Lord Jesus. Amen.",
      "credit" : "Marci Preheim"
    },
    {
      "title" : "he would find his identity in Christ",
      "passage" : "Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\n2 Corinthians 5:17",
      "devotion" : "The world desperately seeks to capture our hearts. Every day we are bombarded with messages that we are only as good as what we own or what we do. Paul tells us, however, that we are a new creation in Christ. We are no longer slaves to the logic and passions of the world. We are a people who now desire differently, and we desire God because we are his children. Let us pray that our husbands know their true identity.",
      "prayer" : "Father, I thank you for your act of redemption. I pray that my husband would find joy in his identity as your child, and that you would give him the strength to resist the messages and lures of this world. Help him to stand firm and boast not in his possessions or accomplishments, but in the work of Christ alone. I pray that he would be humble before you, and that you would give him a ferocious desire to seek your glory alone. In Christ’s name, amen.",
      "credit" : "Sarah Van Beveren"
    },
    {
      "title" : "he would be  witness in the workplace",
      "passage" : "...let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven\nMatt. 4:16",
      "devotion" : "Every day we live for Christ before a watching world. Christ's exhortation to those who sat before him as he preached the Sermon on the Mount is for us today, and for our husbands as they work day to day in their places of employment.",
      "prayer" : "Father, I pray for my husband as he goes to work in the world each day. Thank you for the work you give him to do which provides for our family. Thank you for using his skills and abilities for this vocation, this calling from you. As you have placed him specifically in his place of work, strengthen him each day as he lives as a light for you. Give him utterance to speak the words you would have him say, and protect him as he strives to work with integrity. Keep him respectful and gracious not only to his superiors, but also toward those he works with and those who work for him. Help him to be kind, fair, and gentle with others, so that others will see Christ reflected in his conduct. Enable him to work alongside those who may be hostile to his witness. Help him to be longsuffering and patient in hard circumstances. Father, it can be hard to work day in and day out where we feel hostility surround us. Remind my husband each day the value of his work and the importance of his witness.",
      "credit" : "Kim Shay"
    },
    {
      "title" : "he would know the Father's love",
      "passage" : "And the son said to him, 'Father, I have sinned against heaven and before you. I am no longer worthy to be called your son.' But the father said to his servants, 'Bring quickly the best robe, and put it on him, and put a ring on his hand, and shoes on his feet. And bring the fattened calf and kill it, and let us eat and celebrate. For this my son was dead, and is alive again; he was lost, and is found.' And they began to celebrate.\nLuke 15: 21-24",
      "devotion" : "It's so easy to forget that this is how our Father in heaven loves us. We tend to start feeling this sense of 'doom and gloom' when we think of repentance and forgiveness.  We forget that our Father is peering over the horizon, anxious to see us coming, and ready to embrace us and celebrate the fact that we have come home once again.",
      "prayer" : "Lord, I pray today that my husband would know this kind of love. I pray that he would not fall for the lie that he has messed up too much and therefore hesitate to run back home to you. I pray he would experience the joy of repentance...and see that there truly is a celebration awaiting him. That because of the life and death of your son, Jesus...you take great delight in him! I pray the pressures and demands of his day would not cause him to forget that you there, awaiting his return...but that they would be reminders of his desperate need to stay close to you.",
      "credit" : "Kimberley Suchta"
    },
    {
      "title" : "he would rejoice in decreasing",
      "passage" : "The one who has the bride is the bridegroom. The friend of the bridegroom, who stands and hears him, rejoices greatly at the bridegroom's voice. Therefore this joy of mine is now complete. He must increase, but I must decrease.\nJohn 3:29-30",
      "devotion" : "Far from being envious of the growth of Jesus' influence, John the Baptist tells his disciples he is like a man rejoicing at the happiness of his friend, the bridegroom. Rather than causing us sorrow or jealousy, our decrease and Christ's increase should be a source of joy. Let us pray today that our husbands would rejoice at the increase of our Savior's glory in their jobs, relationships, home-life, and every other endeavor.",
      "prayer" : "Father, it is a constant temptation to strive for the increase of our own glory, but we see in your Word that true joy comes when we decrease and You increase. You know my husband's dreams and goals, and You gave Him the talents and abilities He has. Please give Him an undivided heart, one that rejoices at each opportunity to make much of You and less of himself. May he have opportunities to use his gifts through Your power, for Your glory and his joy. Amen.",
      "credit" : "Catherine Parks"
    },
    {
      "title" : "he would experience the freedom of having God as his only Judge",
      "passage" : "But with me it is a very small thing that I should be judged by you or by any human court. In fact, I do not even judge myself. For I am not aware of anything against myself, but I am not thereby acquitted. It is the Lord who judges me.\n1 Corinthians 4:3-4",
      "devotion" : "Paul had been compared to other preachers and found lacking by the Corinthian believers. He could have entered into endless arguments with them, but instead he submitted himself to the one True Judge, who alone knows every thought and motive. This gave him the freedom to continue to love and serve despite criticism. Our world is full of judgments, too, from an impatient honk on the freeway to a written review from our boss to the accusations of our own conscience. Our husbands need the good news that the Lord is our judge, and our Savior, too.",
      "prayer" : "Jesus, thank you for saving my husband from eternal judgment. I pray he will know you today, not just as Savior, but as his only Judge. Please free him from the sting of criticism and unjust accusations by helping him live to please you alone. Guard him from the temptation to defend himself or engage in endless mental arguments. Free him to love and serve those around him. May he know your smile today as he lives before your face.",
      "credit" : "Rondi Lauterbach"
    },
    {
      "title" : "he would find his worth in Christ alone",
      "passage" : "And because of him you are in Christ Jesus, who became to us wisdom from God, righteousness and sanctification and redemption, so that, as it is written, \"Let the one who boasts, boast in the Lord.\"\n1 Corinthians 1:30-31",
      "devotion" : "I enjoy listening to the playful banter that often takes place when men gather. Lots of rib poking and baritone laughter. Lighthearted camaraderie at its finest and one of the few times I have thought it would be great to be \"one of the guys\". At times like these, however, I have sometimes seen the joking take a turn down a darkened path. It happens when camaraderie is overshadowed by competition, and boasting presides over banter. One man asks, \"Did I tell you about my _____________ (<—fill in the blank with some possession)?\" only to have the other reply, \"Oh yeah, I've got two of those.\" Oneupmanship can spoil an otherwise wonderful day... or friendship. How much better it is to be firmly convinced that all our worth is complete in Christ and that, should we boast, it is only in the Lord Jesus.",
      "prayer" : "Father, I lift my husband up before you with all his yearnings and desires, his longing for affirmation. I pray, Lord, that you would show him in your Word where his worth lies. Remind him of his standing in Christ. Speak truth to his questioning heart. Give him confidence to boast - but to boast only in the Lord. Work sanctification in him, Jesus, that he might model this to his family and friends and that your name would be glorified. Amen",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would have fearless contentment in Christ.",
      "passage" : "Keep your life free from love of money, and be content with what you have, for he has said, \"I will never leave you or forsake you.\" So we can confidently say, 'The Lord is my helper; I will not fear; what can man do to me?'\nHebrews 13:5-6",
      "devotion" : "With the God-given responsibility of being the head of the home, there is no doubt an overwhelming burden on our husbands to provide in many ways–spiritually, emotionally, and financially to name a few. They (along with us) face the deceptive desires to love money and to desire what others have. Let'spray for the truth that God will never leave or forsake us to anchor our husbands to Jesus. If we have Jesus, we don't need to love money or love what others have.",
      "prayer" : "Jesus, you know what we need. You know we need deep contentment in you and we will be exceedingly rich. As the husband bears a heavy financial burden to provide for our families, there is a natural lure to covet and to love money. Will you remind our husbands today that You will never leave us or forsake us, and if we have you, we have everything we need. Be his Helper today coming alongside him in ways that we fail or fall short. Make him fearlessly content in You. Jesus you are enough for him and for us, make our hearts believe this. In your matchless name, Amen.",
      "credit" : "Danielle Tejes"
    },
    {
      "title" : "he would be satisfied in the wife of his youth",
      "passage" : "Let your fountain be blessed,  and rejoice in the wife of your youth, a lovely deer, a graceful doe. Let her breasts fill you at all times with delight; be intoxicated always in her love.\nProverbs 5:18-19",
      "devotion" : "It may seem like a selfish prayer, but I pray this often for my husband...that he would find delight in only me. God loves answering this prayer. Because he loves marriage. He made marriage and he made sex to be a wonderful thing to keep a husband and a wife closely knit. And he knows what heart break and turmoil it brings when that bond is broken.",
      "prayer" : "So Lord, I pray today that you would protect my husband from all of the outside influences he is bombarded with in our culture. I pray that I alone would be his standard of beauty. I pray he would find great delight in me and that you would use this part of our marriage to bring us even closer together for the glory of your name. I pray that you would heal the things in our hearts that aren't allowing us to have the freedom in intimacy that you desire for us to have. Give us lots of grace and forgiveness with each other. Help us not to take each other too seriously as we grow old. Thank you for this safe place you have given us to express our love for each other.",
      "credit" : "Kimberly Suchta"
    },
    {
      "title" : "he would rest in Jesus’ accomplishments for him",
      "passage" : "Such confidence as this is ours through Christ before God. Not that we are competent in ourselves to claim anything for ourselves, but our competence comes from God. He has made us competent as ministers of a new covenant—not of the letter but of the Spirit; for the letter kills, but the Spirit gives life.\\n2 Corinthians 3:4-6",
      "devotion" : "Paul here woos the Corinthians back to loyalty to himself as their father in the faith, and the true gospel. False teachers had crept into the church and pulled the people away from the freedom and joy of the new covenant. These “false apostles” (11:13) were full of human credentials, boasting and legalistic rules. They had turned Church life into a joyless competition of works. The same thing happens to our husbands when they are weighed down with guilt over what they should do for Jesus, instead of resting in what Jesus has done for them. Let’s pray that our husbands would remember that their competence as leaders comes from Christ, and for the joy of the Holy Spirit that gives life.",
      "prayer" : "Lord please help my husband to rest secure in “the righteousness that comes by faith” (Romans 4:13). Please mold him into the man you are calling him to be, rather than the man I often pressure him to be. Help him to continue discovering the joy of being my hero. I know that you call Pauls and Barnabases and Johns and Peters—each with their own strengths and gifts. Lord draw my husband to believe and rejoice in the competence that comes from you. In your name I pray, Lord Jesus. Amen.",
      "credit" : "Marci Preheim"
    },
    {
      "title" : "he would know the deep love of Jesus",
      "passage" : "And the son said to him, 'Father, I have sinned against heaven and before you. I am no longer worthy to be called your son.' But the father said to his servants, 'Bring quickly the best robe, and put it on him, and put a ring on his hand, and shoes on his feet. And bring the fattened calf and kill it, and let us eat and celebrate. For this my son was dead, and is alive again; he was lost, and is found.' And they began to celebrate.\nLuke 15:21-24",
      "devotion" : "It's so easy to forget that this is how our Father in heaven loves us. We tend to start feeling this sense of 'doom and gloom' when we think of repentance and forgiveness.  We forget that our Father is peering over the horizon, anxious to see us coming, and ready to embrace us and celebrate the fact that we have come home once again.",
      "prayer" : "Lord, I pray today that my husband would know this kind of love. I pray that he would not fall for the lie that he has messed up too much and therefore hesitate to run back home to you. I pray he would experience the joy of repentance...and see that there truly is a celebration awaiting him. That because of the life and death of your son, Jesus...you take great delight in him! I pray the pressures and demands of his day would not cause him to forget that you there, awaiting his return...but that they would be reminders of his desperate need to stay close to you.",
      "credit" : "Kimberly Suchta"
    },
    {
      "title" : "he and his wife would be protecting from fault finding",
      "passage" : "And they heard the sound of the Lord God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the Lord God among the trees of the garden. But the Lord God called to the man and said to him, \"Where are you?\"And he said, \"I heard the sound of you in the garden, and I was afraid, because I was naked, and I hid myself.\"He said, \"Who told you that you were naked? Have you eaten of the tree of which I commanded you not to eat?\"The man said, \"The woman whom you gave to be with me, she gave me fruit of the tree, and I ate.\"\nGenesis 3:8-12",
      "devotion" : "\"The door is wide open!\"my husband grumbled. I recall that day, not too long ago, when we returned home and found that \"someone\"- picture my husband turning to me with an accusing eye - had skipped out of the house without shutting the front door. In fairness to him, I had been extremely forgetful that day, and I seemed to be the likely culprit. As the night wore on, however, I realized I had exited the house by the back door while he had left through the front, so guess who really left the door open...? In light of Adam and Eve's \"very bad day\", this was a small incident to be sure, but what struck me by it was the speed with which we accuse our beloved mates (whose company we were enjoying just seconds before) and the dark separation that causes in a marriage - if even for a short time.",
      "prayer" : "Lord, like Adam and Eve, my husband and I are fallen creatures in need of your redeeming work. Though you placed us in a union to bring you glory, we often fall short and blame one another as a result. Jesus, give us grace in this matter. Protect us from finding fault or holding grudges against each other. Help my husband be quick to lead and take responsibility and to forgive me when I fail him. Where he is weak, please make him strong in you. Amen.",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would keep his eyes fixed on the Lord",
      "passage" : "I will praise the LORD, who counsels me; even at night my heart instructs me. I have set the LORD always before me. Because he is at my right hand, I will not be shaken.\nPsalm 16:7-8 (NIV)",
      "devotion" : "In my wedding vows to my husband, I promised to follow him wherever he might lead in our life together. Keeping that promise has included living in five different states over the years. Marriage has been an adventure and I still would follow him to the ends of the earth.\n\nThe reason for this confidence is that I know he is following God's leading. He understands the truth that \"In his heart a man plans his course, but the LORD determines his steps.\" (Prov. 16:9) My husband has many dreams and goals, but when a crossroads is before him he looks for the Lord's leading and obeys. If God tells him \"go,\" how can I do anything but follow?",
      "prayer" : "Lord God, thank you for your perfect plans for my husband. You are the source of his talents, dreams, and the opportunities that come his way. I pray that he would never take his eyes off of you. Give him a desire to please you with his goals and decisions, surrendering his life to you in every way.\n\nDeepen my husband's faith to trust you even in times of frustration or disappointment. When he doesn't know which way to go, instruct his heart by your Spirit. Give him wisdom through your Word, and let him pursue righteousness above anything the world might offer.\n\nThank you for loving my husband and guiding him as he makes his way in this world. I praise you for your faithfulness—with you beside him he will not be shaken.  Amen.",
      "credit" : "Joanna Teigen"
    },
    {
      "title" : "his understanding of the Word would grow",
      "passage" : "Teach me, O Lord, the way of your statues; and I will keep it to the end. Give me understanding that I may keep your law and observe it with my whole heart\nPsalm 119:33-34",
      "devotion" : "Our husbands bear the weight of leading and supporting our families. That task cannot be undertaken apart from God's word. They need understanding that only the word of God can provide.",
      "prayer" : "Father, I thank you for a husband who believes that your word is truth. I thank you that he grew up in a home where the Bible was read and revered. Thank you that he has been an example to our children in showing his love of the word. I pray that in the midst of a busy schedule, with many responsibilities, he would continue to make time for your word. Many things intrude into his life, competing for his attention, but you want him in your word. Each decision he makes comes from a sanctified mind and heart; he needs the spiritual food of your word. Help him carve out the time to study your word and to mediate upon it. Remove the distractions and obstacles that may stand in his way. And when he does have those moments, give him understanding of your law, that he may observe it with his whole heart.",
      "credit" : "Kim Shay"
    },
    {
      "title" : "God would be his Shepherd",
      "passage" : "I am the good shepherd. I know my own and my own know me, just as the Father knows me and I know the Father; and I lay down my life for the sheep. And I have other sheep that are not of this fold. I must bring them also, and they will listen to my voice. So there will be one flock, one shepherd.\nJohn 10:14-16",
      "devotion" : "Life can be overwhelming and we can be tempted to direct our own steps and instruct our own hearts; especially when things don't go our way or God's timing isn't the same as ours. The Word says that a man plans his way, but the Lord directs His steps and that if we delight in the Lord He will make our paths straight. The world, some Christian cultures, and even our own hearts delude us into endlessly searching for that mystical, hidden path that God is \"keeping \"from us. In reality God's will for us is thanksgiving and conformity to His Son. Let's pray fervently for God to bless our husbands with the grace to search for, clearly hear, and obey The Shepherd's Voice.",
      "prayer" : "Lord Jesus, thank you for the gift of our husbands. As we come before you now, help us rid our hearts of any bitterness towards our husbands that our prayers may not be hindered. Lord, we know that you are the Shepherd of our husband's souls. We know that you desire to gently lead, guide and instruct their hearts and mold their lives into conformity to Christ. While he is in the pasture you have lovingly placed him in, help him learn to drop everything at the sound of your voice. (In my mind I am picturing a grazing sheep's response to his shepherd and it's making me smile...) In Jesus Name, Amen.",
      "credit" : "Nikki Leake"
    },
    {
      "title" : "he would remain humble before God and subject to other godly men",
      "passage" : "But he gives more grace. Therefore it says, \"God opposes the proud, but gives grace to the humble.\"\nJames 4:6",
      "devotion" : "The most important thing in a man's life is his attitude towards God. He is to be always watchful of his heart's attitude so that pride does not creep in. For this he needs God's help and the guidance of the Holy Spirit.",
      "prayer" : "Father, we pray that you will help our husbands to remain humble before you. Please make him aware to watch of any prideful attitude that comes up in his heart. Give them healthy relationships with other godly men with whom he can open up his heart. Give them more grace so that he pleases your heart at all times. In Jesus name we pray.",
      "credit" : "Ivonne Dueri"
    },
    {
      "title" : "he would be courageous",
      "passage" : "Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.\nJoshua 1:9 ESV",
      "devotion" : "Joshua faced a daunting task. He was to do what Moses did not—lead the people of God to set foot in the Promised Land. Our husbands will, likewise, face difficult things that call for courage. They are called upon to daily exhibit strength and courage. Let us pray today that they would find their strength and courage in the Greater Joshua that has given his people true rest.",
      "prayer" : "Lord, I know that it would be very easy for my husband to cave in to fear. There are many things in his life in which he must be strong and courageous. Help him today to trust in the freedom that Jesus has purchased for him. I pray that he would find both rest and deep courage in the presence of Jesus. Amen",
      "credit" : "Nikki Leake"
    },
    {
      "title" : "he would pursue peace",
      "passage" : "If possible, so far as it depends on you, live peaceably with all.\nRomans 12:18 ",
      "devotion" : "God tells us, through the apostle Paul, that no matter the person or the situation we are to pursue peace. We know that the only way that peace is possible is because of the work that Jesus has already done. Because of His work we are able to pursue peace in all of our relationships. Peace can be evasive. Let’s pray today that our husbands would know the peace of God and that this peace would cause them to live peaceably with all.",
      "prayer" : "Lord, I thank you for the peace that you have given us through Christ. I pray today that you would continue to work in my husbands heart to make him a man of peace. Help him to do everything that he can to have peace in his relationships. Give him peace and cause him to be a bridge to peace for other men. Amen.",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would have eyes to see God's protection all about - for his family and him",
      "passage" : "When the servant of the man of God rose early in the morning and went out, behold, an army with horses and chariots was all around the city. And the servant said, \"Alas, my master! What shall we do?\" He said, \"Do not be afraid, for those who are with us are more than those who are with them.\" Then Elisha prayed and said, \"O LORD, please open his eyes that he may see.\" So the LORD opened the eyes of the young man, and he saw, and behold, the mountain was full of horses and chariots of fire all around Elisha.\n2 Kings 6:16-17",
      "devotion" : "Television. Radio. Forwarded emails. Facebook. Twitter. So many bits of information bombard our psyches these days - incessant and rapid fire. It's sometimes hard to tell if the world is really coming unglued or if we just know about too many things in \"real time\". It could make a man crazy and actually may - especially if a man thinks it would make him weak to talk about his worries for his family.",
      "prayer" : "Lord, as you did for Elisha and the men who served with him, we would ask today that you open our husbands' eyes to the great protection that is all about them when they are walking with you. We pray for spiritual eyes to see your goodness, your might, and your love - for him and his family. We pray that he would have eyes to see YOU and to stand fast and trust you in all things. Amen.",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "the work of his hands would be lasting",
      "passage" : "He is like a tree planted by streams of water that yields its fruit in its season, and its leaf does not wither. In all that he does, he prospers. The wicked are not so, but are like the chaff that the wind drives away.\nPsalm 1:2-4",
      "devotion" : "We are a people with divided interests with many good things demanding our attention. This intensifies our need for wisdom. As the head of our households, our husbands have a special responsibility to lead our family (and others entrusted to them) to embody what is lasting. That will actualize in many different ways. Let's pray for our husband's ministry to us and others today; that it would not be like chaff in the wind or vain chasing of the wind without purpose, but that it would yield sweet fruit for the kingdom and our families.",
      "prayer" : "Lord, we come to you today on behalf of our husbands. We thank you for giving them hearts to follow your leading, and minds to discern what is lasting. Lord, we pray that they would be sensitive to your Spirit and that you would give them the forbearance to build the a lasting house—brick by brick. May you encourage and admonish and bless them in their endeavors, and may even the smallest vision of fruit from their labor bring them joy. We love you, Lord, and we give our husbands to you. Thank you for the privilege of being their helpers on this road. Amen.",
      "credit" : "Nikki Leake"
    },
    {
      "title" : "he might have eyes to see",
      "passage" : "So Ananias departed and entered the house. And laying his hands on him he said, \"Brother Saul, the Lord Jesus who appeared to you on the road by which you came has sent me so that you may regain your sight and be filled with the Holy Spirit.\" And immediately something like scales fell from his eyes and he regained his sight. Then he rose and was baptized; and taking food, he was strengthened.\nActs 9:17-19",
      "devotion" : "We all have areas of spiritual blindness. In this account, the Lord Jesus sent a believer to the most unlikely of converts-to-be. Even Ananias couldn't believe that he was hearing God correctly when he was told to seek Saul out in order to share the good news with him. What an amazing story of God's relentless pursuit of sinners like us and the resulting glory of sight restored when Saul submits to the Lord's healing touch!",
      "prayer" : "Father, sometimes my husband, like me, is blind to the spiritual truths you want to reveal to him. Father, some husbands are even completely blind to knowing and loving you. Lord, I pray for my husband and husbands everywhere - that they might have 20/20 vision for the things you want them to see. I pray, too, for those men who are walking in spiritual darkness - that as you did for Saul, you would remove the scales from their eyes that they might see and come into your light to \"glorify you and enjoy you forever.\" Amen",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would be blessed and be a blessing",
      "passage" : "And he opened his mouth and taught them, saying: \"Blessed are the poor in spirit, for theirs is the kingdom of heaven. \"Blessed are those who mourn, for they shall be comforted. \"Blessed are the meek, for they shall inherit the earth. \"Blessed are those who hunger and thirst for righteousness, for they shall be satisfied. \"Blessed are the merciful, for they shall receive mercy. \"Blessed are the pure in heart, for they shall see God. \"Blessed are the peacemakers, for they shall be called sons of God. \"Blessed are those who are persecuted for righteousness' sake, for theirs is the kingdom of heaven. \"Blessed are you when others revile you and persecute you and utter all kinds of evil against you falsely on my account. Rejoice and be glad, for your reward is great in heaven, for so they persecuted the prophets who were before you.\nMatthew 5:2-12",
      "devotion" : "Kevin DeYoung has posted an interesting article in which he asks us to consider what kind of blessing we are. Contrasted to the Lord's teaching in the Sermon on the Mount, many of us buy into what Pastor DeYoung calls \"the Beatitudes of the World\". May it not be so for our dear husbands!",
      "prayer" : "Lord Jesus, thank you for teaching us in your Word about those things that bless us even as we bless others. I pray today that you would impress these deep truths upon my husband's heart. May he contemplate and embrace your call to meekness, mercy, purity, and peacemaking. May he hunger and thirst for righteousness. May he rejoice and be glad - even when he is persecuted for loving and walking with you. Lord, bless my husband this day, and please make him a willing blessing to others.",
      "credit" : "An anonymous wife"
    },
    {
      "title" : "he would approve what is vital",
      "passage" : "And it is my prayer that your love may abound more and more, with knowledge and all discernment, so that you may approve what is excellent, and so be pure and blameless for the day of Christ, filled with the fruit of righteousness that comes through Jesus Christ, to the glory and praise of God.\nPhilippians 1:9-11",
      "devotion" : "When Paul prays for the Philippians he prays that they would have a love that keeps growing. But it is not any type of love–it is a love that is rooted in knowledge and discernment. Such a grounded love, says Paul, will lead them to approving what is excellent. Another way to say this is that Paul is praying that they would approve what is vital–and this approving will lead to their blamelessness. It is not as difficult for us to choose the really good thing from the really bad thing. What is more difficult is choosing the best thing from a choice of pretty decent option. Today let's join Paul in his prayer, and pray for our husbands that they would approve what is vital.",
      "prayer" : "Lord, my husband will be given many choices today. Some of these choices will be easy and others will be between equally valid options. Yet, we know that there are some things that are more vital than others. Stir up my husbands heart in such a way with your grounded love, that he would choose the things that are vital. Help him to live a focused and concentrated life with a single-minded pursuit of your glory. Give him the strength to do this in a very distracted and distracting world. Amen.",
      "credit" : "Nikki Leake"
    },
    {
      "title" : "he would set his mind on things that are above",
      "passage" : "If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Set your minds on things that are above, not on things that are on earth. For you have died, and your life is hidden with Christ in God.\nColossians 3:1-3",
      "devotion" : "Augustine once said, \"Our hearts are restless, until they can find rest in you.\" Augustine is right, when our minds are set on earthly things they will never find rest. God alone is able to captivate our hearts. Today, let us pray that our husbands would focus on the things that are above. Let us also pray that they will find the rest and comfort that comes from such a focus.",
      "prayer" : "Lord, we come to you today asking you to grant our husbands the rest that can only come from you. We pray that you would help them to give to you the burdens that they carry. Give to them a single-minded focus on the things that are above. You alone are worthy of such a focus. Thank you that their lives are hidden in Christ. Give him rest in you. Amen.",
      "credit" : "Nikki Leake"
    },
    {
      "title" : "his wife would continue to pray for him",
      "passage" : "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus,\nRomans 15:5",
      "devotion" : "It is fitting for us to close out our 31 days of praying for our husbands in the same way. I pray that you would continue to pray for your husband. Furthermore, I pray that you would encourage other wives to take this challenge and pray for their husbands. As you do this I pray that the God of endurance and encouragement would cause you to endure in your love for your husband. I hope that you have grown in the Lord this month and that you have been encouraged. May Christ be glorified as you continue to love your husband through praying for him.",
      "prayer" : "Lord, thank you for all those that have prayed for their husbands. I pray that they would continue. Help me to continue praying for my husband as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our homes for His name. Use us as living examples of you. Amen.",
      "credit" : "Nikki Leake"
    }
  ]
}