{
  "credits" : {
    "Tim Challies": "Tim Challies is husband to Aileen and father to three children. Tim serves as a pastor at Grace Fellowship Church in Toronto, Ontario. He is also a book reviewer for WORLD magazine and co-founder of Cruciform Press. Tim has written three books: The Discipline of Spiritual Discernment, Sexual Detox: A Guide For Guys Who Are Sick of Porn, The Next Story: Life and Faith After the Digital Explosion",
    "Mike Leake": "Mike Leake is associate pastor of First Baptist Church of Jasper, IN. He and his wife, Nikki have two children - Isaiah and Hannah. Mike is the author of Torn to Heal and regularly blogs at Borrowed Light.",
    "Dr. Joel Beeke": "Dr. Joel Beeke is president and Professor of Systematic Theology and Homiletics at Puritan Reformed Theological Seminary, a pastor of the Heritage Netherlands Reformed Congregation in Grand Rapids, Michigan, editor of Banner of Sovereign Grace Truth, editorial director of Reformation Heritage Books, president of Inheritance Publishers, and vice-president of the Dutch Reformed Translation Society. He has written, co-authored, or edited seventy books and contributed 2,000 articles to Reformed books, journals, periodicals, and encyclopedias. His Ph.D. is in Reformation and Post-Reformation theology from Westminster Theological Seminary (Philadelphia). He is frequently called upon to lecture at seminaries and to speak at Reformed conferences around the world. He and his wife Mary have been blessed with three children: Calvin, Esther, and Lydia. You can follow Dr. Beeke at his blog, Doctrine for Life.",
    "David Murray": "David Murray is Professor of Old Testament and Practical Theology at Puritan Reformed Theological Seminary. Born in Scotland, Dr. Murray studied for the ministry at Glasgow University and the Free Church of Scotland College (Edinburgh). He served as pastor and Lecturer in Hebrew and Old Testament before joining the faculty of Puritan Reformed Theological Seminary in 2007. He and his wife, Shona, have five children: Allan, Angus, Joni, Amy, and Scot. He blogs at Head Heart Hand.",
    "Dave Harvey": "Dave Harvey serves as Pastor of Preaching at Four Oaks Church in Tallahassee, Florida. He is the author of Am I Called? The Summons to Pastoral Ministry, Rescuing Ambition, and When Sinners Say \"I Do\": Discovering the Power of the Gospel for Marriage.",
    "Timothy Paul": "Timothy Paul Jones serves as associate vice president and professor of leadership at The Southern Baptist Theological Seminary. Before coming to Louisville, Timothy led churches in Missouri and Oklahoma as a pastor and an associate pastor. He has authored or contributed to more than a dozen books, and he blogs at timothypauljones.com. Timothy and his wife Rayann have three daughters; the Jones family serves in the SojournKids children's ministry at Sojourn Community Church"
  },

  "prayers": [
    {
      "title": "grounded in the Gospel",
      "passage": "Now I would remind you, brothers, of the gospel I preached to you, which you received, in which you stand, and by which you are being saved, if you hold fast to the word I preached to you - unless you believed in vain. For I delivered to you as of first importance what I also received: that Christ died for our sins in accordance with the Scriptures, that he was buried, that he was raised on the third day in accordance with the Scriptures...\n1 Corinthians 15:1-4",
      "devotion": "It is good that you have this desire to pursue sexual purity. It is good that you are joining with us for these thirty-one days. And yet even a good desire can be sinfully motivated or sinfully directed. The sad fact is that we are never far from self-centeredness, from attempting to do these things for our own glory. We are never far from self-reliance, from attempting to do these things in our own strength. We are never far from legalism, from attempting to do these things to merit God's favor.\n\nThis is why we must begin with the gospel and this is why each of these thirty-one days must be founded upon and directed toward the gospel of Jesus Christ: that Christ died for our sin and that he was raised from the dead. The gospel makes all the difference. The gospel destroys self-centeredness by gripping our hearts with a great and growing desire to see Christ glorified. The gospel destroys our self-reliance by showing that Christ had to do what we could not do for ourselves. The gospel destroys our legalism by assuring us that we do not have to earn God's favor because through Christ Jesus we already have it. And so, as we embark together on these 31 Days of Purity, we must begin with, dwell upon, and finish with the gospel of Jesus Christ.",
      "prayer": "Father in heaven, please help me to glory in the gospel of Jesus Christ. Please remove from within me any desire for self-glorification, any hint of self-reliance, even the smallest thought that I would ever have to earn your favor. I pray that through these thirty-one days, my desire would be to see you glorified in my life, to grow in my reliance upon you, and to rest in what Christ has done in restoring peace and fellowship between me and you. Make the gospel resound in my heart today and every day.",
      "credit" : "Tim Challies"
    },
    {
      "title": "my identity",
      "passage": "Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality, nor thieves, nor the greedy, nor drunkards, nor revilers, nor swindlers will inherit the kingdom of God. And such were some of you. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.\n1 Corinthians 6:9-11",
      "devotion": "As men we face the temptation to gain our deepest identity from our sexuality. For some, identity is found in sexual prowess while for others it is defined by sexual failures. The Corinthians, like us, suffered from identity confusion. They had forgotten who they had become in Christ and they began to define themselves by things other than their Savior. In 1 Corinthians 6:9-11, Paul reminds the Corinthians (and us!) that who Christians are is found in a different and better place - our identity is found in a person. We are no longer identified as \"sexually immoral\" or \"homosexual\". Paul places that old identity in the past by saying \"such were some of you\". Our new identity is that of people who have been washed, sanctified, and justified. Because we have been saved by Christ, we have been given His identity. Let us embrace that new and better identity, and let us define ourselves by who we are in Christ.",
      "prayer": "Lord, thank you for establishing my identity in Christ so that I am no longer defined by sin and failure. Because you have purchased me and placed me in union with Jesus Christ, I know that all He has is given to me. Help me to believe that I am hidden in Christ so that it is no longer I who live but Christ who lives in me. Help me to live as if that is true. In the times when I feel like I'm defined by sexual failure, help me to remember who I am in Christ. When I'm driven to find my identity in my sexuality, stir my heart so I will live out my identity in Christ instead. In the times of victory, help me to remember that it is only through the name of Christ that I live in freedom from sin's captivity. I am yours. Amen.",
      "credit" : "Tim Challies"
    },
    {
      "title": "the grace of Godly sorrow",
      "passage": "For godly grief produces a repentance that leads to salvation without regret, whereas worldly grief produces death.\n2 Corinthians 7:10",
      "devotion": "We are all familiar with the ugly pattern of sin. You have just sinned again and you feel the weight of what you've done. You promise yourself you will never engage in that kind of sinful behavior again. You wake up in the morning with new resolve, but you just can't shake the nagging feeling of guilt. But still, over time those feelings of shame and guilt begin to dwindle and fade, and as they do, so too does your resolve. Before you know it you have sinned again and the cycle starts anew. It is just like the Proverb says: \"Like a dog that returns to his vomit is a fool who repeats his folly\" (Proverbs 26:11). Apart from the grace of godly sorrow this cycle will continue. It is only when we are granted a godly grief - a grief that hates sin more than its consequences - that we will pursue lasting change.",
      "prayer": "Father, only godly sorrow will do. I want godly sorrow for my sin, so help me to see my sin the way you do. Rescue me from a worldly and self-centered grief that only produces more death. Deliver me to a grief that cries with David, \"Against you, you only, have I sinned and done what is evil in your sight\" (Psalm 51:4). I trust that through the finished work of Christ you meet my repentance with grace and forgiveness. Lord, I plead with you to give me the painful grace of godly sorrow and repentance, today and every day. Amen.",
      "credit" : "Mike Leake"
    },
    {
      "title": "putting sin to death",
      "passage": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.\nRomans 8:13",
      "devotion": "Every Christian finds himself living out two realities: what he is in Christ, and what he is at present, wherever he happens to be in his earthly pilgrimage. The one reality is the fact of his justification \"by faith alone in Christ alone\" from the guilt of all sin and his personal union with Christ crucified, risen again, and received up into glory. The other reality is the Christian's degree of personal sanctification. Unlike justification, sanctification is never complete in this life. A substantial first step is the regeneration of the heart that marks the beginning of all true Christian life. But the way forward is rife with difficulties. We can go backward as well as forward in this way; and we all pass through seasons of stagnation and declension.\n\nThe Christian learns early on that sin still has a hold on him and remains in him, even \"besetting\" him, dogging his steps and burdening him with guilt and shame. Paul describes this remaining sin as \"another law in my members, warring against the law of my mind\" (Rom. 7:23). How does the believer respond to this \"law of sin\"? We must mortify (put to death) what Paul calls \"the old man and his deeds,\" and \"the lusts of the flesh\" (Rom. 8:13, 13:14; Col. 3:15). This mortification is both a gift (of the Holy Spirit) and a duty (ours). In our own strength we cannot accomplish any lasting mortification, without the Spirit's grace. But by the powerful and enabling grace of the Holy Spirit, we may and must hate sin, strangle it, and put a sword through it. We must meditate often on the horrific consequences of sinning against our beloved, triune God and Savior. We must know our own hearts and weaknesses, and avoid those situations that tend to promote the temptations that we are weakest in battling against. We must cast off all remnants of the life we left behind when we began to follow Christ. We must put ourselves under the death-dealing power of the cross of Christ (Gal. 6:14) so that the Spirit of Christ may put to death what is earthly in us.\n\nThe Spirit of Christ focuses us on Christ when teaching us how to mortify sin. Mortification begins when we condemn our sins as transgressions of the law of God. We confess these sins to be forgiven by God and cleansed by the blood of Christ. Then we forsake these sins for Christ's sake. Paul tells us to fight against sin from a position of strength (Rom. 6; Eph. 6). Know what you are in Christ. In Christ we have died unto sin. In Christ we have been raised again to newness of life. In Christ crucified we have been set free from sin's dominion and continue to die to sin, so that, as John Owen emphasizes, we experience the death of sin in the death of Christ. Sin may assail but cannot master us, so long as we stand firm in Christ, calling upon His name. In Christ we are assured of God's help in striving against sin. Though we may fall and lose various skirmishes against sin, because of our union and communion with Christ we have by faith the promise of ultimate victory and final deliverance, which, more than anything else, gives us hope and sustenance in the daily fight against sin. The only sin fatal to our cause is unbelief. Unbelief alone can rob us of God's grace and shut us out of His kingdom.",
      "prayer": "Ever blessed Triune God, in the light of Thy holy law, I confess my sorrow of heart that I have provoked Thee by my sins. By Thy Holy Spirit, deepen in me more and more the hatred of these sins, and the desire to flee from them, dying unto sin with Christ, and rising again in newness of life, to live unto Thee in righteousness and true holiness, for His sake. Believing Thy gospel promise, I ask Thee to forgive my sins and help me by Thy Holy Spirit to fight against and overcome sin, the devil, and his whole dominion, as a follower of Christ, and one who bears His name before the world. Amen.",
      "credit" : "Dr. Joel Beeke"
    },
    {
      "title": "confess your sin",
      "passage": "Blessed is the one whose transgression is forgiven, whose sin is covered. Blessed is the man against whom the Lord counts no iniquity, and in whose spirit there is no deceit. For when I kept silent, my bones wasted away through my groaning all day long. For day and night your hand was heavy upon me; my strength was dried up as by the heat of summer. I acknowledged my sin to you, and I did not cover my iniquity; I said, \"I will confess my transgressions to the LORD\" and you forgave the iniquity of my sin.\nPsalm 32:1-5",
      "devotion": "It took God's heavy hand of discipline for David to understand a simple truth: we need to confess our sin to God. We do not confess our sin so God will know what we have done - he already knows every deed, and even every thought and intention of the heart. We confess that sin for our own benefit, to acknowledge it before him and to seek his forgiveness. Though God assures us that at the moment of our salvation all of our sin is forgiven - past, present, future -  still we need to confess our sin before the Lord as an acknowledgement that every sin is ultimately directed at him, that every sin stems from a lack of delight in what he promises, and that we have knowingly, willingly, damaged our fellowship with him.\n\nDo you confess your sin before the Lord? A mumbled \"Forgive me\" once a week will not do. Confess your sin - even that shameful sexual sin - honestly, humbly and thoroughly. God knows it all, but he will hear your confession and, because of what Christ has done, it will be his joy to offer full forgiveness and reconciliation. Here is his promise to you: \"If you confess your sins, I am faithful and just to forgive you your sins and to cleanse you from all unrighteousness\" (1 John 1:9).",
      "prayer": "Father, I am a sinner. \"You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore\" (Psalm 16:11). And still, far too often, I seek pleasure in what you forbid. I allow myself to believe that your pleasures are inadequate and that something or someone holds out what I need or what I deserve. I confess my sin to you. I confess that my heart has desired what you say is evil; my mind has pondered what you say is sinful; my eyes have looked with lust instead of love. I confess my sin, I acknowledge it to you, and I joyfully receive your forgiveness.",
      "credit" : "Tim Challies"
    },
    {
      "title": "resting in forgiveness",
      "passage": "And you, who were dead in your trespasses and the uncircumcision of your flesh, God made alive together with him, having forgiven us all our trespasses, by canceling the record of debt that stood against us with its legal demands. This he set aside, nailing it to the cross.\nColossians 2:13-14",
      "devotion": "Every sin that you have ever committed has been put on record. Every sexual sin. Every lustful thought. Every shameful action. Every dark secret. Everything. And just one of those God-belittling sins is sufficient to cast you into hell for eternity. This is your record of debt. What a sobering, terrifying thought!\n\nYet it is equally true that if you are among those whom God has \"made alive together with Christ,\" the record is no longer yours. That record of debt that stands against you is cancelled. You are no longer in debt. You will not endure even the smallest measure of the wrath of God against you, because Jesus already endured it all. He paid your debt in full. There is not one sin on your record of debt (past, present, or future!) that has not been paid by Jesus. Rest in that today. Rest in that every day.",
      "prayer": "Father, because you accepted Christ's sacrifice on my behalf, I am forgiven. I ought to have a record of debt that would separate me from your goodness for all eternity. Yet, in Christ I am debtfree. Thank you for accepting his payment of my debt. Thank you that even while I was a helpless and hopeless sinner, Christ died for me. Thank you for not requiring that I clean myself up in order to obtain your forgiveness, because I know I could never make myself clean enough. But you can. Help me, Father, to rest in your forgiveness as I fight this sin.",
      "credit" : "Tim Challies"
    },
    {
      "title": "fleeing temptation",
      "passage": "So flee youthful passions and pursue righteousness, faith, love, and peace, along with those who call on the Lord from a pure heart.\n2 Timothy 2:22",
      "devotion": "We are at war. Our enemies - the world, the flesh, and the devil - are forever opposed to us. A constant battle rages inside us, outside us, and all around us. As men we've been created to be brave and bold, to stand firm and fearless in battle. All throughout the New Testament we are told to stand, to stand strong in this fight. And yet there is one area where we are commanded to flee: \"Flee youthful passions.\" We are to flee lust, to run fast and far from the desire and the opportunity to commit sexual sin. \"Can a man carry fire next to his chest and his clothes not be burned? Or can one walk on hot coals and his feet not be scorched\" (Proverbs 6:27-28)? Of course not. Only a fool would even try.\n\nFlee, my brother. Learn how and when to run and do not be ashamed to do so. Do not toy with sexual sin. Do not make light of sexual sin. Do not laugh or joke about the very sins Christ died for. Do not allow yourself even the smallest taste or the briefest glimpse of what God forbids. There is no shame in running, but you may well know the shame of falling.",
      "prayer": "Father, you tell me to flee sexual sin. You tell me that \"sexual immorality and all impurity or covetousness must not even be named among you, as is proper among saints\" (Ephesians 5:3). Yet too often I have toyed with sexual sin, I have determined to allow myself just a glance or just a taste. And then, somehow, I have acted surprised when that small taste led to a complete fall and outright gluttony. I have no one to blame but myself, because I chose to disregard your Word. Teach me my own weakness and display to me your great strength. When I am tempted, let me flee to you and take refuge in you, in your promises, in your strength.",
      "credit" : "Tim Challies"
    },
    {
      "title": "satisfied in Christ",
      "passage": "Be appalled, O heavens, at this; be shocked, be utterly desolate, declares the Lord, for my people have committed two evils: they have forsaken me, the fountain of living waters, and hewed out cisterns for themselves, broken cisterns that can hold no water.\nJeremiah 2:12-13",
      "devotion": "There is a vast difference between drinking from a fountain of living water and drinking the stale murky waters of a broken cistern. No thirsty man in his right mind would turn down the cold, refreshing water from a flowing stream to drink from a muddy, filthy cistern. A broken cistern will never satisfy his thirst. He might take a small and tentative drink from that broken cistern if this is all that is available. But it is not. The man in Jeremiah 2:12-13 is rejecting living water in order to embrace lifeless cistern water.\n\nThis is the foolish choice that we make whenever we pursue satisfaction in the broken cistern of sexual impurity. If we are to find freedom from sin and live in purity, we must learn anew where we can find true satisfaction and true refreshment. The Lord must transform our foolish hearts so that instead of craving cistern water, we pursue deep and lasting satisfaction in Christ.",
      "prayer": "Father, I thank you that one day, \"I shall behold your face in righteousness\". And I thank you that on that day \"when I awake, I shall be satisfied with your likeness\" (Psalm 17:15). I pray that while I wait for that day that I would grow in my satisfaction of Christ. Change my heart in such a way that I seek to find satisfaction in him. Renew my mind so that I see broken cisterns for what they are. Create in me a heart that pursues satisfaction in Christ.",
      "credit" : "Mike Leake"
    },
    {
      "title": "spiritual friendship",
      "passage": "And let us consider how to stir up one another to love and good works, not neglecting to meet together, as is the habit of some, but encouraging one another, and all the more as you see the Day drawing near.\nHebrews 10:24-25",
      "devotion": "Friendship is a great gift from God. Spiritual friendship, a friendship shared in Christ, is an even greater gift. Proverbs assures us that \"A friend loves at all times, and a brother is born for adversity\" (17:17). A brother is born for the times when we are going toe-to-toe with our sin, battling hard against it, committed to putting it to death. In such times we need friends to pray for us, to support us, to speak truth to us, to speak the gospel to us.\n\nSin thrives in darkness. When we find ourselves up to our neck in sin, our tendency is to run and hide, especially from friends. Our guilt makes us run from accountability and friendship. Don't do that. See the godly friendships that God has given you as the gifts that they are. As you battle against sin and as you battle for sexual purity, invite a friend into your struggles. Invite him to pray with you and for you, invite him to ask you deep and difficult questions, invite him to travel with you on this journey. And when the 31 Days of Purity are over, that friendship will only be getting underway.",
      "prayer": "Father, I pray that I will pursue and value biblical accountability and genuine friendship. This life is too difficult and I am too sinful to do this on my own. So I pray that you would grant me that friend, that he and I would be like Jonathan and David, knit together, unashamed, each looking out for the other's good. And I pray that I will be the kind of friend who loves at all times and the kind of friend who is there for my brother in times of adversity. Amen.",
      "credit" : "Tim Challies"
    },
    {
      "title": "freedom in Christ",
      "passage": "So if the Son sets you free, you will be free indeed.\nJohn 8:36",
      "devotion": "Sin enslaves. It promises joy and life but delivers only deeper and deeper levels of captivity. Freedom from sin and its ugly consequences seems like nothing more than a mirage or an empty promise when, time and time again, you present yourself to sin as its obedient slave. You hear yourself saying things like, \"I just can't help it\" or \"I tried but couldn't do it.\" The enemy will do everything in his power to convince you that you are enslaved to sin. He will do all he can to make you believe you are powerless to conquer it.\n\nThere is just a grain of truth in what our Accuser says: In your own strength you are, indeed, powerless. But if you are in Christ you have been set free from sin's enslavement. You no longer have to live in your own strength - you can now live in the strength of another. The power of sin has been broken in your life. The Son has set you free from your slavery. And now he invites and commands you to live in the joy of that freedom. Be free!",
      "prayer": "Father, thank you for setting me free in Christ. I confess that far too many times I have presented myself as an obedient slave to sin. I have failed to take hold of the freedom Christ has won for me; I have crawled back into my prison cell and back into my chains. Yet I know and believe that sin is no longer my master. Convince my heart that I belong to you and that sin no longer owns me. Help me to live in the freedom that Christ has purchased for me.",
      "credit" : "Tim Challies"
    },
    {
      "title": "the joy of the Lord",
      "passage": "This day is holy to our Lord. Do not sorrow, for the joy of the Lord is your strength.\nNehemiah 8:9",
      "devotion": "Holiness and happiness are inseparable. You can't have one without the other. Holiness produces true happiness, and true happiness strengthens holiness. The proof?\n\nIn Nehemiah 8, God's people had rightly mourned over their sins. But there came a point when their weeping went on too long and too deep, and God said through Nehemiah, \"This is a holy day. Therefore let it be a happy day.\" The logic is inescapable. Happiness is not only compatible with holiness, it is an essential part of it. Without happiness, holiness is incomplete. Indeed, it is no longer holiness.\n\nBut what kind of happiness are we talking about? Nehemiah defines it as \"the joy of the Lord.\" It is a joy that comes from God and is centered in God. God gives it and God is it.\n\nAnd as if we needed another reason to pursue, accept, and enjoy the happiness of holiness, Nehemiah adds the motive: \"For the joy of the Lord is your strength!\" Holy joy, Christ-centered joy, strengthens us. It produces defensive and offensive strength. It powerfully protects us from evil and it empowers us to fight for good. Holiness, happiness, and hardiness. A blessed trinity from the Blessed Trinity!",
      "prayer": "Ever blessed God, You are so holy and so happy. Help me to believe that my greatest happiness is found in holiness, and that happiness, true Christ-centered happiness, is my greatest help to holiness. Increase my joy in Jesus that I may increase my strength to resist sin and fight for purity. Amen.",
      "credit" : "David Murray"
    },
    {
      "title": "trusting God's promises",
      "passage": "No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.\n1 Corinthians 10:13",
      "devotion": "Our God is a promise-making and promise-keeping God. What he says, he will do; what he offers, he will provide. One of his great promises is that he is with us in the midst of our temptations. Even in those times when Satan custom-crafts a temptation suited perfectly to our desires, even there - especially there - God promises that he is with us and that in his strength we can endure. All we need to do is take hold of what he offers.\n\nMy brother, you have only ever sinned because you have chosen to sin. You have only ever sinned because you have chosen to reject the way of escape that God has offered you. God does not promise that you will not be tempted or that you will not be tempted beyond your natural ability to resist. But he does promise that he is with you right there in the temptation and that, if you look to him and take hold of his promises, you will be able to resist. When the temptation comes, take hold of his good promises, take hold of his kind mercy. With his help you are able to endure every temptation without sin.",
      "prayer": "Father, I pray that you would help me to arm myself with your promises. Let me fill my mind and heart with your Word so in that moment of temptation I can be like Jesus and meet every trial, every temptation, with your truth. I know I will be tempted today and every day, so let me believe that you will provide a way of escape for every single temptation I face. I am too weak to rely on myself. Please teach me to rely on you, to trust in your promises. For your promises are true and good.",
      "credit" : "Tim Challies"
    },
    {
      "title": "humility",
      "passage": "God opposes the proud but gives grace to the humble.\n1 Peter 5:5",
      "devotion": "Humility does not come easily or naturally to sinful people like you and me. We think far too highly of ourselves, of our virtues, of our tendencies, of our ability to resist sin. Yet time and again the Bible tells us that God has a special affection for the humble. God turns his back on the proud in order to lavish his grace on those who are humble. In fact, God will actively oppose the proud just as he actively blesses the humble. Few things expose us like our inability to turn away from sin and our lack of desire to do what is right. Therefore few things offer us better opportunity to turn to the Lord in humble dependence.\n\nGod is actively for the humble. God desires to pour out his blessings on the humble. As you seek to put off the sin of sexual impurity, and as you seek to put on the virtue of sexual integrity, you must humble yourself before God. Do this by admitting your tendencies toward sin and do this by freely owning your inability before God. Do this, above all, by looking to Christ who, \"though he was in the form of God, did not count equality with God a thing to be grasped, but emptied himself, by taking the form of a servant, being born in the likeness of men. And being found in human form, he humbled himself by becoming obedient to the point of death, even death on a cross.\"",
      "prayer": "Father, I humbly confess that I cannot win this battle on my own. I am too weak. I am too sinful. I am too drawn to what is evil. So, as much as I am able, I humble myself before you. I ask that you would remind me how much I have to be humble about. I ask that you would remind me of the humble Savior, who took on flesh for me, who obeyed the law for me, who went to the cross for me, who bled and died that I might have life.",
      "credit" : "Tim Challies"
    },
    {
      "title": "passion for the Word",
      "passage": "Blessed is the man who walks not in the counsel of the wicked, nor stands in the way of sinners, nor sits in the seat of scoffers; but his delight is in the law of the Lord, and on his law he meditates day and night.\nPsalm 1:1-2",
      "devotion": "God's Word cuts and cuts deep. This kind of cutting doesn't always feel like a blessing to those who are living in impurity. It hurts. It convicts. It wounds as it penetrates our hearts and exposes our sin. God's Word lays us bare before Yahweh. But it also strengthens and sustains. God's Word is the weapon that He wields (and that we wield) in our fight against impurity. It is through His powerful Word that mountains melt like wax. It was through His powerful Word that your heart came alive. And it will be through His powerful Word that our impure hearts will be transformed into the likeness of His Son.\n\nIf we want a passion for God, it will only come through a passion for God's Word. If we want to be rescued from the land of scoffers and the counsel of the wicked, then we'll want to position ourselves under God's Word. It is here that our delight in God will grow. Therefore, let us pray that the Lord would give us an abiding passion for His Word.",
      "prayer": "Father, we thank you for your Word. Thought it slays me I know that it also restores me. I know that naturally I do not have a passion for your Word. I will not drift into reading and meditating upon your Word. I certainly will not naturally treasure it. But through your Spirit the Word will be a delight to my heart. So, God I pray that you would incline my heart to you. Give me an abiding passion for your Word, a passion unlike any I have known before. Use your Word to conquer my sin and unbelief.",
      "credit" : "Mike Leake"
    },
    {
      "title": "committing to the Church",
      "passage": "And let us consider how to stir up one another to love and good works, not neglecting to meet together, as is the habit of some, but encouraging one another, and all the more as you see the Day drawing near.\nHebrews 10:24-25",
      "devotion": "The New Testament knows nothing of the lone Christian - the man who claims to be a believer but who deliberately or carelessly allows himself to drift from the local church. Just as the wolf will prowl outside the flock of sheep, looking for the one that strays from the shepherd, Satan prowls the church, looking for the people who stray from Christian fellowship. Every Christian is dependent upon the local church and we neglect it to our peril, for it is in the church that we powerfully experience the means of grace God gives us - the Word, prayer and the sacraments (or ordinances). We cannot thrive or even survive without them. Neither should we expect to.\n\nIt is also within the church that we uniquely experience the joy of imitating Christ in putting aside our own desires in order to love and serve others. And so, my brother, don't simply go to church: Be an active, serving, participating member of that church. Do not expect that you will be able to put sin to death or to pursue holiness without the local church.",
      "prayer": "Father, I am grateful for the gift of the local church. I am grateful that through the church I am able to experience those wondrously ordinary means of grace. I am grateful that you led me to my church, and I pray that you would help me to commit to it more and more, that I would love the people you bring there, that I would have deep and meaningful friendships there, that I would faithfully serve your people by stirring them up to love and good works.",
      "credit" : "Tim Challies"
    },
    {
      "title": "stewarding God's gift",
      "passage": "Or do you not know that your body is a temple of the Holy Spirit within you, whom you have from God? You are not your own, for you were bought with a price. So glorify God in your body.\n1 Corinthians 6:19-20",
      "devotion": "In the heat of the battle for purity, sexuality can feel like a burden and a curse. We might even find ourselves wishing that God had made us asexual beings, or that he would just take away all those feelings and all those desires. Yet we know that God is a loving Father who looks upon his people with kindness. Far be it from this Father to give us something that is bad for us!\n\nIn his first letter to the church in Corinth, Paul addresses some of the sexual immorality among those people. He rebukes the church for this immorality, and gives them this command: Glorify God in your body. This is a command he gives to the married and to the unmarried. Our sexuality has been entrusted to us as a gift from God. We serve as faithful stewards when we use it only in the ways God intends. For those who are married, that will mean regularly and joyfully enjoying sex with your wife; for those who are unmarried it will mean regularly and joyfully denying yourself those physical desires. In either case, it is God who owns our bodies, not us; it is God who owns our sexuality, not us. My brother, be a faithful steward of what God has entrusted to you.",
      "prayer": "Father, you tell me that I can and must glorify you in my body. I believe that you have given sexuality to me as a gift. I may not always understand why you have done this because it does not always feel like a gift. But I do understand that you are good and kind and that you love me. I pray that I would be a faithful steward of this gift, that in that final day you would look at how I have stewarded this gift and say to me, \"Well done, good and faithful servant.\"",
      "credit" : "Tim Challies"
    },
    {
      "title": "God's view of women",
      "passage": "Do not rebuke an older man but encourage him as you would a father,younger men as brothers, older women as mothers, younger women as sisters, in all purity.\n1 Timothy 5:1-2",
      "devotion": "As men, we are trained from a young age to objectify women, to see them not as people created in God's image, but as objects who exist for our pleasure. As we battle for purity, we trust that God begins to transform our minds, our hearts, and our view of women. It is a wonderful relief when the Lord extends his grace and we begin to see growing evidence that we are putting to death this sin of sexual immorality. Every victory is a victory we ought to celebrate. Yet one victory is not the end point in our quest for personal holiness. The Lord does not call and empower us to merely put off sin, but he also calls and empowers us to put on righteousness.\n\nIt is one thing, a very good thing, to stop looking at pornography. It is another thing, a much greater thing, to have the Lord transform and restore our view of women. Apart from his grace we will continue to view women as objects - only this time, they will be objects to be avoided instead of objects to be consumed. The Lord's aim is much higher. He tells us to view younger women as our sisters in Christ, and older women as our mothers in the Lord. Let us pray that the Lord would transform our view of women, and see them with His eyes.",
      "prayer": "Father, I thank you for the gift of women. They are fearfully and wonderfully made to uniquely reflect your glory. It grieves me that our culture views your daughters as nothing more than sexual objects. It further grieves me that I have been guilty of joining in this. Lord, captivate my heart and transform my mind in such a way that I view the opposite sex correctly. Let me treat younger women as sisters with all purity, and let me treat older women as mothers with all dignity. Stir up in my heart a deep and holy love for my sisters in Christ. Amen.",
      "credit" : "Mike Leake"
    },
    {
      "title": "rejoice in the wife of your youth",
      "passage": "But because of the temptation to sexual immorality, each man should have his own wife and each woman her own husband.\n1 Corinthians 7:2",
      "devotion": "We hear it all the time, practice \"protected sex\"! But for the Christian man, protected sex means something much more significant and wonderful than birth control. Enjoying your wife sexually (and inviting her to enjoy you!) is a God-installed sentry for guarding your heart in the fight for purity. Think of it as one of your first lines of defense. God says, \"because of the temptation to sexual immorality,\" I'm giving you protection - it's called your spouse. Rather than squandering your sexual desire in pornography and lust, fulfill it by having wonderful, God-honoring sex with your wife. Love her sacrificially and enjoy her often!\n\nAnd to the unmarried man – \"God's divine power has granted to us all things that pertain to life and godliness\" (2 Peter 1:3), including the power to overcome \"the temptation to sexual immorality.\" You have not been left without ammunition in the fight! God's divine power includes the grace to wait patiently for her arrival. Isn't it just like God to create something we savor and then use it as a shield!",
      "prayer": "Lord, your ways are magnificent! You gave us marriage to display your character and your care.\n\n[For the married man: You gave me a bride so she could be well-loved. You gave me a wife because you care about my weakness. Help me, O God, to cherish this gift and enjoy it often, even today! Not simply because sex protects me, but because the purity of your people glorifies you.]\n\n[For the unmarried man: I may not understand why you have given me a sexual appetite without giving me a wife, but I do trust that your power has granted to me all I need for life and godliness. I trust that this includes the powerful to overcome the temptation to sexual immorality. So until the day I can enjoy sex with the wife you provide, I ask that I could be pure.]\n\nAmen!",
      "credit" : "Dave Harvey"
    },
    {
      "title": "radical action",
      "passage": "You have heard that it was said, 'You shall not commit adultery.' But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart. If your right eye causes you to sin, tear it out and throw it away. For it is better that you lose one of your members than that your whole body be thrown into hell. And if your right hand causes you to sin, cut it off and throw it away. For it is better that you lose one of your members than that your whole body go into hell.\nMatthew 5:27-30",
      "devotion": "In the context of sexual purity, Jesus lays down the challenge of radical action. \"If your right eye causes you to sin, tear it out and throw it away.\" We understand that Jesus may not be speaking literally, but this does not indicate that he is suggesting something ridiculous. When we accuse him of exaggeration, we minimize the force of his words, and perhaps give ourselves an out. But Jesus is asking a serious question in this text: Do you love your sexual sin enough to go to hell for it?\n\nIf you are committed to battling sin, you need to be committed to getting rid of those things that lead you to sin. Don't toy with sin when you should be running fast and far from it. If your iPhone causes you to sin, cut it off; if your computer causes you to sin, gouge it out. As an integral part of your commitment to sexual purity, as a means of gaining victory, take radical action against your sin. What is God telling you to cut off or gouge out?",
      "prayer": "Father, I pray that I would have the courage and integrity to take radical action. Don't let me toy with sin. Don't let me continue to taste of sin and act surprised when I soon feast on it. Keep me from ever thinking lightly of the very sins that required the suffering and death of Jesus Christ. Show me where my patterns of sin are so deeply ingrained that I will need to cut something off or gouge something out for my good and your glory.",
      "credit" : "Tim Challies"
    },
    {
      "title": "meaningful work",
      "passage": "It happened, late one afternoon, when David arose from his couch and was walking on the roof of the king's house, that he saw from the roof a woman bathing; and the woman was very beautiful.\n1 Samuel 11:2",
      "devotion": "A king walking on the roof and gazing over his kingdom is not an unusual scenario. It is not even unusual that he might catch a glimpse of something that he should not be seeing. But what is unusual in this story is given to us in verse 1. David is leisurely strolling across his roof and gazing across his kingdom during \"the time when kings go out to battle\". It is the season for battle but David is having his own season of leisure. As the text says, \"David remained at Jerusalem\".\n\nYou can likely relate to David's story. Some of our greatest sins take place in times of boredom and inactivity. What Spurgeon once said is demonstrably true, \"Idle people tempt the devil to tempt them.\" One of the antidotes to a life given to impurity is the grace of meaningful work. It is difficult to be consumed with sexual impurity when you are consumed with gospel work. Let us pray that the Lord would help us \"approve what is vital\" and give our energies to that which is eternal.",
      "prayer": "Father, thank you for your gift of work. Thank you for involving us in your purpose to fill the world with passionate worshippers. I confess that far too often my mind and heart are focused on much smaller things. At times my heart is driven towards comfort and ease. When my brothers and sisters are \"doing battle\" I'm \"remaining at Jerusalem\". Stir up in my heart a passion to pursue the vital things in life. Keep me from flitting away my time on fleeting pleasure and to pursue your eternal kingdom. Amen.",
      "credit" : "Mike Leake"
    },
    {
      "title": "the Throne of Grace",
      "passage": "For we do not have a high priest who is unable to sympathize with our weaknesses, but one who in every respect has been tempted as we are, yet without sin. Let us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.\nHebrews 4:15-16",
      "devotion": "This passage tells us to come to Christ in our weakness and in our sin. Yet we often prefer a route that is opposed to Hebrews 4:16. I cannot describe it any better than Heath Lambert has:\n\n\"Mental punishments are not helpful because they deal with sin in a self-centered way instead of a Christ-centered way. Meditating on how miserable and pathetic you are only perpetuates the sinful self-centeredness that led you to look at pornography in the first place. Condemning self-talk still has you standing center stage as you reflect on what you think you deserve because of what you did. ... The only way to break this vicious cycle is to get outside of yourself to Jesus. You need to stop talking to yourself in categories of condemnation and begin talking to God in categories of confession.\" (Lambert, Finally Free, 26)\n\nJesus doesn't need your condemning self-talk. Neither do you, for it accomplishes nothing good. What you need is to believe the gospel and boldly draw near to the throne of grace. It is here - in our Great High Priest - that you will find the healing that you long for. It is here that you will find the mercy and grace that you so desperately need.",
      "prayer": "Lord, you were tempted just as I have been tempted. I am thankful that where I have failed, you have succeeded. You know how strong temptation can be. You know what it is like to be in a mortal body. You can sympathize with my weakness. I am grateful that you know my frame and remember that I am but dust (Psalm 103). Rescue me from foolish self-talk and replace it with your words of grace. You say that when I confess, I am clean. Help me to believe you. Today I draw near to your throne of grace confident that you will meet me with mercy and grace to help in this time of need.",
      "credit" : "Mike Leake"
    },
    {
      "title": "the harlot's house",
      "passage": "And now, O sons, listen to me, and do not depart from the words of my mouth. Keep your way far from her, and do not go near the door of her house, lest you give your honor to others and your years to the merciless, lest strangers take their fill of your strength, and your labors go to the house of a foreigner, and at the end of your life you groan, when your flesh and body are consumed, and you say, \"How I hated discipline, and my heart despised reproof! I did not listen to the voice of my teachers or incline my ear to my instructors. I am at the brink of utter ruin in the assembled congregation.\"\nProverbs 5:7-14",
      "devotion": "These words were written thousands of years before anyone had even dreamed of a computer. They were written millennia before cameras and screens and iPads and so many of the media that transport today's sexual temptations. And yet they are as applicable to us as they were to Solomon, all those years ago. Here the wise father writes to his son and warns him to stay far away from the house of the harlot, from that place of sexual temptation and sexual sin. He knows that if his son walks along the edge of the cliff, he will inevitably fall into the chasm.\n\nA few days ago we prayed that God would give us a willingness to gouge out and cut off whatever it is that causes us to sin. Have you done that? Now Solomon warns us that we need to stay far, far from any area of temptation. We cannot tiptoe along the cliff's edge and expect to remain steady on our feet. What path do you walk that leads you to sexual sin? What pattern do you follow before you fall into sexual sin? Is it mindlessly browsing Facebook? Is it staying up too late? Is it driving past the house of the prostitute? Read Solomon's warning, pray for God's wisdom, and beware your steps.",
      "prayer": "Father, I ask that you would show me the patterns I follow that lead me to sexual sin. I don't want to go near the door of the prostitute. I don't want to go near the porn site. I don't want to go to any place where my eyes and mind are prone to wander into impurity. I don't want to walk along the cliff and expect that this time I won't fall in. Thank you for your kind warning, given through Solomon. Now give me your wisdom, give me your strength, give me your protection. Let me do, and let me long to do, only what is right.",
      "credit" : "Tim Challies"
    },
    {
      "title": "restoration",
      "passage": "I will restore to you the years that the swarming locust has eaten, the hopper, the destroyer, and the cutter, my great army, which I sent among you.\nJoel 2:25",
      "devotion": "A locust invasion brings devastation to the land. Here Joel gives us a picture of a land that was \"the garden of Eden before them but behind them a desolate wilderness, and nothing escapes them.\" (Joel 2:2) These locusts have brought total destruction, and the consequences of sexual impurity can be much the same. Sin has no intention of stopping its devastation. Just as with a mighty swarm of locusts, nothing escapes its destruction. Unless the Lord rescues us, our sin will be more devastating than a locust plague.\n\nThankfully, Jesus Christ has come to conquer the works of the devil. He has come to restore that which has been destroyed by sin. There might be consequences to your sin that cannot be fully restored this side of eternity. But we can rest assured that Christ is, indeed, making all things new. He promises that he will restore completely. Therefore, let us thank him for his restoration and plead with him to restore in us the things that have been wrecked by impurity.",
      "prayer": "Father, I know that my sin has taken a toll on my life. Its effects touch every area of my being. There are things in my heart and mind that I wish could be forever blotted out. And there are areas in my life that have been decimated by my sin. You alone have the power to rebuild what I have destroyed. I know that ultimately you will restore everything and make all things new. I believe this and thank you for it. I pray today that your future redemption would touch the present. Restore what has been wrecked by my impurity for your name's sake.",
      "credit" : "Mike Leake"
    },
    {
      "title": "trusting God with the past",
      "passage": "Brothers, I do not consider that I have made it my own. But one thing I do: forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal for the prize of the upward call of God in Christ Jesus.\nPhilippians 3:13-14",
      "devotion": "In 1954 Roger Bannister and John Landy squared off in a monumental race. Both men had recently accomplished the unthinkable by running a mile in under 4 minutes. Landy led for most of the race, even building a lead of 10 yards at one point. But on the last leg of the race he made the mistake that runners should never make - he looked back. Bannister raced past him and never again gave up the lead.\n\nIn our battle for purity that which is behind us (our past) can steal our gaze. We can fall into the trap of thinking too much of our past successes or we can run slower because of the weight of our past failures. Here Paul is not calling us to simply forget our past as if it doesn't exist. Instead, he is calling us to trust the Lord with our past (both success and failure) and keep our eyes fixed on Jesus Christ.\n\nIf you've fallen trust the provision of a gracious Savior. If you've won a battle trust that it was the provision of a transforming Lord. Then keep running.",
      "prayer": "Father, I thank you that you are not only the Lord of my present and future but also my past. You know every time that I have failed and you know every time that I will fail. You know ever victory of grace that will happen in my life. And all of these you knew before the foundation of the world. Help me to trust you with my past. Whether it is the wounds left by others, my own failures, or even the times when I have triumphed in obedience, I entrust them to you.",
      "credit" : "Mike Leake"
    },
    {
      "title": "healing our wounds",
      "passage": "He heals the brokenhearted and binds up their wounds.\nPsalm 147:3",
      "devotion": "Brothers, we are wounded. We are all wounded. I know this because you and I live in a fallen, broken world. Some of our wounds are self-inflicted. Some wounds are a result of the sin of other people. Some wounds are just a result of living in and blundering through a fallen world. Regardless of their source, we can have confidence that God heals the brokenhearted and binds up their wounds.\n\nIf you are in Christ, your identity is not that of a victim. No matter how deep the wounds or how far-reaching the scars, your defining identity is not that of a wounded man. You have been washed. You have been cleaned. You have been healed. Yes, you might still carry around scars, but scars are no longer seeping wounds, instead they are testimonies of healing and grace. Whatever wounds or scars you bear, pray today that the Lord would give you ultimate healing. No wound is too deep for Christ to heal with His goodness and mercy.",
      "prayer": "Father, I am grateful that you heal the brokenhearted and bind up our wounds. I'm a wounded man. Some of these wounds are from my own sinful and foolish choices. Other wounds are caused by the hand of another. Lord, I want these to be healed. I know that praying for healing might mean that you will have to reopen wounds to give redemption in these areas. Heal the places in my heart that are broken. Bind up my wounds. Overwhelm me with your grace and mercy. Where there were once ashes, replace them with your beauty. Amen.",
      "credit" : "Mike Leake"
    },
    {
      "title": "forgive others",
      "passage": "Be kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you.\nEphesians 4:32",
      "devotion": "You may be asking, \"What in the world does forgiving others have to do with 31 days of purity\"? It has everything to do with personal purity. Even when you are neck-deep in sin, or even better, deeply engaged in the battle against sin, the bitter roots of unforgiveness can be spreading throughout your heart. God's Word tells us that the one who is forgiven much must also be so willing and eager to forgive others. It is entirely possible that as you've indulged in sexual impurity you have been carrying around a secret bitterness toward the objects of your disordered affections. Or perhaps you've been sinned against sexually in the past and the bitterness has grown.\n\nAs you have sought forgiveness from God for your sexual sin, have you considered your need to forgive others? Have you forgiven your dad for exposing you to that pornographic magazine when you were only a little boy? What about the bitterness you may feel toward the people who produced the pornography in the first place, or the people who have marketed it so effectively so they've tripped you up again and again? While you can and should see them as enemies to the gospel and enemies to personal holiness, Jesus told us to pray for our enemies and to forgive all those who have asked for it. Are you willing to forgive? Are you willing to let go of the bitterness? Will you, who have been forgiven so great a debt, still hold another person's sin against him?",
      "prayer": "Father, you have forgiven me of a debt that I could not pay. I have sinned against you more than others have sinned against me, and yet I harbor feelings of bitterness and unforgiveness. Reveal to my heart the places where I have not forgiven others and give me the grace to forgive them if and when they ask. I pray that you would bless those that have done me harm. Restore my bitter heart with a heart of deep forgiveness and appreciation for your grace. Amen.",
      "credit" : "Mike Leake"
    },
    {
      "title": "the joy of salvation",
      "passage": "Restore to me the joy of your salvation, and uphold me with a willing spirit.\nPsalm 51:12",
      "devotion": "\"The psalm of all psalms\" is how one writer described this song that David composed in those broken moments when the prophet's accusation still echoed in his throne room: \"You are the man\" (2 Samuel 12:7). You are the man who received the crown of Israel but then stole the wife of your most loyal servant (12:8). You are the anointed protector of the sheep who has now slaughtered one of his own (12:9). You are the man whose sin will claim the life of your son (12:14) - not only the infant now nestled at Bathsheba's breast but also a more distant Son who will die spiked on a blood-soaked beam. Because - and only because - of this more distant Son, \"The LORD also has put away your sin\" (12:13).\n\nThe heart of this \"psalm of all psalms\" is David's plea for restoration (Psalm 51:7-12), and the climax of this plea is his yearning cry for \"the joy of your salvation\" (51:12). David hadn't forfeited God's gift of salvation, but he had lost the joy of what God in his grace had provided.\n\nWhen, though, did David lose this joy of his salvation, and why? Was it after his sin? Or could it have been at some point before? I would suggest that David's loss of joy was not the result of his sin but part of the cause. David's sinful actions were the fruit of his failure to recall that the lasting joy of God's salvation far outstripped the passing pleasure of Bathsheba's flesh. David had already lost sight of the joy of God's salvation before he saw the young woman bathing on the roof and chose to call her into his chambers. It was, at least in part, due to David's misplaced joy that he sacrificed his integrity for a false and fleeting joy that could never satisfy his soul. Now, the penitent king begged God to restore his lost joy.\n\nPurity flows from a heart that recognizes the joy of God's salvation as a gift more satisfying than any competing pleasure the world can provide. This joy is accompanied by inward transformation (\"a willing spirit,\" 51:12) and results in outward proclamation (51:13).",
      "prayer": "My Father and my God, the day has barely begun and already I hear the serpent's soft-pedaled whisper telling me that there are pleasures greater than anything you can offer. Give me a willing spirit - a spirit willing to trust that there is no pleasure greater than the joy you have granted in Christ, that there is no pleasure so great that it is worth trading for your holiness and that there is no gift I need that you through your Spirit will not provide In the name of Jesus Christ, my Brother and my Lord, Amen.",
      "credit" : "Timothy Paul Jones"
    },
    {
      "title": "victories of grace",
      "passage": "Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\n2 Corinthians 5:17",
      "devotion": "God tells us that victory over sin is certain - even those sins we have held to for so long. This can be hard to believe when we look to the past and see only failure after failure. It can be hard to believe when sin's power is so strong and when giving in to sin promises such satisfaction. Yet we must believe that in Christ we are new creations - the old has gone and the new has come. In Christ we are becoming who we are, increasingly taking hold of who we are in Him. Where we once delighted to do evil, we can have confidence that one day we will delight to avoid evil. Where we once hated to do what is right, we can have confidence that one day we will delight to do what is right.\n\nWe really can hope and believe for such radical change. However, there may be a long period of time and many struggles between the two extremes. It rarely happens overnight. In that period where you are battling hard against sin, where you are developing new patterns of doing what is right instead of doing what God forbids, be sure to celebrate the small victories. Each of those victories is an evidence of God's grace in your life. When you choose to do the right thing instead of the sinful thing, give thanks to God. When you have gone longer than you've ever gone before without succumbing to the temptation, celebrate with a friend and thank the Lord. Celebrate his grace by praising his name.",
      "prayer": "Father, I am thankful that in Christ I am a new creation. I believe what you say: the old has passed away and the new has come. Let me be who I am in Christ. Let me take hold of all Christ offers. I thank you for giving me grace - grace to see my sin, grace to hate my sin and grace to overcome my sin. All of this is an evidence of your work in my life, and I thank you for it. Help me to celebrate day-by-day what you are doing in and through me.",
      "credit" : "Tim Challies"
    },
    {
      "title": "a renewed mind",
      "passage": "Do not be conformed to this world, but be transformed by the renewal of your mind, that by testing you may discern what is the will of God, what is good and acceptable and perfect.\nRomans 12:2",
      "devotion": "Our bodies follow our minds. This is the consistent witness of Scripture, which always places mind before body. Throughout his life, the Christian is to be renewing his mind by the Word of God, to take it into captivity and bring it into conformity. As he does this, his words and his deeds, and even his thoughts, will necessarily follow.\n\nIf there is any area where we let our bodies dictate our thoughts and our actions, it is here in the context of sexual purity, in those times when the body seems to cry out in dissatisfaction. When we wallow in sexual sin, we fill our minds with what is impure, as if Philippians 4 commands us to think about whatever is false, whatever is deplorable, whatever is unfair, whatever is impure, whatever is ugly, whatever is critical, if there is any depravity, if there is anything worthy of rebuke, we think about these things. And, not surprisingly, our bodies follow our minds.\n\nIt is so much better to heed and to practice Philippians 4 which commands us to think about what is good and noble and pure. \"Finally, brothers, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is lovely, whatever is commendable, if there is any excellence, if there is anything worthy of praise, think about these things\" (Philippians 4:8). Think about those things, brother, and let God transform your thoughts and your actions.",
      "prayer": "Father, I pray that you would do your work of mind-renewal within me. I know that my behavior follows my thoughts, so I pray that you would help me to think about those things that are true and beautiful. Whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is lovely, whatever is commendable, if there is any excellence, if there is anything worthy of praise, I pray that you would help me to think about these things and to love thinking about these things.",
      "credit" : "Tim Challies"
    },
    {
      "title": "an eternal perspective",
      "passage": "So we fix our eyes not on what is seen, but on what is unseen. For what is seen is temporary, but what is unseen is eternal.\n2 Corinthians 4:18",
      "devotion": "Sometimes we get so caught up in the moment that we lose all sense of perspective. We become like the man who stands before the sweeping mountain vista, but will only gaze at the ground beneath his feet. What he sees is real, but it is so small and so limited. We need to lift our eyes to catch the bigger perspective - the eternal perspective. Like Paul, we need to fix our eyes on what is unseen and eternal.\n\nThis life matters. But this life is short. When we put our lifespans in the context of eternity, they are but the shortest blip, the shortest dash between the two dates on a gravestone. While another evening of battling sexual sin can seem like the longest and most difficult night of our lives, it is but the shortest tick of the clock in the context of eternity. \"So we do not lose heart. Though our outer self is wasting away, our inner self is being renewed day by day. For this light momentary affliction is preparing for us an eternal weight of glory beyond all comparison...\" (2 Corinthians 4:16-17). Even this temptation, this affliction, is so light when we compare it to the joy that awaits us.",
      "prayer": "Father, help me to keep my eyes fixed on what is unseen and eternal. Help me to view my life, and my moments of temptation, in the context of eternity. While these temptations can feel so weighty and so difficult, I want to know and believe that they are but light and momentary afflictions compared to the eternal weight of glory beyond all comparison you have prepared for me. I long for the day when I will be with you forever. Prepare me for that day by giving me your grace to battle sexual sin today and every day.",
      "credit" : "Tim Challies"
    },
    {
      "title": "persevering",
      "passage": "Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.\nJude 1:24-25",
      "devotion": "This closes our 31 days together, but it does not close our lifelong pursuit of sexual purity. In fact, we have only just begun. Today we are praying for ourselves and for one another that we would continue to persevere in purity. Keep going, men. The battle is not over. Tomorrow morning you will need to start over in your pursuit of purity. And as you do, remember that the Lord Jesus - and only the Lord Jesus - is able to keep you from stumbling.\n\nOne day we will be presented blameless before the Lord and there will be great joy. Though that day is not yet called \"today,\" it is absolutely certain. Therefore, let us press on all the more as we look forward to that day. Why don't you grab a friend and go through this challenge again?",
      "prayer": "Lord, thank you for all those that have prayed and battled for purity these 31 days. I pray that they would continue on in the battle. Help me to continue praying with them and pursuing purity together. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our hearts and our homes for His name. I am thankful that you are able to keep me from stumbling. Help me press on in purity, all the while looking forward to the day when I will be presented spotless in Your presence. Amen.",
      "credit" : "Mike Leake"
    }
  ]
}
