{
  "credits" : {
    "Mike Leake": "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light.",
    "Davy Marcelo": "Davy Marcelo makes his living working in Corporate America but finds his passion in serving as an associate pastor to his father. He is married to his beautiful wife Lizette, and together they have an energetic toddler son named Johann Seth.",
    "Dave Fields": "Dave Fields and his family serve as missionaries on the north coast of Honduras at hospital Loma de Luz. Dave is the IT director of the hospital.",
    "Brian McMillen": "Brian McMillen is a Jesus lover, husband, and father to four amazingly cute kids. When he's not busy entertaining those around him with his witty humor, he enjoys playing guitar, fishing, and cheering for the Royals.",
    "Nick Horton": "Nick Horton and his wife Amy, along with their 3.5 year old Gabriel, live in VA, where Nick teaches middle and HS youth at FBC Woodstock, VA. He is also a deacon, loves to fish, works in IT, is an online student at Boyce College pursuing a call to ministry.",
    "Joan Hartley": "Joan Hartley is a member of Grace Presbyterian Church, OPC in northern Ohio - wife, mother of four, and \"Mimi\" to two grandsons. She is a special educator and is in the process of training two therapy dogs, Justice and Mercy, for ministry in the (hopefully near) future.",
    "Mark Mincy": "Mark Mincy is husband to the beautiful Tricia, and father to Justin, Jake, Jenna, and Jarynne. Privileged to shepherd the congregation of Waterville Baptist Church.",
    "Marc Mullins": "Marc Mullins is married to Amber, his wife of almost 10 years. They have 2 children, Ashton and Lacey. He serves as a bi- vocational Student Pastor in Mount Washington and works in product development and blogs Christ-Centered Reflections on Business, Calling, Vocation, Ethics and Life at WorkandKeep.com.",
    "Adam Atherton": "Adam Atherton has been married to Deborah for 22 years. Their marriage has been blessed with two children, Stephen and Emily. Adam is a sinner saved by grace daily dependent upon the LORD.",
    "Sherry Heeke": "Sherry Heeke is a homemaker, wife to David, and mother of 3 amazing sons, Logan (13), Dylan (9), and Dawson (6). All three boys are on the autism spectrum, so she never has a dull moment. Sherry is a member of First Baptist Church in Jasper, where she sings and plays bass guitar in the praise band.",
    "Jon Perera": "Jon Perera is married to his wife Anne of 16 years. They have 3 children Andrew,Audrey, Austin. The couple has lived in McKinney TX since 2004 where they attend Crosspoint Church. Jon is blessed to teach an Adult Bible Fellowship class and teach 1st graders on Wednesday nights.",
    "Audrey Reynolds": "Audrey Reynolds enjoys being a wife, Christian schoolteacher, and mother of 1 son and 2 daughters. She is continually amazed at the grace of God."
  },

  "prayers" : [
    {
      "title" : "he would have an abiding satisfaction in God",
      "passage" : "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalm 16:11",
      "devotion" : "The greatest thing that we can pray for our sons is that they will be eternally satisfied in God. At His right hand is where pleasure is to be found, and in His presence alone fullness of joy is to be found; for our sons to drink from any other fountain will only multiply his sorrows (Psalm 16:4). Therefore, we must pray that our sons find their deepest satisfaction in God",
      "prayer" : "Father, I pray that you would cause my son to find his deepest satisfaction in You. Rescue him from looking to other things to find satisfaction and pleasures. Help me to lead him in my enjoyment of You. At your right hand is where joy is found. Help us to truly believe this and live accordingly. In Jesus name, Amen."
    },

    {
      "title" : "he would be saved",
      "passage" : "The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance.\nII Peter 3:9",
      "devotion" : "Christian parents want nothing more than for their son to be saved. Some parents do not know the how or the when because their child is still a youngster. Such parents still pray for their son's salvation daily, waiting upon the Lord to do His saving work. Other parents are in a different boat: their son is already \"of age\" and is still unsaved. Let us be reminded of the character of our loving and merciful God: He is \"patient\" and \"not wishing that any should perish\" but desiring \"that all should reach repentance\". If your son is still \"wandering from the fold of God,\" don't despair - Today and every day, pray faithfully and earnestly for your son's salvation!",
      "prayer" : "Lord, thank You for the joy my son brings to me! I pray that You would bring him to saving faith in Jesus Christ. Nothing else in this world matters if his name is not written in the Lamb's Book of Life! May Your Holy Spirit do His convicting work, so that my son would receive this gift of salvation, according to Your good pleasure. I pray with confidence in Your unfailing love for my son. Amen.",
      "credit": "Davy Marcelo"
    },

    {
      "title" : "he would hear and heed the Lord in the voice of his parents",
      "passage" : "Hear, my son, your father's instruction, and forsake not your mother's teaching, for they are a graceful garland for your head and pendants for your neck.\nProverbs 1:8-9",
      "devotion" : "In our media-saturated world, our children will hear many messages from many different voices. Some of these voices echo the voice of the Lord - others are serpentine. Often the hardest voice to listen to is the one of their father and mother. The world says that father and mother are old-fashioned and ill-informed about today's pressing issues. We need to pray that our children have parents that echo the voice of the Lord, and that our children would heed our gospel-informed voice.",
      "prayer" : "Father, we pray today that our son will hear our voices as parents more clearly and more certainly than those in the world. We further pray that we will use messages that are full of Your wisdom and Your grace and that they will fall on ears that are eager to listen. We pray that they will indeed be adornments upon the neck and head of our son and that there will be a renewed spirit of communication between him and us. We pray that we will only speak that which is from you and that he will listen with an open heart. We pray for our son today, Lord to hear you through us as his parents. Amen.",
      "credit" : "Dave Fields"
    },

    {
      "title" : "he would be kept in peace",
      "passage" : "You keep him in perfect peace whose mind is stayed on you, because he trusts in you. Trust in the Lord forever, for the Lord God is an everlasting rock.\nIsaiah 26:3",
      "devotion" : "Peace is perhaps the most elusive thing in the world. Everybody wants it and yet few claim to have it. We search and search, but anxiety seems to rule the day. In the Scriptures, anxiety is set as an antonym to peace. The word for anxiety literally means \"to be pulled in many different directions\". Being pulled in many different directions is how many of us would define life. In such a world the only way to know peace is to seek the face of our peace-giving God through prayer and thanksgiving. Therefore, let us pray that God will give His peace to our sons.",
      "prayer" : "Dear Father, I praise you that You are the Author of peace. I praise You that Jesus brought true peace to this fallen world through the shedding of His blood. In His name, I ask You to give true and lasting peace to our son. Protect him from things - even good things - that call him away from You. Give him faith that he might trust You and not his own strength or ability. Give him a desire to cast himself completely upon Your mercy and know the joy of Your peace flooding his soul. Keep him in Your perfect peace - or Your glory and his good. Amen.",
      "credit": "Mark Mincy"
    },

    {
      "title" : "he would keep himself pure",
      "passage" : "I made a covenant with my eyes not to look lustfully at a young woman.\nJob 31:1 (NIV)",
      "devotion" : "Job here is talking about his personal covenant for purity. As the writer of Ecclesiastes said so long ago, \"there is nothing new under the sun.\" Men have battled lust since the fall. Job was concerned with the discipline needed to maintain a righteous and holy life before God. He knew that lust was sin and therefore harmful to his life. As a result he covenanted with \"his eyes\" not to look on young women with lust. Today, we are bombarded with images of flagrant sexuality. Our sons cannot watch TV, play video games, walk in the mall, or even down the city streets without being tempted by images of women, or women themselves, dressed provocatively. Our culture is at war with holiness.",
      "prayer" : "Lord, may our son covenant with you to be pure. The world is full of fleshly desires and temptations to sin. The sin of lust is celebrated and pervasive. Father, keep our son close to your heart that he would desire the discipline of holiness above sin. Keep him faithful to his wife, whether presently married or to his future wife. May he be a man of integrity; one that treats women like sisters. May he look on women as fellow image bearers of God and not as objects to be exploited. May he learn that manliness is not promiscuity, but protecting and providing with honor and integrity. Please Lord mold our son to be pure for your glory above all. In Christ's name, Amen.",
      "credit" : "Nick Horton"
    },

    {
      "title" : "he would show himself a man",
      "passage" : "When David's time to die drew near, he commanded Solomon his son, saying, \"I am about to go the way of all the earth. Be strong, and show yourself a man, and keep the charge of the LORD your God, walking in his ways and keeping his statutes, his commandments, his rules, and his testimonies, as it is written in the Law of Moses, that you may prosper in all that you do and wherever you turn, that the LORD may establish his word that he spoke concerning me, saying, 'If your sons pay close attention to their way, to walk before me in faithfulness with all their heart and with all their soul, you shall not lack a man on the throne of Israel.'\"\n1 Kings 2:1-4",
      "devotion" : "Prevailing wisdom of the world caricatures true manhood as brute strength, callous leadership and arrogant self-reliance. In contrast, a mark of Godly manhood is that he leads others with a head and heart that is saturated with the Word of God. It is far easier, in the face of opposition and temptation, to appease man than to remain steadfast on the firm foundation of God's word. Standing firm is only possible by the power of The Holy Spirit which transforms men of flesh to men of God.",
      "prayer" : "Lord, You have graciously given us your word and statues through men of God who have shown themselves to be men. Most of all, thank you for becoming the only true man. You alone have faithfully kept the charge given to You, walked in Your Father's ways, and fulfilled His law. As a result you remain on Your throne forever. May you continue to mold me into the image of Jesus, the true man, so that I lead my son in delightful obedience and impress upon him the strength that comes in relying on the Lord alone. Give him a heart to boldly stand on the rock through adolescence and adulthood. I pray if you call him to father a son that he might pass the torch of truth to his son so that your glory will extend from generation to generation. Amen.",
      "credit" : "Marc Mullins"
    },

    {
      "title" : "he would lay aside entangling sin",
      "passage" : "Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race set before us, looking to Jesus, the founder and perfecter of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God.\nHebrews 12:1-2",
      "devotion" : "Each of our sons will likely have certain sins that they are prone to. There are some things that might be a great snare for my child that is less of a temptation for yours. Regardless of the sin, we are called to cast aside that weight and run with endurance. This text helps us to see that the war against sin is a battle that is marked by suffering. Our only hope is to fix our eyes upon Jesus and learn from his joy. Today let us pray that our sons would fix their eyes on Jesus, find joy in Him, and cast aside those entangling sins.",
      "prayer" : "Father, I know that my son will have a cross to bear. I know that he, like me, is a sinner that has certain things he is prone to do. I also know that Jesus Christ is greater. Lord, I plead with you to give my son the grace to look to you. Fix his eyes upon You. May he find his joy in You, and through this joy help him to cast aside the weight of sin. Rescue him from the sin that so dearly wants to choke the life out of him. Help him to endure for Your glory and his good. Amen."
    },

    {
      "title" : "he would hold fast to the Word preached to him",
      "passage" : "Now I would remind you, brothers, of the gospel I preached to you, which you received, in which you stand, and by which you are being saved, if you hold fast to the word I preached to you -  unless you believed in vain.\n1 Corinthians 15:1-2",
      "devotion" : "I have two children that have professed faith in Christ at a young age, followed by baptism. My heart rejoices and my cup overflows that they have been rescued from Satan's clutches, and that they have been bought with the blood of Christ. At the same time, my heart also trembles in light of such early conversions. I know all too well that early professions of faith still require a daily holding fast to God's Word.\n\nAn early profession of faith is a flimsy foundation for confidence. Let us then pray that our sons would hold fast to the Word, and therefore, have a surety of their conversion. May they exalt Christ in everything. I pray that my little boys - when they become men - will stand upon the Word that they have held fast to since a tender age.",
      "prayer" : "Father, save my children - save them from an eternity separated from You. Make yourself known to them, use his parents as vessels to point them to You. Let this jar of clay somehow show them that Christ is my most precious treasure. Help them to see that it is solely because of Him that we can even take our next breath. Let my sons stand firm on the word they have received and in which they stand. Do what only You can, Father- work, move, save these young souls. For Your glory and in Your good name.",
      "credit" : "Brian McMillen"
    },

    {
      "title" : "he would love the church",
      "passage" : "A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another. By this all people will know that you are my disciples, if you have love for one another.\nJohn 13:34-35",
      "devotion" : "Many children that grow up in church are walking away. (Though some statistics are quite misleading). I can't help but think that some of the reason is that our children have never really learned to love the bride of Christ. Our sons can get caught in the crossfire of petty church fights. As a result their love for Jesus' bride grows cold. But we must never forget that the love that he has for the church is proportional to his love for Christ. Let us pray that our sons will love the church, serve the church, and be loyal to the church.",
      "prayer" : "Lord, thank you for your church - that you have redeemed by your blood. I pray that my son would love her, in all of her stains, warts, and failings. Help him to bleed for your Bride. Cause him to see the necessity of covenanting with a local church. Give him a servant's heart. Help him to love the Bride the way that you love him, so that all may see your greatness. Amen."
    },

    {
      "title" : "he would have a heart of love",
      "passage" : "Be watchful, stand firm in the faith, act like men, be strong. Let all that you do be done in love.\n1 Corinthians 16:13-14",
      "devotion" : "Paul outlines how to live as Christians with these four commands; be watchful, be firm in the faith, be men, and be strong. He immediately says that all is to be done in love. Apart from verse 14, we could have sons that are watchful, faithful, manly, and strong and yet have hearts of stone. Paul exhorts that these four things, and all others, are to be done in love. Our sons are to be lovingly watchful, lovingly firm in the faith, lovingly manly, and lovingly strong. Through love, which comes from God, they can truly fulfill what it is to be men.",
      "prayer" : "Father, our earnest desire is for our son to be watchful, firm in their faith, manly, and strong. Yet, we desire him to embed these qualities with a heart of love. Without the love of Christ, all else is in vain. So, we pray that You would fashion his heart to you in love. May he submit all else in his life to You. Only in loving submission to Your Son, can he truly be watchful, firm in the faith, manly, and strong. Amen.",
      "credit" : "Nick Horton"
    },

    {
      "title" : "he would have a good work ethic",
      "passage" : "Whatever your hand finds to do, it with your might, for there is no work or thought or knowledge or wisdom in Sheol, to which you are going.\nEcclesiastes 9:10",
      "devotion" : "Some of us have children that are still dreaming about being a fireman or a rock star. And that's okay because they are still only 5. Others have children that are 26, still living at home off mom and dad, and waiting for their big break into stardom. Others have children that are just miserably trudging along. And still others have adult children that are doing what they wanted to do. No matter where your son fits on that spectrum he is to have a good work ethic.",
      "prayer" : "Lord, thank you for redeeming work. We know that this side of a redeemed Eden we will continue to toil and sweat. Yet, you have given us meaning and purpose in what we do. I pray that my son would first and foremost find his meaning in You, and from there he would have a stellar work ethic. Help him to be passionate in whatever his hand finds to do. Help him to live with all of his might, for his good and your glory, Amen."
    },

    {
      "title" : "he would be entrusted to the Lord",
      "passage" : "And I am sure of this, that he who began a good work in you will bring it to completion at the day of Jesus Christ.\nPhilippians 1:6",
      "devotion" : "Whether you held your son in your arms thirty minutes or thirty years ago, God's good purposes for him were evident then and remain so to this day. Babe or grown, faithful or prodigal, you can trust your Heavenly Father to continue the good work he has begun in your son's life. Today, this day, will you release him into the Father's care?",
      "prayer" : "Lord Jesus, I know you are good and your ways are good. You knew my son even before I did and your love for him is stronger and purer than mine can ever be. Whatever it takes, Lord, for however long - I entrust him to you knowing that you will complete the good work you have started in him. Strengthen me to trust you more that I might not get in your way. Lead my son in the way everlasting that he might glorify and enjoy you forever. Amen.",
      "credit" : "Joan Hartley"
    },

    {
      "title" : "he would be cleansed by God",
      "passage" : "Wash me thoroughly from my iniquity, and cleanse me from my sin!\nPsalm 51:2",
      "devotion" : "Martin Luther once said, \"Jesus... called for the entire life of believers to be one of repentance.\" Certainly, there is more to our Christian walk than repentance, but there isn't less. Truly, \"the sacrifices of God are a broken and a contrite heart\" (Psalm 51:17). A constant attitude of humble repentance before God is foundational to being filled with the knowledge and understanding of God. Confession is indeed good for our souls. In a world that seeks to sterilize itself by wishing all morality away, we embrace the morality that flows from the very character of God. Simultaneously, we embrace and revel in the forgiveness that flows from our God and is made possible because of our matchless Christ. Pray today that our sons will run to Christ and find in Him the forgiveness and cleansing we all so desperately need.",
      "prayer" : "Dear Father, I praise You for Jesus. I praise You for His perfection - His righteousness. I praise You that in spite of our failures, You are a God of grace. Truly, where our sin abounds Your grace abounds yet more and more. I thank You for Your grace. I praise You for Your steadfast love. I praise You that You love our sons more than we do. Give them hearts of humble repentance. Make them to always know the joy of salvation. May they be trophies of Your matchless grace. This we pray for Your glory and their good. Amen.",
      "credit" : "Mark Mincy"
    },

    {
      "title" : "he would be weak",
      "passage" : "I lay down and slept; I woke again, for the Lord sustained me.\nPsalm 3:5",
      "devotion" : "Every son will one day be faced with trials, tribulations, and overwhelming demands of life. There are many examples in Scripture of people faced with seemingly impossible situations. Some of them sought to find their strength in their own power or at the expense of holiness in order to overcome. Others, as David in this Psalm, remind us that our God Himself keeps and sustains us through no power of our own. We see this most clearly demonstrated when we sleep and wake again. It is because of God's providence that we sleep safely and wake up in the morning.",
      "prayer" : "Father,You are just as strong when we are at our weakest. Your power is most abundant when we are most vulnerable. How great an assurance it is to know both our breath and heartbeat are under the sovereign control of your fatherly protection. I pray when the urges of the world or fear keeps my son awake at night, that he would be weak enough to sleep knowing that you are all powerful and your son, Jesus Christ, to whom Christian's belong, has the power to sleep during a roaring storm or say \"Peace, Be still.\" Amen.",
      "credit" : "Marc Mullins"
    },

    {
      "title" : "he would be willing to be forgotten",
      "passage" : "So you also, when you have done all that you were commanded, say, 'We are unworthy servants; we have only done what was our duty.'\nLuke 17:10",
      "devotion" : "Robert Murray McCheyne, a Scottish pastor from the 1800's once wrote in his diary, \"I need to be made willing to be forgotten\". Those words have stuck with me. Our culture trains parents and their children that they must be epic difference makers. The biblical pattern seems to be to follow the Lord and let him decide our platform, influence, and usefulness. We've made an idol out of usefulness. Therefore, let's pray that our sons would be content with being followers of Jesus. May they have hearts that are willing to be forgotten - so long as Christ Jesus shines upon them.",
      "prayer" : "Father, I pray that I would help my son to be content with the lot that the Lord gives to him. Help him to work hard and to strive to follow You in everything that he does. But at the end of the day, I pray that you make him willing to be forgotten. Help his mom and dad be proud of him no matter how \"epic\" he is. May he be faithful. May his heart's cry be to have You exalted in all things. Amen."
    },

    {
      "title" : "he would be courageous",
      "passage" : "Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.\nJoshua 1:9",
      "devotion" : "Just like Joshua our sons need courage. They need courage to say no to ungodliness. They need courage to boldly stand for the orphan and widow - in a culture that would rather cast them aside. They need courage to stand for the truth of God's Word in the midst of a crooked and depraved generation. They need courage to believe the gospel and live out all of its implications. Courage comes from delighting in God's presence. Such courage makes men, like George Whitefield, say, \"We are immortal until our work on earth is done.\" May our sons have courage.",
      "prayer" : "Lord, I thank you for our courageous Savior. I pray today that my son has the courage to be a man in a generation that abhors biblical manliness. Stir up in him a heart that stands courageous. Help him to fight the battles that need to be fought. May he be a tender warrior that fights the good fight. Cause the awareness of your presence to go deep into his heart. In Jesus name, Amen."
    },

    {
      "title" : "he would be a humble servant of the most High",
      "passage" : "For thus says the One who is high and lifted up, who inhabits eternity, whose name is Holy: \"I dwell in the high and holy place, and also with him who is of a contrite and lowly spirit, to revive the spirit of the lowly, and to revive the heart of the contrite.\nIsaiah 57:15",
      "devotion" : "There is much confusion in our world with regard to the measure of a man. The uniqueness of Christianity is this: \"Man looks on the outward appearance, but the LORD looks on the heart\" (1 Samuel 16:7). The greatest men are those who realize their brokenness and look to Jesus to make them whole. True brokenness is beautiful because it invites the very presence of the God of heaven. When we come to the end of ourselves and realize the transforming beauty of life in Christ we bring clarity to the confusion that reigns in our world. Pray today that your sons will be humble servants of the most high God.",
      "prayer" : "Dear Father, I praise you that you don't require greatness from us in order to dwell with us. I praise you that you require nothing but a broken and contrite heart. I praise you that the work of Jesus makes us whole, and offers hope to the world around us. I pray that you would engrave the truth about humility on the heart of my son. Keep him from the awful destruction of pride. Enable him to follow Jesus and His perfect example of humility. For the glory of God and the eternal good of our sons, this is our prayer. Amen.",
      "credit" : "Mark Mincy"
    },

    {
      "title" : "he would set his mind on things above",
      "passage" : "Set your minds on things that are above, not on things that are on earth. For you have died, and your life is hidden with Christ in God.\nColossians 3:2-3",
      "devotion" : "No matter the age of your son, he is prone to distraction. There are millions of things in the world for him to set his mind upon. Toy cars turn into real ones. Problems that are acted out through play become real. In every season of life we are tempted to set our minds upon things that are on earth. Our hearts wander. Yet as believers our identity is hidden with Christ in God. It is here where our minds must be focused. Let's pray today that our sons would set their minds upon Christ.",
      "prayer" : "Father, thank you for hiding us in Christ. I'm grateful that when the Father looks upon us He sees the righteousness of the son. I pray that my son would find his identity solely in you. And with his identity grounded in you, I pray that he would set his mind on things above. Give him a mind that is fixated on you. Help him to use his mind for your glory and His good. Amen."
    },

    {
      "title" : "he would become a fool to the world",
      "passage" : "Let no one deceive himself. If anyone among you thinks that he is wise in this age, let him become a fool that he may become wise. For the wisdom of this world is folly with God. For it is written, \"He catches the wise in their craftiness,\" and again, \"The Lord knows the thoughts of the wise, that they are futile.\" So let no one boast in men. For all things are yours, whether Paul or Apollos or Cephas or the world or life or death or the present or the future - all are yours, and you are Christ's, and Christ is God's.\n1 Corinthians 3:18-23",
      "devotion" : "Paul begins his letter to the Corinthians by confronting their carnality. They had followed crafty men and became distracted away from the centrality of Christ. At root to this drifting away is the folly of following after worldly wisdom. Paul shows that God has never used those that are proud, powerful, or wise by men's standards. The Lord's wisdom is shown in the weak--the antithesis of earthly reverence. God's power shines brightest through a message that boasts in the sovereign power of a King hung on a cross. Paul reminds us that only a fool would believe this cross is where the power of salvation lies.",
      "prayer" : "Father, there is no logical reason in our human minds to place the fate of the world at the foot of the cross. In a day where this message is increasingly scandalous to those who are wise by man's standards, I pray that you would grant my son the grace of foolishness. I pray that you might give him the foolishness to be wise to stand on the truth of the cross of Christ as the wisdom that saves. Amen.",
      "credit" : "Marc Mullins"
    },

    {
      "title" : "he would be an example and follow godly examples",
      "passage" : "Brothers, join in imitating me, and keep your eyes on those who walk according to the example you have in us.\nPhilippians 3:17",
      "devotion" : "At times our sons will follow examples and at other times they will be examples. It is imperative that our children follow godly examples. If our children are younger (and even if they are not) it is important that we model Christ. Even when we fail in the way that we represent Christ we must model repentance and point to the grace of Christ. Let us pray today that our children will follow godly examples and also that they will be examples of Christ.",
      "prayer" : "Lord, thank you for the example of Christ. I know that He is so much more than just an example - but He is certainly not less. Thank you for His sacrificial life and ultimately His sacrificial death. I pray that my son follows your example. I also pray that he follows other godly examples. May his mother and I be models of Christ that he can follow. Help us to repent when we fail in this. I also pray that he might be a faithful model of Jesus Christ. Thank you for grace. In Jesus name, Amen."
    },

    {
      "title" : "he would not be quarrelsome",
      "passage" : "It is an honor for a man to keep aloof from strife, but every fool will be quarreling.\nProverbs 20:3",
      "devotion" : "The world exalts men that are quarrelsome. Why else would talk radio (from sports, to politics, to every asinine thing under the sun) be so popular? Men can quarrel about such silly things as whether or not Tom Brady is a better quarterback than Peyton Manning. The Bible says that a quarrelsome person is a fool. And at the center of his being is a heart that is not content. Let's pray that the Lord would cause our sons to be men of valor - that stay aloof from unnecessary strife. Yet, let us also pray that they fight the battles that are necessary.",
      "prayer" : "Lord, help my son to know what fights he is to undertake. I thank you that you have - and continue - to fight for us. We love to quarrel. Our prideful hearts want to be correct, we want to win every battle - even ones that we should never fight. Help my son to be content with who he is in Jesus. Help him to fight with valor when he should fight and help him avoid strife when he shouldn't fight. Rescue him from being a quarreling fool. Amen."
    },

    {
      "title" : "the example of his parents would be God-honoring",
      "passage" : "And he did what was right in the eyes of the LORD, and walked in the ways of David his father; and he did not turn aside to the right hand or to the left.\n2 Chronicles 34:2",
      "devotion" : "Josiah was eight years old when he began his reign. He could look at two influences in his life and see two very different examples. His grandfather was the repentant Manasseh and his father was the evil Amon who did not humble himself before the LORD. Which would he follow? The LORD grabbed Josiah's heart at a young age and used him to root out idolatry throughout all the land of Israel. Our sons have many influences in their lives, as do we. When they look at our daily walk, what do they see? Do they see us sensitive to sin, loving our wives as Christ loved the church, meditating and applying God's word in our lives, obeying scripture, working diligently as for the LORD, witnessing to the lost, dependent upon the Holy Spirit?",
      "prayer" : "Lord, I know that children are a gracious reward from you. At the same time, they are like \"arrows in the hand of a warrior\". Sometimes I am overwhelmed by the task of raising my son in the discipline and instruction of the LORD. I need your wisdom, great discernment, and an abundance of love that you have continually showered on me. Lord, make my heart sensitive to your calling on my life, incline my son's heart to follow my lead, as we walk in obedience together. Make me ever mindful of the precious moments that can make you shine brighter and more real in his life. I don't want to squander even one. In the name of my great Savior, Amen.",
      "credit" : "Adam Atherton"
    },

    {
      "title" : "he would be in awe of God",
      "passage" : "All these things my hand has made, and so all these things came to be, declares the Lord. But this is the one to whom I will look: he who is humble and contrite in spirit and trembles at my word.\nIsaiah 66:2",
      "devotion" : "Awe seems to be easy for little kids. When we get older it's more difficult. No matter the age of your son, he must be in awe of God. The one to whom God will look is the one that trembles in awe of His majesty. Our God is awesome and worthy of us being absolutely dumbfounded in His presence. Let us pray today that our sons would be awestruck by His glory. May the sight of the Lord humble him, cause him to be contrite before Him, and to tremble at His word. He is glorious, brothers, may our sons know this with every fiber of their being.",
      "prayer" : "Lord, I pray that you would cause awe to spring up in the heart of my son. Cause him to tremble at your word. I pray that he is enamored with all of your glory. Rescue him - rescue me -  from a foolish sense of familiarity with you that no longer inspires awe. Help us to see that you are inexhaustible. We know that mountains melt like wax before You. Melt our hearts before you, oh God. Awe us for you are awesome. Amen."
    },

    {
      "title" : "he would be a compassionate warrior",
      "passage" : "The LORD God took the man and put him in the garden of Eden to work it and keep it.\nGenesis 2:15",
      "devotion" : "I've been teaching my five year old about the fall of mankind and what it has done to men. I've explained that God created us men to be compassionate warriors: men of valor that work hard, with hearts to protect. Real men fight for righteousness. But, as I've explained to my son, the fall has left us men as grouchy wimps instead of compassionate (tender) warriors. We are lazy when we should work. Or we use our job to hide us from the more difficult tasks of being a man at home. We aren't compassionate, we are selfish. Thankfully Jesus restores humanity and manhood. I encourage my son to live in that redemption instead of the rebellion of being a grouchy wimp.",
      "prayer" : "Father, thank you for restoring manhood. I am grateful that you have given us pictures throughout your word of what a real man is to look like. I know that in Jesus we have everything that we need for life and godliness. Lord, I pray that you would work in my sons' heart and help him to be a compassionate warrior. I know that through his whole life you will call him to be that. Help him to hurt with those that hurt. And to be a man of valor that stands up for others and mostly for the truth of the gospel. Amen."
    },

    {
      "title" : "he would be compelled to share Christ",
      "passage" : "And Jesus came and said to them, \"All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you. And behold, I am with you always, to the end of the age.\"\nMatthew 28:18-20",
      "devotion" : "No matter his age, our son is commissioned by God to spread His glory to the nations. He first must be a disciple himself, then through his following after Jesus he must shine the light of Christ to the nations. We all know how difficult it is to boldly proclaim the gospel. Let us pray, then, today that our sons would be compelled to share Christ.",
      "prayer" : "Heavenly Father, I pray that my son would have a heart to share the good news of Jesus Christ with his friends, family and peers so that others may be reached for Christ. May he realize that all people are precious to God. May he also be compelled to spread God's glory to the nations. May God use him as a disciple wherever he goes. Amen.",
      "credit" : "Sherry Heeke"
    },

    {
      "title" : "he would love God with his mind",
      "passage" : "And he said to him, \"You shall love the Lord your God with all your heart and with all your soul and with all your mind.\"\nMatthew 22:37",
      "devotion" : "We want our sons to treasure Christ. It is our desire that they love God more than the fleeting pleasures of sin. Yet, how will they treasure Christ if they do not engage him with their minds? We don't have to be intellectual giants - but we are called to love God with our minds. We live in a culture that devalues serious thinking. Sadly, the church has fostered this attitude since the early 20th century. Let us pray that our sons would see the value of loving God with their minds.",
      "prayer" : "Lord, I thank you for giving us minds with which to worship you. I pray today that you would captivate my son's mind. Help him to take captive every thought for your glory. Stir up in him a passion to seek after you with all of his mind. Help him not to settle for small thoughts of you."
    },

    {
      "title" : "Christ would heal his wounds",
      "passage" : "He heals the brokenhearted and binds up their wounds.\nPsalm 147:3",
      "devotion" : "Those of us that participated in the 31 Day Pray For Your Wife challenge, might remember this prayer. I almost passed this one over, and then realized that this applies to our sons just as much as to our wives. Indeed, Christ is the Great Healer for men and women. He heals up the brokenhearted and binds up their wounds. No matter their age, our sons likely carry with them wounds; some emotional, some physical, others mental or spiritual. Christ is redeeming this brokenness. Whatever wound your son is carrying, pray today that Jesus would give him healing. No wound is too deep for Christ to fill up with His goodness and mercy.",
      "prayer" : "Father, I am grateful that you heal the brokenhearted and bind up our wounds. Lord, I know that my son has wounds. It pains me to think that some of them are there from my own sin. I also know that praying for his healing might mean that you have to reopen the wounds to give him redemption in these areas. Heal the places in his heart that are broken. Bind up his wounds. Overwhelm him with your grace and mercy. Where there were once ashes replace them with your beauty. Amen."
    },

    {
      "title" : "Christ would be first in his affections",
      "passage" : "I have written something to the church, but Diotrephes, who likes to put himself first, does not acknowledge our authority. So if I come, I will bring up what he is doing, talking wicked nonsense against us. And not content with that, he refuses to welcome the brothers, and also stops those who want to and puts them out of the church.\n3 John 9-10",
      "devotion" : "Being first seems to be the right way to go. We desire to be number one in sports, number one in school, on and on its goes - number one in everything. As we see in 3 John , being number one can have disastrous consequences. The same is true today. The desire to be the best leader, elder, pastor teacher or congregant drives many to lay a pattern of destruction and damages souls in their wake. Let us pray today that our sons would have Christ as first in their affections and not themselves.",
      "prayer" : "Lord, I pray for our sons that You may show them that being number one is not a lofty goal. May You be their number One, the true and best example we have. As they participate and grow up in church give them the compassion to treat others how You would treat them. As you shine through them, may their lives be salt and light in the church world as well as in the market/school/sports place. Amen.",
      "credit" : "Jon Perera"
    },

    {
      "title" : "he would have a Biblical worldview",
      "passage" : "Beware lest any man spoil you through philosophy and vain deceit, after the tradition of men, after the rudiments of the world, and not after Christ.\nColossians 2:8",
      "devotion" : "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.  – Romans 12:2\n\nIt is very important that, as a Christian, our sons view the world through the window of Biblical truth. The world's philosophies have a way of seeping into our mind, and we must constantly guard against accepting what is wrong as right. There is a constant push from the world to excuse and accept sin. May our sons keep their heart and mind fixed on Christ. Furthermore, may they read and study the Word of God, and thereby keep their life's direction, like an arrow, straight and true toward God.",
      "prayer" : "Heavenly Father, thank you for the opportunities You have given my son to learn about You. Thank you for a solid church to attend, for the Holy Spirit to guide, for the holy scriptures to study. Lord, the world is full of many distractions to grab my son's attention away from You and to twist his mind into accepting the world's philosophies. He is Your child. Guard his mind and heart from being seduced toward the things of this world. Thank you for his interest in you, and may You continue to expose him to more and more opportunities to learn about You and grow in You. May the Holy Spirit keep him on the right path. Stir up in him a desire to stand against the world and in doing so, be a light for You. In Jesus' name I pray, Amen.",
      "credit" : "Audrey Reynolds"
    },

    {
      "title" : "He would keep him from falling",
      "passage" : "Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.\nJude 1:24-25",
      "devotion" : "If your son is in Christ this prayer will be answered. The glorious, majestic God that reigns in all authority for all of eternity has determined to save and secure your son for Himself. He will keep him from stumbling, and he will present him blameless before His presence. So let us celebrate God's provision for our sons. He will do this in \"great joy\". We ought to respond to this truth with great joy as well. As we strive to be faithful to God in the way that we shepherd our sons, let us also remember that One far more mighty than us is determined to keep him from falling.",
      "prayer" : "Lord, thank you that you hold my son up. You have purposed to keep him from stumbling and one day you will present him holy and blameless before you. Help me to see him today in light of who he will be tomorrow. Help me to rest in your care for him - knowing that You will keep him. All the glory and honor for my son's salvation is yours and yours alone. Thank you, Father, for your passion for my son's heart. Amen."
    },

    {
      "title" : "his parents would continue to pray for him",
      "passage" : "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus,\nRomans 15:5",
      "devotion" : "This is my prayer for you. I pray that you would continue to pray for your son. Furthermore, I pray that you would encourage other parents to take this challenge and pray for their sons. As you do this I pray that the God of endurance and encouragement would cause you to endure in your care for your son. I hope that you have grown in the Lord this month and that you have been encouraged. May Christ be glorified as you continue to love your son through praying for him.",
      "prayer" : "Lord, thank you for all those that have prayed for their sons. I pray that they would continue. Help me to continue praying for my dear son as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our homes for His name. Use us as living examples of your parental care. Amen."
    }
  ]
}
