{
  "name": "Pray With Your Spouse",
  "credits": {
    "Mike Leake": "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light."
  },
  "prayers": [{
      "title": "we would have an abiding satisfaction in God",
      "passage": "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalm 16:11",
      "devotion": "I begin almost every challenge with this verse, because the greatest thing that we can pray for one another and with someone is that we will be eternally satisfied in God. It is at His right hand where pleasure is to be found. It is in His presence and His presence alone where the fullness of joy is to be found. Therefore, we acknowledge that for us to drink from any other fountain will only multiply our sorrows (Psalm 16:4). Let us pray together that we will each find our deepest satisfaction in God.",
      "prayer": "Father, cause our deepest satisfaction to be found in you. Rescue us from looking to other things to find satisfaction and pleasures. Help us to spur one another on into great enjoyment of you. We acknowledge that joy is found only at your right hand. Help us to truly believe this and to live accordingly. In Jesus name, Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be partners in the Gospel",
      "passage": "I thank my God in all my remembrance of you, always in every prayer of mine for you all making my prayer with joy, because of your partnership in the gospel from the first day until now.\nPhilippians 1:3-5",
      "devotion": "Have you ever participated in a three-legged race? It's hard enough when the two people are headed toward the same goal. Can you imagine how impossible it'd be if the two people tied together were competing against one another and moving towards different goals?\n\nThe word Paul uses for partnership is the Greek word koinonia. D.A. Carson helpfully defines that as \"a self-sacrificing conformity to a shared-vision\". That's just another way to say that two people in a three-legged race are pooling all their resources together to get to the same goal.\n\nPaul was ecstatic because he realized that the Philippians had the same goal as he did—to see the gospel spread to the nations. Though they were in great poverty they shared what little they had to help Paul accomplish the mission. Our marriages must have a similar self-sacrificing conformity to a shared vision. And what better thing to partner in than the gospel of Jesus Christ? Our marriage could be centered on many different things, let's pray today that we would be partners in the gospel.",
      "prayer": "Lord, thank you for partnering us together. We confess that at times we move towards different goals, or even work together towards the wrong goal. Help us to learn what it means to truly be partners in the gospel. If there are things we need to sacrifice for the sake of your gospel, give us the boldness to obey. Give us a unified picture of the purpose of our marriage so that we are together passionately striving for the same goal.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would choose the best",
      "passage": "And it is my prayer that your love may abound more and more, with knowledge and all discernment, so that you may approve what is excellent, and so be pure and blameless for the day of Christ, filled with the fruit of righteousness that comes through Jesus Christ, to the glory and praise of God.\nPhilippians 1:9-11",
      "devotion": "Have you ever thought about all the decisions that you'll make as a couple? Some will be major life decisions, most of them will be small every day decisions. How do you make these decisions? What questions do you ask in order to put your stamp of approval on something?\n\nPaul's prayer for the Philippians is that their love will be so grounded in the truth that they will always put the stamp of approval on that which is vital and essential. He is praying that when given the choice they'll choose the eternal and significant over that which is fleeting. It's actually all of the little decisions that form our character more than the big ones that we usually stress out about. A thousand decisions informed by the gospel will create a couple which accurately shines the beauty of Jesus. So, let us pray along with Paul that we would approve that which is excellent.",
      "prayer": "Father, we have so many decisions that we have to make. Some of them are major decisions. We also confess that many of the decisions we make every day we don’t even give much thought. Help our love to grow so deep and discerning that we approve what is vital over what is fleeting. May every choice we make together be informed by the eternal. Help us approve the vital. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be quieted by His Love",
      "passage": "The Lord your God is in your midst,\na mighty one who will save;\nhe will rejoice over you with gladness;\nhe will quiet you by his love;\nhe will exult over you with loud singing.\nZephaniah 3:17",
      "devotion": "I love making my wife laugh. But one of my favorite moments with my wife didn't involve words, just a peaceful silence. Honestly, it was one of the few moments in my life when internally and externally I felt rest. It began snowing outside - one of those blizzard type of snows. The kids had gone to bed and we softly put on some old records. We just sat on the coach together and watched the snow. It was beautiful. We were silent. Quieted by love.\n\nI think of that moment when I read Zephaniah 3:17. The Lord rejoices over us with gladness and exults over us with loud singing - but he also quiets us by His love. His love is so deep for us that we are moved to hushed silence. All of our questions, our complaints, our groans, our unrest, are silenced by the depth of His love. We become like Job putting our hands over our mouth and resting in His goodness towards us. Our marriages need this. Not only that our love for one another would be so deep that we can be silent, but also that we would know and experience God's love in such a way that we are quieted.",
      "prayer": "Father, we are amazed by your love. We are astounded that you have chosen to exult over wretched sinners with singing. We do not deserve one bit of your love towards us. But it comes from the depth of your character. You love us not because we are beautiful but because you have decided to love us. There are many things that demand our words, help us to pause today and be quieted by your love. Hush us with your sovereign care.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would not become weary",
      "passage": "And let us not grow weary of doing good, for in due season we will reap, if we do not give up.\nGalatians 6:9",
      "devotion": "To grow weary of something doesn't just mean that you need a minor break. It means giving up, completely. This isn't about getting tired it's about being discouraged and losing hope. You've likely heard the phrase, \"No good deed goes unpunished\". There is some truth to it. We live in a fallen world, so things aren't as they ought to be. And we live as finite and sinful human beings. Add all this together and it means that we have to fight against growing weary.\n\nSadly, in marriage we can even grow weary in doing good to one another. But we must not give up. We are called to fight for joy in our marriage. And we are called to fight for joy in serving God—in whatever capacity He calls us. If you feel like giving up be encouraged by the words of 2 Corinthians 4:16-18. Viewing life through the lens of eternity is balm for our weary souls. Feasting on what Jesus has already accomplished and already purchased helps us persevere and not give up.",
      "prayer": "Father, there are times when we feel like giving up on doing good. Rescue us from weariness. We need your strength to persevere. Help us to passionately pursue doing good to one another, regardless the response. Give us a vision of the eternal that helps us to keep pressing on. You never grow weary of doing good, and in this we rest.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would enjoy the little things",
      "passage": "There is an evil that I have seen under the sun, and it lies heavy on mankind: a man to whom God gives wealth, possessions, and honor, so that he lacks nothing of all that he desires, yet God does not give him power to enjoy them, but a stranger enjoys them. This is vanity; it is a grievous evil.\nEcclesiastes 6:1-2",
      "devotion": "Sir Arthur Conan Doyle, author of Sherlock Holmes, once said, \"It has long been an axiom of mine that the little things are infinitely the most important.\" The Bible also speaks of the importance of the little things. Our days are filled with the tedious and mundane. This impacts our marriages. We must take joy in the little things, if not we will be distracted by constantly aspiring for greener pastures and more exciting things. Ecclesiastes 6 tells us that it is a grace to be able to enjoy the mundane of life, but it doesn't tell us how. Jesus rescues us from the meaninglessness of life under the sun and infuses even the little things with meaning and purpose. Let us pray today that God will give us grace in our marriages and in our lives to enjoy the little things.",
      "prayer": "Father, we know that it is only through your Son that we are able to enjoy the little things. It is a great evil for us not to enjoy this life that you have given us. You have given us many of the desires of our hearts. We pray that you will also give us the grace to enjoy these things. Capture our hearts with deep delight in the simple things. Open our eyes to the little things in our marriage, and cause our joy to be contagious and point others to Jesus.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would have an attractive marriage",
      "passage": "This mystery is profound, and I am saying that it refers to Christ and the church.\nEphesians 5:32",
      "devotion": "I remember being mesmerized as a child by my shadow. I not only enjoyed the finer things like shadow puppets but also quickly learned that I could make myself a giant if I positioned my body correctly. Shadows are often a distorted view of what they are imaging. The profound mystery to which Paul referred to in Ephesians 5 is that our one flesh union with our spouse is a picture of the union that believers share with Christ. Our marriage is a shadow of an ultimate reality.\n\nIf our marriages image the relationship between Christ and the church, we should labor to present as accurate a picture as two redeemed sinners can portray. The way we love one another and relate to one another should cause others to want to be married. It should be our goal to have an attractive marriage - one that rightly images Christ. It's easy to lose sight of this goal, but your marriage is a giant billboard to the world of the greatness of Christ. Pray today that through God's grace our marriages are attractive.",
      "prayer": "Lord, we know that you do not look upon appearances but upon the heart. We confess that so often we'd rather appear to have it all together rather than to actually image Christ. We pray that you would help us to love one another deeply from the heart, and that this intense love would cause our marriage to shine like stars in a crooked and depraved generation. Help our dedication to one another be a beautiful picture of your unfailing dedication to us. Thank you that even though our shadows are at times distorted that Christ will never fail us, and all that He has is ours. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would have close friendships",
      "passage": "Two are better than one, because they have a good reward for their toil. For if they fall, one will lift up his fellow. But woe to him who is alone when he falls and has not another to lift him up!\nEcclesiastes 4:9-12",
      "devotion": "True friendship is a great blessing. We were not meant to go through life alone. Our marriage needs healthy friendships with others. We need those who are gracious enough to lift us up in times of struggle as well as friends bold enough to \"wound\" if necessary. But relationships can be difficult work. For some couples it is easy to insulate ourselves from others. Today let's pray that we'll be the type of friends that others need and also that the Lord would graciously provide friends to help us live life for His glory.",
      "prayer": "Lord, thank you for the friends that you have given to us. We pray today that you would help these relationships to deepen even more. Help us to have and keep friends who \"stick closer than a brother\". I pray also today for our friends that you would bless them and enliven their passion for Jesus. Help us to be good friends to others. Strengthen our relationships in such a way that it furthers your kingdom. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would throw away our record books",
      "passage": "Love...keeps no record of wrongs.\n1 Corinthians 13:5",
      "devotion": "When sinners live with other sinners it is not surprising that we will sin against one another. I suppose if we kept an actual notebook of the wrongs we've done and the wrongs done against us we could fill a couple shelves of notebooks. Some of these would be minor infractions that are easily forgotten. Others might be deep seated wounds, real issues that need to be worked through. We are told to not keep a record of these—this means that we will deal with these offenses and not become resentful towards one another.\n\nThe Corinthians had been keeping a list of wrongs towards one another. Their resentment towards one another was fracturing their church. The same will happen to our marriages if we keep these record books. But love will burn them to the ground. We gain nothing by keeping record. Instead let us forgive one another, take our wounds to Christ, and live in the freedom of forgiveness. Pray today that we will cast off the shackles of resentment.",
      "prayer": "Father, if you kept a record of wrongs we could not stand? But you do not. You know our frame, you remember that we are dust and you choose to forgive. You graciously cast our sin as far as the east is from the west and remember them no more. Help us to burn the record books as well. We acknowledge that we gain nothing from hanging on to these offenses. Help us to deal with them in healthy and appropriate ways. Give us hearts ready to forgive and a love that is quick to cover offenses. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would thank God for his keeping power",
      "passage": "To him who is able to keep you from stumbling and to present you before his glorious presence without fault and with great joy\nJude 24",
      "devotion": "Sometimes it is good for us in prayer to simply meditate on a great truth from Scripture and thank God. Marriage has many terrific seasons. Sometimes those terrific seasons are borne out of seasons of trial and difficulty. It is encouraging to know that God is able to keep us from stumbling and to present us before himself without fault and with great joy. This is where God is taking you. Your marriage is a means that God is using to make you more like His Son and He will accomplish His purposes. So, let us take heart and have confidence in God’s keeping power. Today, no matter if you are on the mountain or in a valley God is at work. Let today be simply a day of adoration. Thank God for his keeping power.",
      "prayer": "Lord, if it were not for your keeping power we could not stand. Our marriage would only be a means to further our joy in ourselves. Even good gifts, like marriage, would be used to rob you of glory and ultimately to destroy us. But you have purposed something greater. You have purposed to make our marriages further our joy in Christ. We know that as we grow in Christ our joy in one another will also deepen. So we thank you today for your keeping power. Thank you for holding us up and keeping us from stumbling headlong into hell. We look to our ultimate rescue in Jesus. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would have a vibrant marriage",
      "passage": "Let your fountain be blessed, and rejoice in the wife of your youth,\nProverbs 5:18",
      "devotion": "Notice that this text does not say rejoice in your young wife. Instead the biblical writer is calling the wise to consistently look at their spouse with youthful eyes. This is not a call to find the fountain of youth but to pursue a vibrant marriage. When we choose to look at our spouses with the eyes of young love it changes things. I appreciate Ray Ortlund's reflection on this passage:\n\n\"Remember how you used to laugh and have fun, because you so liked each other?  You can have that again.  Go back there.  Yes, so much in life has changed.  You both have seen trouble and sorrow, maybe more than you ever dreamed you would.  But you still have her, and she counts for more than all the troubles in the world.  Look at her.  Look closely.  Notice how much about her has not changed.  Dwell on that.  Think about her faithfulness to you through the years, despite your weaknesses and failings, through the many hardships, all by the grace of God.  Meditate on the divine mercy she represents to you.  Let your heart melt again, and rejoice in God and in her.\"\n\nThis particular text and Ortlund's reflections are centered on the husband. But the verse extends to wives as well. Let us continually work to keep our marriages vibrant and young—even into old age.",
      "prayer": "Father, we thank you for our marriage. Help our marriage to stay young even as it deepens with old age. You have given us one another as a precious gift. We are satisfied in one another. Give us the grace to see things as they rightly are. Help us to enjoy the spouse of our youth.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be sober-minded",
      "passage": "Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion, seeking someone to devour.\n1 Peter 5:8",
      "devotion": "A healthy marriage will include a battle for our minds. We are bombarded by false information every day that tells us what a marriage should be. Men are told lies about whom they are, and women must endure a barrage of identity shaping commercials and such. Most of the voices we hear on a given day come with forked-tongue. What's worse is that sometimes we can speak serpentine language to our spouses. We must have a sober-mind so that we can build one another up and walk humbly in God's truth. Even our prayers may be hindered without a sober-mind (1 Peter 4:7). Pray today that the fog of lies and conflict would lift and that we would both hear the voice of the Good Shepherd.",
      "prayer": "Lord, if you did not speak to us we could only hear the voice of deceit. But you have chosen to speak to us through Your Word. Your voice is powerful. You are able to cut through the fog of deceit and speak clearly to our hearts. We pray that you would help us to be sober-minded in our marriage. Protecting us from believing lies. Help us to build one another up and speak truth to each other. Give us ears to hear your voice. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would serve one another",
      "passage": "In all things I have shown you that by working hard in this way we must help the weak and remember the words of the Lord Jesus, how he himself said, 'It is more blessed to give than to receive.'\nActs 20:35",
      "devotion": "Paul's philosophy of ministry—given to him by Jesus—was that there is more joy when our focus is on serving others instead of being served. Gary Chapman's book The Five Love Languages has helped many couples understand how they give love and how they receive love. It's very helpful. The only problem is that we are sinners who have a tendency to hijack good things and try to make them serve our fleshly desires. What can so often happen in marriages is that we focus on whether or not our partner is meeting our needs. But Jesus taught us a different way. We will be blessed if we decide today to not focus on our own needs but to focus on giving and serving our partner.",
      "prayer": "Father, your Son perfectly modeled for us a life of self-giving love. We know that it is because of His desire to give rather than receive that we even have an audience with you today. Lord, we humbly ask that you rip out of our hearts every selfish desire and replace it with Christ-like compassion and a burning desire to serve others; especially our spouse. Bring to our mind today tangible ways that we can serve one another and give us the boldness and perseverance to follow through. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be intentional stewards",
      "passage": "Know well the condition of your flocks, and give attention to your herds, for riches do not last forever; and does a crown endure to all generations?\nProverbs 27:23-24",
      "devotion": "This Proverb tells us a couple of things about money. First, it will not last forever. Secondly, we shouldn't let that first truth cause us to neglect being good stewards of what we do have. Our marriages are to be spent for the glory of God. But are we really doing everything we can for God's glory if we are not being responsible stewards of what God has entrusted to us? Can I really be certain that we are maximizing our resources for the sake of missions if we aren't being intentional about things like budgeting (knowing the condition of our flocks). We should take careful inventory of all that God has given us, not so that we can amass a personal fortune or even pretend like money will give us security. No, we do this because our possessions don't last forever and so we use them to further the kingdom which does. Let's use today to pray that God would help us be intentional stewards of all that he has given us.",
      "prayer": "Lord, we are grateful that you are sovereign over everything. Every resource we have really belongs to you. We acknowledge that we are but stewards. And we confess that so often we use our possessions for our own kingdom instead of yours. We also confess that at times we are irresponsible with what you've given to us. Help us to see the missional reasons for budgeting and taking count of our flock. Help us to maximize every dollar and every resource we have not for our own sake but for the sake of the kingdom. Create in us a deep unity with one another on this front. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would practice hospitality",
      "passage": "Do not neglect to show hospitality to strangers, for by this some have entertained angels without knowing it.\nHebrews 13:2\n\nShow hospitality to one another without grumbling.\n1 Peter 4:9",
      "devotion": "Our hospitality is directly tied to our grasp of the gospel. As we have been praying about using our marriages for the sake of God's glory, opening up our homes to others is a massive reflection of this. Hospitality is a reminder of our alien status. If our home is not hospitable it's like one that is comfortably living the American dream. We've started thinking that we are at home in this world and as a result we've lost our sojourner impulse. Let's pray today that we would open our hearts and our homes to not only our friends but also to those who aren't as much like us. Pray today that our marriage will have a missional heartbeat that will drive us to open our homes so that the gospel will flourish.",
      "prayer": "Father, thank you for saving us and rescuing when we strangers to your family. We know that we are called to reflect your love in the way that we welcome others into our home. Help us to open our home to others. Help us keep our sojourner impulse. We so badly want to lay down roots, but help us to do this in a way which reflect our missional heartbeat. Give us ideas for living out the Great Commission in the way we open up our home to others. Thank you for making your home among us. May we reflect Immanuel.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be patient",
      "passage": "Love is patient...\n1 Corinthians 13:4",
      "devotion": "We live in an age of instant gratification. If you need lunch in 5 minutes you can pop something in the microwave or take the shameful jaunt to the local McDonald's. But sanctification doesn't work that way. And because our marriage is for our sanctification, patience will be required. The hardest people to be patient with are the ones that we see every day. Our growth seems so slow and almost unnoticed. If we aren't careful we'll develop eyes and hearts which focus on the change still needed instead of the great growth the Lord has already wrought. Patience comes from confidence in the Lord's work and trust in His sovereign plan. Let's pray today that our marriages will be marked by patience. Patience with one another and patience as we together navigate the choppy waters of a hostile world. Radiant holiness is worthy any wait.",
      "prayer": "Father, thank you for your patience. You are absolutely holy and yet you are patient with sinners like us. Help us follow the footsteps of Jesus and be patient with one another. Forgive us for the times when we try to go faster than your work requires. Create in us a patient and still heart. We trust you and your work in us. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be dead to sin",
      "passage": "So you also must consider yourselves dead to sin and alive to God in Christ Jesus.\nRomans 6:11",
      "devotion": "Considering the high-calling of marriage can make you feel a bit overwhelmed. The way you love your spouse is a picture of the gospel on display for the whole universe. Your marriage either tells the truth about God or a lie. No pressure, eh? That's a tremendously high calling. I'm deeply in love with my wife, and she makes sacrifice not feel like much of a sacrifice. But I'm also a sinner, and there are days when I absolutely do not feel like serving my wife the way Scripture calls me to. When we compare our own inadequacies and sinful tendencies to the high-calling of marriage its tempting to just throw in the towel. But Paul's argument in Romans 6 is wildly encouraging. If you are in Christ you have died to sin and you are alive in Christ. This means that you and I have, in Christ, the power that we need to progressively have a marriage that looks more and more like Christ. Let's rejoice in that truth today, and be encouraged.",
      "prayer": "Father, I thank you have transferred all of those in Christ from the \"dead-in-sin\" family into the \"alive-to-God\" family. There are days, Lord, when I feel as if I don't have what it takes to be the spouse you call me to be. And it's true. But in Christ we do have the power to be godly and to love our spouses the way you call us to do. Help us feast on the great truths of Romans 6 today. Help us live as those who are truly alive and to not let sin reign in our mortal bodies any longer. You have defeated our greatest enemy. Let us rejoice in your victory and take confidence in your power. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be confessing",
      "passage": "If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.\n1 John 1:9",
      "devotion": "I've seen some marriages crumble because the way the couple interacts with one another is more akin to the heretics that John is writing about that than the humble confession of the saints of 1 John 1:9.  The heretics had a messed up theology that protected them from ever having to confess their sinfulness. They denied sinfulness in their being and sinfulness in their actions. How easy is it for a spouse to take the same posture towards their beloved? Often it is pride that keeps us from confessing to one another. And our conflicts escalate whenever both parties refuse to confess the real problem—personal sin. Tim Savage is correct:\n\n\"It is so important whenever disharmony arises between husbands and wives quickly to recognize the true nature of the problem: it is the sin of self-centeredness. Sadly, we often recoil from such an acknowledgement. We are more inclined to identify superficial irritants like incompatible personalities, trying circumstances, or differing opinions. But it is rarely the irritants themselves, rather the way sin exploits those irritants, that causes conflict in marriage.\" (No Ordinary Marriage: Together for God's Glory, 55)\n\nSo let's be bold in Jesus today, knowing that when we humbly confess our sin is covered by the finished work of Jesus. Let's believe the gospel enough to be courageous and confess to one another.",
      "prayer": "Father, I thank you that you have sent your son Jesus to die for our self-centeredness. We confess to you and to one another that the marriage issue in our marriage is sin. We are grateful that in Christ sin has been dealt with. It has been given a decisive blow and in Christ it no longer holds sway over us. Help us to believe this enough to confess our sin to not only you but also one another. When disharmony comes to our marriage help us look to the plank in our own eye before trying to remove the speck in our spouses eye. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would lean on the Lord",
      "passage": "Trust in the Lord with all your heart, and do not lean on your own understanding.\nProverbs 3:5",
      "devotion": "We have to make tons of decisions in our marriages. And our marriages will lean somewhere. Either we will lean on our own understanding - our gut feelings, emotions, experience, history, intuition, others, etc. - or we will lean on the Lord and trust Him with all of our heart. The fool in Proverbs is one who is self-directed. He patterns his whole life around his own understanding. But the one who is truly wise will subordinate his/her thoughts, desires, and decisions to the Lord. On occasion leaning on the Lord and not our own understanding goes contrary to human wisdom. In these times we must trust the rock solid anchor of God's revealed Word. May our marriages be ones that trust the Lord in all times.",
      "prayer": "Father, we know that apart from you we would only have our own understanding. We would then be constantly leaning upon that which cannot hold the weight of our identities. So we thank you for renewing our minds and causing us to have an anchor in you. Because of you we do not have to build our lives on the sand of our own thoughts and understanding. Thank you for guiding our marriage. No matter what decisions we face help us to not lean on our own understanding but to lean on you. Help us not to be wise in our own eyes but to fear you and turn away from evil. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would flee idols",
      "passage": "Dear children, keep yourselves from idols.\n1 John 5:21",
      "devotion": "Idolatry is whenever something else takes the place of God in our hearts. One of the best ways to shipwreck a marriage is to be given over to idolatry. When this happens something else will drive our marriage. This includes our love for one another. We put ourselves over God whenever we don't lovingly speak the truth to our spouse for fear of discord. We are engaging in a subtle form of idolatry when we ask \"us\" questions before we ask \"kingdom\" questions. If God is not at the forefront of our sacred union we will get derailed. Let us, then, keep ourselves from idolatry - even of a very good thing like our marriage.",
      "prayer": "Father, you are supreme. You have lovingly given to us the gift of marriage. We know that we are half-hearted creatures who are so easily satisfied with lesser things. Help us to remember that our marriage is but a shadow. Help us treasure one another and love one another deeply from the heart, but stir up our hearts to properly honor you above all. Forgive us for the times when we've put our marriage above obedience to you. Also, forgive us for the times we've put other things above our marriage AND above you. Give us a single-mindedness. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would be kind",
      "passage": "Love is kind...\n1 Corinthians 13:4b",
      "devotion": "To be kind to someone is to be intentionally useful to them. It is looking to serve. Ray Pritchard calls it a \"sweet usefulness\". Kindness doesn't just mean being nice to people. It means to look for ways to meet their needs and to bless them. Do we do this in our marriage? You and I feel 100% of the weight that we are pulling, but we won't naturally feel everything our spouse is pulling. Kindness gives us the eyes to notice and the compassion to help. How can you be useful to one another today?",
      "prayer": "Father, we know that every bit of our kindness to one another comes from your infinite kindness to us. Your kindness has led us to repentance. Thank you for pursuing us and working to meet our greatest need; namely, a restored relationship with you.  Stir up in us hearts that are kind. Be kind to others and especially kind to our spouse. Give us eyes to see ways that we can be useful to one another. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would touch the next generation",
      "passage": "Let this be recorded for a generation to come, so that a people yet to be created may praise the LORD...\nPsalm 102:18",
      "devotion": "We should want our lives and marriages to touch a generation that we will never see. There are generations yet to be created that God will draw to himself. It is our desire that our union with one another will be an instrument that God uses to tell another generation of his excellences. If you have children this is an obvious place to start with discipleship. We must follow Deuteronomy 6:4-6 and be the primary disciple makers of our children. And we must train them to be disciple makers of their own children. Even if you do not have children, you are called to touch a generation you will never see. Today, let us focus our prayer towards the future.",
      "prayer": "Father, we know that we can only be disciples in the present. But we also know that our present discipleship today has ramifications for the future. Help us, Lord, to live each day knowing that it will reverberate through the generations. Keeps us from taking ourselves too seriously, but also from flitting our lives away. Stir us up to make an impact for the kingdom for generations to come. Cause our marriage to be one that will make disciples even after we are gone. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would grow in the unchanging God",
      "passage": "For I the Lord do not change; therefore you, O children of Jacob, are not consumed.\nMalachi 3:6",
      "devotion": "I read a quote the other day from an elderly woman who had been married to the same man for over sixty years. The reporter asked her what was the secret to their long marriage. Her response was simple, yet profound. She said, \"The main reason is that neither of us have died\". She and her husband stood unwavering in their commitment to \"'til death do you part\". We live in a culture that is constantly changing. And often marriage follows suit. Yet, as believers we are to drop anchor in God's character. And God's character is one that is unchanging and one where He always keeps his promises.\n\nListen, you and are growing older every day. We are growing in things and declining in others. We are mutable. We change every day. And the person you married is not the same person even on day two of your marriage. But as believers we remain anchored because we are in union with the Unchanging God. He doesn't change. Though we will never be unchanging in our nature, as we grow in Christ we develop His unchanging character.",
      "prayer": "Father, I thank you that you are the unchanging one. Everything around us is changing. Sometimes we like these changes and at other times we find ourselves trying to scramble and adjust. Yet, through it all you remain Unchanged. It is because of you that we have stability. Help us to grow unchanging in our character and dedicated to reflecting You. You do not change, therefore we are not consumed. Thank you.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would not be anxious",
      "passage": "Anxiety in a man's heart weighs him down, but a good word makes him glad.\nProverbs 12:25",
      "devotion": "We can be weighed down by anxiety and fear. In a fallen world there are many things to fear and become anxious about. What makes this so difficult is that many of the things we fear may actually happen. We will die. Those we love get sick. If we want to be consumed by fear and anxiety we have plenty of fuel for those flames. This is why God calls us to consistently cast all our anxieties and fear upon Him. Our hearts will be weighed down by anxiety. Let us, therefore, drop anchor in the good word of the gospel. Pray today that our marriage would be marked by a deep trust and abiding in the Lord, instead of fear and anxiety.",
      "prayer": "Father, we know there are many things which cry out for us to respond in fear and anxiety. We live in a fallen world and not everything is perfect. But we also believe that you have dealt a decisive deathblow to all that opposes your kingdom. We trust that you are making all things new. Help us to cast our cares and anxiety upon you and to trust you. We give our marriage to you and all of the things that tempt us to anxiety and fear. We trust you. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would have tranquil hearts",
      "passage": "A tranquil heart gives life to the flesh, but envy makes the bones rot.\nProverbs 14:30",
      "devotion": "Who doesn't want a tranquil home? One of the quickest ways to sabotage such tranquility is through a spirit of envy and bitterness. Envy is born in the soils of discontentment. Whenever we are not satisfied with the lot the Lord has given to us, our hearts will quickly turn to envy. I have witnessed loving homes be shipwrecked when spouses turn towards one another in envy, forgetting that the two shall become one. I have also witnessed loving homes slowly decay as the married couple partners together in embracing an envious heart towards others. Such an attitude will never give you what you want. The Bible is clear a heart filled with jealousy and envy will cause your bones to rot. Let's run to Christ today and sever the root of bitterness. If you want tranquility in your home make it one marked by deep and abiding gratitude.",
      "prayer": "Father, we thank you that all of our greatest problems are already solved in Jesus Christ. Things are not perfect, we acknowledge this, but we also trust in your hand. We are satisfied in you. Forgive us for times when our hearts turn to envy and bitterness. Help us find contentment in you. We want a tranquil home and we know this comes from gratitude. Give us hearts of hope and gratitude even on rainy days. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would bear one another's burdens",
      "passage": "Bear one another's burdens, and so fulfill the law of Christ.\nGalatians 6:2",
      "devotion": "One of the chief ways that we can imitate Christ is by being a burden bearer. Jesus has taken our sins upon himself, has drank the full cup of God's wrath which belonged to us, and even himself became accursed so that we would not have to be. When we sacrifice ourselves to lift burdens from another we are doing so from a heart that Christ has redeemed. You know that your partner is bearing burdens today. What can you do to lift them? In the same way, perhaps your marriage is uniquely positioned to help life the burdens of other believers. Do it.",
      "prayer": "Father, we thank you that Christ has bore in his body our greatest burden. He has fulfilled the Law on our behalf. We walk in freedom today because of His work. Help us Lord to model our burden-bearing Savior in the way that we seek not to unload our own burdens but to even bear the burdens of others - even if it means sacrifice and pain on our part. Give us the hearts of servants. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would cover wrongs with love",
      "passage": "Above all, keep loving one another earnestly, since love covers a multitude of sins.\n1 Peter 4:8",
      "devotion": "Earnest love towards one another is the type of love that covers a multitude of sins. What does that mean? The context for Peter's statement likely comes from Proverbs 10:12 where we read that \"hatred stirs up conflict, but love covers all wrongs\". You are a sinner who is married to another sinner. We are both finite and sinful human beings. That means that if you want things to complain about your partner will give you more than enough fodder for your cannon. Hatred will stir up strife. It'll look for sin to expose and attack. But love doesn't do this. Love only looks for sin so that it can cover it through forgiveness and the redemptive work of Jesus. Choose love instead of hatred.",
      "prayer": "Father, we thank you that Jesus has covered every one of our sins and cast them to the bottom of the sea. If it were not for this indeed none of us could stand. But you have chosen to forgive our iniquity. Help us to do this same thing with one another. Help us to love one another earnestly and cover wrongs. May we walk in forgiveness towards one another and let that heart grow towards others as well. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would live out our roles",
      "passage": "Wives, submit to your own husbands, as to the Lord... Husbands, love your wives, as Christ loved the church and gave himself up for her, that he might sanctify her, having cleansed her by the washing of water with the word, so that he might present the church to himself in splendor, without spot or wrinkle or any such thing, that she might be holy and without blemish.\nEphesians 5:22, 25-27",
      "devotion": "This is the controversial one, but I'm convinced it shouldn't be. God has made men and women differently. We complement one another. We are fully equal and yet God has given us distinct roles as we relate to one another. We can fight against that or we can live out these roles in the strength of God's power. Wives are called to submit to even their ungodly husbands (see 1 Peter) as a way to model the gospel. And husbands are called to submit even to ungrateful wives as a way to model the gospel. Your partner's response to your fulfillment of your role does not change your responsibility. Let us work together to accurately model the gospel in the way we relate to one another.",
      "prayer": "Father, we thank you for the roles that you have given us. There are things that are difficult about each role but we know that you give us your power to fulfill our responsibilities. We also know that the gospel is at stake in the way we love our spouse. Help us husbands to sacrifice for our wives the way Jesus did for His bride. And help us wives lovingly follow our husbands' leadership the way the church does Christ. We know that we will never perfectly model this, but help even our broken mirrors accurately reflect Jesus. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would build on a sure foundation",
      "passage": "Everyone then who hears these words of mine and does them will be like a wise man who built his house on the rock. And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock. And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand. And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it.\nMatthew 7:24-27",
      "devotion": "What is your marriage built upon? There are many things that appear to be sturdy that we can build our marriage upon, but they are all shifting sand. I remember seeing photos of some of the most intricate sandcastles ever built. The people had to spend days on those things, only to watch them eventually destroyed by the waves. We can do the same with our marriages. When we build on sand we shouldn't be shocked by instability in our lives. Christ, calls us to be wise and build our house upon the only sure foundation; namely, Himself.",
      "prayer": "Father, we confess that far too often we build upon sand. We feel the instability of these foolish choices. Thank you for allowing them to come up empty. Thank you for the grace of failed sandcastles. We want to find our security and stability in the only foundation that will stand. Help us to recognize the sand in our lives and replace it with the rock of our salvation. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would grow in grace",
      "passage": "But grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory both now and to the day of eternity. Amen.\n2 Peter 3:18",
      "devotion": "The alternative to the but in this verse is found in 2 Peter 3:17. There we are encouraged to not listen to the Scripture twisters who will carry us into error. This will cause us to lose our stability. Rightly handling God's word is the way that we \"grow in grace and knowledge of Christ\". This in turn will give us homes of stability. But God's Word is sometimes difficult to understand, so we have to pray for the Spirit to illumine God's Word to us. Our home will either be saturated by grace or filled with error. With the Internet, social media, television, and endless streaming we have many avenues within our own homes to saturate us with error. Let us pray today that God will give us the grace to sift through the smut and to be anchored in His Word.",
      "prayer": "Father, we are desperate for you to keep us from the error we are so prone to follow. You have given us hearts that long for the truth, help us listen to you and trust your ways over our own wisdom. Give us the strength to turn off sources of error that permeate our home. Give us homes saturated with grace and growing in the knowledge of Christ. Amen.",
      "credit": "Mike Leake"
    },
    {
      "title": "we would have endurance",
      "passage": "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus,\nRomans 15:5",
      "devotion": "This is our prayer for you. I pray that you would continue to pray together as a couple. Furthermore, I pray that you would encourage other couples to take this challenge and pray with their spouse. As you do this I pray that the God of endurance and encouragement would cause you to endure in your relationship with one another. I hope that you have grown in the Lord this month and that you have been encouraged. May Christ be glorified as you continue to love your spouse through praying together.",
      "prayer": "Lord, thank you for all those that have prayed with their spouse. I pray that they would continue. Help us continue praying together as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our marriages for His name. Use us as living examples of your love for your church. Amen.",
      "credit": "Mike Leake"
    }
  ]
}