{
  "credits" : {
    "Mike Leake": "Mike Leake (@mikeleake) is the author of Torn to Heal: God's Good Purpose in Suffering. He lives in Jasper, Indiana with his wife, Nikki, and their two children. There he serves as an associate pastor at First Baptist Jasper. You can follow his blog, Borrowed Light."
  },

  "prayers" : [
    {
      "title" : "she would have an abiding satisfaction in God",
      "passage" : "You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalm 16:11",
      "devotion" : "The greatest thing that we can pray for our wives is that they will be eternally satisfied in God. At His right hand is where pleasure is to be found, and in His presence alone fullness of joy is to be found; for our wives to drink from any other fountain will only multiply her sorrows (Psalm 16:4). Therefore, we must pray that our wives find their deepest satisfaction in God.",
      "prayer" : "Father, I pray that you would cause my wife to find her deepest satisfaction in You. Rescue her from looking to other things to find satisfaction and pleasures. Help me to lead her in my enjoyment of You. At your right hand is where joy is found. Help us to truly believe this and live accordingly. In Jesus name, Amen"
    },

    {
      "title" : "she would not become weary in doing good",
      "passage" : "And let us not grow weary of doing good, for in due season we will reap, if we do not give up.\nGalatians 6:9",
      "devotion" : "In preparing our 31 days of prayer, I asked several women to give me things that they would love for their husbands to pray for them. One common theme was \"that I wouldn't become weary\". Brothers, our wives battle weariness. The only One that can sustain their weary hearts is the God that does not grow faint or weary (Isaiah 40:28-31). This same God is the very one who lovingly says to our wives and to us, \"come to me all you who are weary and heavy-laden and I will give you rest.\" Brothers, let's pray that our wives come to our burden- bearing Savior and find rest.",
      "prayer" : "Lord, we know that you have created us to find rest in you. And we know that our hearts are restless until they find rest in you. I pray that you help my wife to rest fully in you. Rescue her from her weariness and renew her strength. Keep her from becoming weary in doing good. Father, forgive me for any time that I have added to my wife's weariness and burdens instead of carrying them with and for her. Thank you for the rest that we will someday enjoy. Maranatha!"
    },

    {
      "title" : "her identity would be found in Christ",
      "passage" : "For you have died, and your life is hidden with Christ in God.\nColossians 3:3",
      "devotion" : "Our wives have many things in their lives that vie to shape their identities. Some will seek identity in physical appearance. Some will seek it in mothering or being a great wife. Others will seek it in Christian activity. Others will seek to find their identities in stuff . These are faulty foundations. Pray that our wives might find their identity solely in Christ. And that their identity in Christ would be the foundation for all of their other roles and passions.",
      "prayer" : "Father, you are everything that we desire. You are perfect in all of your ways. I am amazed that you would so graciously hide us in Christ. Lord I pray that my wife's identity would be shaped by all that Jesus is. May her life be hidden in You. May she believe that she is who You say that she is and not what the world, the flesh, or the devil says she is. Thank you that you have purchased our identity."
    },

    {
      "title" : "she would have a passion for God's Word",
      "passage" : "Blessed is the man who walks not in the counsel of the wicked, nor stands in the way of sinners, nor sits in the seat of scoffers; but his delight is in the law of the Lord, and on his law he meditates day and night.\nPsalm 1:1-2",
      "devotion" : "If we want our wives to be blessed, we should also want them to delight in God's Word. It is not a coincidence that we are to wash our wives in the water of the Word. When all else fails - including us as husbands - the Word of God is the one thing that remains. One of the greatest things that can come from our prayer for our wives is that they would strengthen and develop an abiding love for God's Word. Our passion is not merely that our wives would master the Word but that they would be mastered by the Word. Therefore, let us pray that God would give them a delight in His Word.",
      "prayer" : "Lord, we thank you for your Word. I know that what will cause my wife to be blessed will be that she delights in your Word. Lord, I know that this is not something that comes from her - but this delight ultimately comes from you. So, God I pray that you would incline her heart to you. Help her to have a deep and abiding passion for your Word. I pray that you help her rejoice as she meditates on you as you reveal yourself in your Word. Give her a passion for your Word like she has never knowbefore. I pray this that Christ may glorified, Amen."
    },

    {
      "title" : "her husband would be pure",
      "passage" : "I will not set before my eyes anything that is worthless.\nPsalm 101:3",
      "devotion" : "One of the greatest things that our wives need from us is our personal purity. If we are to love, serve, and sacrifice for our wives we must do so as men of integrity. One of the greatest robbers of personal integrity and holiness is lust (often manifesting itself in pornography). Brothers, we must pray that God would sustain us and be our delight. Let us pray that he would protect us from temptation and give us the wisdom and strength to flee ungodly passions. Our wives need our holiness.",
      "prayer" : "Father, forgive me for all of the times that I have not lived in absolute integrity. I thank you that Jesus Christ redeems and makes new everything that we've shipwrecked. May we live in His redemption and not foolish rebellion. Lord, create in us a holy passion for purity. Keep us from flirting with sin and not fleeing from it. Cause us to be men of integrity and purity. Might we be known as men that love our wives and love our Lord in such a way that \"worthless\" and \"unclean\" things have lost their luster. Lead us not into temptation but deliver us from this great evil. In the absolutely pure name of Jesus, I pray, amen."
    },

    {
      "title" : "she would find joy in the mundane",
      "passage" : "There is an evil that I have seen under the sun, and it lies heavy on mankind: a man to whom God gives wealth, possessions, and honor, so that he lacks nothing of all that he desires, yet God does not give him power to enjoy them, but a stranger enjoys them. This is vanity; it is a grievous evil.\nEcclesiastes 6:1-2",
      "devotion" : "Through Solomon God declares the inability to enjoy God's good gifts to be a terrible evil. Daily, our wives engage in tedious and mundane activity. Consider all that she will do today. Now consider that she probably did those same things yesterday, and will likely do them again tomorrow. It is a mark of grace for her to find joy in these things. In the middle of her everyday work she can be tempted to let her mind wander to more exciting things and for her heart to become dissatisfied. The only rescue from the \"meaninglessness\" of life under the sun is to find our ultimate meaning in Christ. Then, and only then, can the humdrum truly be enjoyed.",
      "prayer" : "Gracious God, I pray today that you help my wife to find joy in the mundane. I know it is a curse for us to have many of our heart's desires but not the ability to enjoy them. Lord, I know that ability comes from you. Capture my wife's heart with a deep delight in the simple things of life. Help her to find joy in you as she does the dishes, tends to our children, cooks supper, and all of the other routine things that she does. Help her to enjoy the gift of life and to live in the life that Jesus has purchased for her. Amen."
    },

    {
      "title" : "she may be sober-minded",
      "passage" : "Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion, seeking someone to devour.\n1 Peter 5:8",
      "devotion" : "Men, the battle for our wives' affections must include the battle for her mind. Our wives are bombarded with information every day from a myriad of voices. These voices tell her who she is as a woman, as a wife, as a mother, and as a disciple. Many of these voices come from a forked-tongue. Without a sober-mind her head will be spinning, not knowing which message to believe. With a sober-mind even her prayers will be hindered (1 Peter 4:7). Therefore, let us pray that the Lord would remove the fog and help our wives to hear and heed the voice of the Good Shepherd.",
      "prayer" : "Father, I thank you that you speak to us. I also thank you that your Word and your voice is powerful. Mountains melt like wax before you, and at the same time the sheep hear your tender voice. Speak to my wife, through the fog. Help her to hear your voice and know it. Quiet all of the other messengers that cloud her brain and keep her from being sober-minded. Ground her in your truth. May she grow in her ability to hear her faithful Shepherd. In his name that we pray, Amen."
    },

    {
      "title" : "she would be blessed with a close friend(s)",
      "passage" : "Two are better than one, because they have a good reward for their toil. For if they fall, one will lift up his fellow. But woe to him who is alone when he falls and has not another to lift him up!\nEcclesiastes 4:9-12",
      "devotion" : "True friendship is a great blessing. Our wives need godly friendships. They need others ladies in their lives that will lift them up when they fall and will be bold enough to \"wound\" if necessary (Proverbs 27:6). Today let's pray for our wives to have a close friend (or friends) and that the Lord would use these friendships for his glory. Pray that he would protect their fellowship and use any relational difficulties to strengthen our wives. Let's pray also for the close friends that our wives do have.",
      "prayer" : "Lord, thank you for the friends that you have given to my wife. I pray Lord that you might cause these relationships to deepen even more. Help her to have a \"friend who sticks closer than a brother\". I pray for my wife's friends that you would bless them and keep them and enliven their passion for Jesus. I pray also that you would help my wife to be a great friend as well. May her friendships be used to further your kingdom in the world and in her heart. Amen."
    },

    {
      "title" : "she would passionately love the bride of Christ",
      "passage" : "A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another. By this all people will know that you are my disciples, if you have love for one another.\nJohn 13:34-35",
      "devotion" : "Let's face it, the church can be messy. Our wife can get caught in the crossfire of petty church fights. She's also not immune to being directly involved in them. As such our wife can grow bitter towards the bride of Christ. Over time her passion can dwindle and her love for the Bride of Jesus will grow cold. Brothers, the love our wives have for the bride of Christ is proportional to her love for the Lord. Let us pray that the Lord would cause our wives to \"love one another deeply from the heart (1 Peter 1:22)\".",
      "prayer" : "Father, I thank you that you have purchased a people for yourself. I thank you that you are redeeming people from every nation, tribe, people, and tongue. You are taking away hearts of sin and unbelief and replacing them with hearts of passionate worship. This is your church. And on the way to redemption we are messy. I pray that the messy of church might cause my wife's heart to stir in deep love instead of bitterness. Sustain her with your love for her, and your love for the church. May she love your Bride the way that you love her, so that all may know your greatness. Amen."
    },

    {
      "title" : "she would not be anxious or fearful",
      "passage" : "Anxiety in a man's heart weighs him down, but a good word makes him glad.\nProverbs 12:25",
      "devotion" : "Our wives can be weighed down by anxiety and fear. In a fallen world there are many things to fear and become anxious about. And in the long run many of the things that we fear are a reality. We will die. Those that we love will get sick. If our wives want to be consumed by fear and worry they have plenty of fuel for the flames of anxiety. Yet in the midst of a fallen world God calls us to cast all our anxieties and fear upon Him. Let's pray that our wives would trust in the Lord and not be overwhelmed with fear and anxiety.",
      "prayer" : "Father, I know that there are many things that can cause my wife to be fearful or anxious. I know that we live in a fallen world. But I also know that we live in a world where evil, death, and all things in opposition to you have been dealt a decisive death blow by our Lord Jesus. You are making all things new. Help my wife to trust in your redemption and not the temporary truths that fear and anxiety tell her. Rescue her from fear and anxiety. Amen."
    },

    {
      "title" : "she would believe that Jesus is the Christ, the son of God, and by believing she would have life in His name.",
      "passage" : "But these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing you may have life in his name.\nJohn 20:31",
      "devotion" : "Today let us dedicate ourselves to praying for our brothers that are married to unbelieving spouses. If your wife is a believer, thank God for His rescue of your wife. If she is not a believer, plead for her today before the Lord that He would \"cause the light of the knowledge of the glory of Christ to shine in her heart\" (2 Corinthians 4:6). Let's beg of the Lord today to cause every man in this group to be married to a woman that believes in Jesus, is growing in Jesus, and finds her life in His name.",
      "prayer" : "Father, I thank you for salvation. I thank you that you have never given up on me and that you reached me in the darkest of places. There is no sin that is too powerful for your grace to overcome. Lord would you continue your work of rescuing my wife. Lord, save her to the uttermost and help to find her life in your name. Lord, I also pray for the other brothers in this group. Rescue their wives through the powerful work of Jesus. Would you call them out of darkness with your mighty hand? May this be a day of salvation. In Jesus name, Amen"
    },

    {
      "title" : "her husband would pursue her holiness",
      "passage" : "Husbands, love your wives, as Christ loved the church and gave himself up for her, that he might sanctify her, having cleansed her by the washing of water with the word, so that he might present the church to himself in splendor, without spot or wrinkle or any such thing, that she might be holy and without blemish. In the same way husbands should love their wives as their own bodies. He who loves his wife loves himself.\nEphesians 5:25-28",
      "devotion" : "Husbands, we are to find our joy in the joy of our wives. Men, we are foolish if we think that their greatest joy will be found in us. That would be to rip them off profoundly. No, our goal must be the same goal as Jesus; namely, that their joy is as deep and lasting as Psalm 16:11. Anything else is not a lofty enough goal. The miracle of Ephesians 5:28-32 is that as we nourish and cherish our wives in such a way that they find lasting satisfaction in Jesus we also find our own joy. Men, may our goal for our wives be as big as Jesus.",
      "prayer" : "Father, stir in me a passion to pursue my wife's holiness. Create in me a heart that is only satisfied when my wife finds her deepest satisfaction in you. As a selfish husband I often make decisions concerning our family that benefits me. Change this. Help me to lead and love in such a way that my goal for my wife is her passion for Jesus. Thank you for providing everything we need for life and godliness through the work of Christ. May our marriage glorify You. Amen."
    },

    {
      "title" : "she would sever the root of bitterness",
      "passage" : "Let all bitterness...\nbe put away from you...\nEphesians 4:31",
      "devotion" : "There are myriad consequences that can lead to our wives becoming bitter. But at its root bitterness is a mark of rebellion instead of redemption. Therefore, all bitterness must be put away. \"A spirit of antagonism and hostility\" comes from a hardness of heart that finds its source in unbelief. A bitter heart is one that no longer delights in God's salvation or trusts in His goodness. Our wives (and we) are not immune to a bitterness of heart. Let's pray today that our wives would sever the root of bitterness.",
      "prayer" : "Lord, thank you for redeeming my wife. Thank you that you \"work all things together for her good\", which is ultimately conformity to Christ. Lord, at times redemption is painful. Life is tough. You seem distant. And yet you are working. Rescue my wife from bitterness that springs from unbelief. You have made her a Naomi (pleasant, agreeable, sweet) through the work of Jesus. Rescue her from the temptation to live as a Mara (bitter). Cause her to rejoice today in the joy of her salvation. Amen."
    },

    {
      "title" : "she would not be embarrassed of her femininity",
      "passage" : "So God created man in his own image, in the image of God he created him; male and female he created them.\nGenesis 1:27",
      "devotion" : "Elisabeth Eliot wrote this 15 years ago, it is even more true today: \"I find myself in the sometimes quite uncomfortable position of having to belabor the obvious, and hold up examples of femininity to women who almost feel apologetic for being feminine or being womanly. I would remind you that femininity is not a curse. It is not even a triviality. It is a gift, a divine gift, to be accepted with both hands, and to thank God for. Because remember, it was His idea... \" The world would have our wives believe their femininity is something to apologize for. It is not. Let us praise God for giving us the gift of femininity in our homes. Also let us pray that they might not be embarrassed by their femininity but \"accept it with both hands\" and glorify God through the gift of being female.",
      "prayer" : "Lord, thank you for my wife's femininity. Thank you for her tenderness and sensitivity. I'm glad that she is a woman - and I'm thankful for all that this means. I pray Lord that she delights in this sacred calling of bearing your image as a female. Help her to rejoice in this gift and not be embarrassed by her femininity. I must confess as a man I'm not even sure how to pray for her in this area. I simply pray that you help her be the woman that you call her to be. She is more precious than rubies - thank you for her feminine appeal. May she reflect your glory."
    },

    {
      "title" : "she would be wise",
      "passage" : "How much better to get wisdom than gold! To get understanding is to be chosen rather than silver.\nProverbs 16:16",
      "devotion" : "Our wives will make many decisions today. She needs wisdom to guide her. She will hear many messages today, many trying to subvert who she really is in Christ. She needs wisdom to guard her. Real wisdom comes from God and is found in the person of Jesus Christ. It is more valuable than any of the material possessions that our wives may be tempted to set their hearts towards today. Let us pray that as wisdom calls out that our wives would hear His voice. May she listen to the gracious words of Wisdom and not the serpentine words of a forked-tongued fool.",
      "prayer" : "Lord, I pray today that my wife might be a woman that is characterized by wisdom. May she pursue it as she would pursue rubies, diamonds, gold, and silver. I know that you have already given her a great deal of wisdom. And I know that in Jesus Christ she has the storehouse of all wisdom and knowledge. May she draw from Him today. In moments of confusion help her to pause. Help her to look for you and to not lean on her own wisdom. I pray that she leans all of her weight on you and your wisdom. Amen."
    },

    {
      "title" : "she would be tender-hearted",
      "passage" : "Finally, all of you, have unity of mind, sympathy, brotherly love, a tender heart, and a humble mind.\n1 Peter 3:8",
      "devotion" : " remember early in my walk with Christ listening to a live Keith Green album. Before one of his songs Green prayed that his heart would have \"baby skin all over it\". That is what I want to pray for our wives today. I want to pray that they (and we) would be tender hearted as the Scriptures command us to be. Let us not harden up our hearts to protect ourselves from the bitter world. Our wives are probably more naturally tender than us. Let's fan that gift into a flame, men. Brothers, we need tender-hearted wives.",
      "prayer" : "Father, I pray that you cause my wife's heart to have \"baby skin all over it\". Cause her to be tender hearted. Though the world may mock a sensitive heart, help her to know that it is very pleasing to you. May her heart be tender towards her church, her friends, her spouse, her children, herself, and more than anything may her heart be tender towards you. May the tender heart of Jesus shine through the tender heart of my wife. Amen."
    },

    {
      "title" : "her faith would increase",
      "passage" : "The apostles said to the Lord, \"Increase our faith!\"\nLuke 17:5\n\nImmediately the father of the child cried out and said, \"I believe; help my unbelief!\"\nMark 9:24",
      "devotion" : "I am continually encouraged by the Puritan adage that \"a weak faith can lay hold of a strong Christ.\" Luke 17:5 is interesting in that when the apostles ask for an increase in faith Jesus points them back to faith's object. The vivacity of faith is not nearly as important as the One that we place our trust upon. Even still the Scriptures would have us grow in our faith as unbelief dwindles before the Lord. Let us pray today that our wives would increase in their faith - that they would trust the Lord and believe that everything God does is ultimately for their good.",
      "prayer" : "Lord, I thank you for being faithful. You are mighty and worthy of every ounce of our trust. I'm very grateful that a weak faith can lay hold of a strong Christ, because there are times when my faith is weak. I know this same thing is true of my wife. Father, would you graciously increase her faith in you today. Blow her away with your goodness and love towards her. Help her to see you and her heart to leap in faith and joy. Lord, my wife believes, help her unbelief."
    },

    {
      "title" : "she would be hospitable",
      "passage" : "Show hospitality to one another without grumbling.\n1 Peter 4:9",
      "devotion" : "Your wife's hospitality is a great reflection of her grasp of the gospel. Hospitality is a reminder of our alien status. A wife that does not practice hospitality is likely a wife that is comfortably living the American dream. She has started thinking that she is at home and therefore has lost her sojourner impulse. Let us pray today that our wives would have a missional heartbeat, and that part of this missional heartbeat would be a drive to open up her home so that the gospel might flourish.",
      "prayer" : "Lord, thank you for my wife's hospitable heart. Increase it. Help her to consistently have a sojourner impulse and not lay her roots too deeply in this world. Give my wife a missional heartbeat that constantly thinks of ways to fulfill the Great Commission. May her heart be ultimately others focused for the sake of your glory. Thank you for making your home among us. Might we live the life of Immanuel. Amen."
    },

    {
      "title" : "her husband would romance her",
      "passage" : "You have captivated my heart, my sister, my bride; you have captivated my heart with one glance of your eyes, with one jewel of your necklace.\nSong of Solomon 4:9\n\nLet your fountain be blessed, and rejoice in the wife of your youth,\nProverbs 5:18",
      "devotion" : "Brothers, we are to take delight in our wives. This is not to be a secret delight. Our wives should know without a doubt that they have captivated our hearts. As the Lord spoke tenderly to His bride in the wilderness (in spite of her actions), let us always speak tenderly to our wives. Let us romance them no matter our life circumstances. If your heart isn't there pray that the Lord would renew in you a delight in the wife of your youth. If your heart is there give it full expression; romance her.",
      "prayer" : "Lord, thank you for my wife. She truly has captivated my heart. Keep my heart from growing cold, stale, and merely satisfied. Stir in my heart deep affections for my wife. Help me to study her -  to know her - and to know how I can communicate to her that she has captivated my heart. In every area where my heart is wayward towards her would you strengthen it? Cause my love for her to be as deep and settled as the elderly couple that knows one another so well. But also make it such a love that would shame the shallow expressions of teenagers. Help me to sweep her off her feet. Amen."
    },

    {
      "title" : "she would know her calling is high",
      "passage" : "An excellent wife who can find? She is far more precious than jewels.\nProverbs 31:10",
      "devotion" : "As a stay at home mom, my wife can struggle with feelings of insignificance. Changing diapers, settling arguments, teaching colors and numbers, and playing with children does not seem like that significant of a role. The same probably goes for your wife no matter where the Lord has placed her. Brothers, our wives will struggle with knowing that their calling as a woman (and all the roles that encompasses) is a high calling. Ultimately we know that her significance is found in Jesus Christ alone. Yet we also want our wives to know that their calling is high.",
      "prayer" : "Father, I thank you for my wife. I thank you for all of the significant things that she does that might appear to be insignificant. She is far more precious than jewels. Help her to find her ultimate worth and significance in you. But also help her to know that her calling as a woman is a high calling. May she be found faithful in the roles that you entrust to her. Strengthen her and encourage her to be the woman that you have crafted her to be. Amen."
    },

    {
      "title" : "she would be self-controlled",
      "passage" : "Why are you cast down, O my soul, and why are you in turmoil within me? Hope in God; for I shall again praise him, my salvation and my God.\nPsalm 43:5",
      "devotion" : "In this Psalm, David is talking to his soul. He is not letting his weary soul dictate his worship. He is exercising self-control. Brothers, our wives need this self-control. They must talk to their emotions instead of letting their emotions talk to them. They need to have the Spirit-driven self-control to say \"no\" to the crafty serpent. Let us pray today that our wives would exercise self-control.",
      "prayer" : "Lord, I thank you for a new heart. The only waythat any of us can exercise self-control is because of your work. We know that self-control is a fruit of the Spirit. Father, I pray today that my wife would have self-control. Make her a woman that talks to her soul, with biblical truth, rather than the other way around. Give her the grace to hear your voice and to heed it. Help her to tell her emotions \"no\" when they run out of their proper banks. May she be so deeply anchored in You and Your Word that she exercises self-control. In Jesus' name, Amen."
    },

    {
      "title" : "Christ would heal her wounds",
      "passage" : "He heals the brokenhearted and binds up their wounds.\nPsalm 147:3",
      "devotion" : "Christ is the Great Healer. He indeed heals up the brokenhearted and binds up their wounds. Men, our wives are likely wounded. They carry with them wounds from the past; some emotional, some physical, other mental or spiritual. Christ is redeeming this brokenness. Whatever wound your wife is carrying, pray today that Jesus would give her healing. No wounds is too deep for Christ to fill up with His goodness and mercy.",
      "prayer" : "Father, I am grateful that you heal the brokenhearted and bind up our wounds. Lord, I know that my wife has wounds. And I know that praying for her healing might mean that you have to reopen the wounds to give her redemption in these areas. Heal the places in her heart that are broken. Bind up her wounds. Overwhelm her with your grace and mercy. Where there were once ashes replace them with your beauty. I look forward to dancing with her in your new heaven. Amen."
    },

    {
      "title" : "she would extend her hand to the poor and needy",
      "passage" : "She opens her hand to the poor and reaches out her hands to the needy.\nProverbs 31:20",
      "devotion" : "The mark of someone that has really received grace is that they would care for orphans and widows. Or as this Proverbs states, they open their hand to the poor and reaches out to the needy. Men let us pray that our wives would be marked by this. May they have hearts of sacrifice for the sake of others. In order for her hands to be open to the poor it means that she cannot clinch her fist around her possessions. Pray today that she would be marked by generosity and giving.",
      "prayer" : "Father, I thank you for all that you have given to my wife. I thank you for her giving spirit. Cause her faith to increase so that she can trust you with her possessions. And as she trusts in you more and more, help her to open her hands to the poor and needy. Help her not only to give when people ask but help her to pursue those that are needy. Give her wisdom in her giving. Give me grace to encourage her as she extends grace to others. Amen."
    },

    {
      "title" : "she would live in grace",
      "passage" : "Christ redeemed us from the curse of the law by becoming a curse for us.\nGalatians 3:13",
      "devotion" : "If your wife trusts in Jesus we know that he has delivered her from the curse of the law. She is free from condemnation and the burden of having to adhere to the whole law. Jesus was accursed for her. Yet, your wife will still tempted to live according to the law. She can get her identity from her performance and she can be shackled by relational legalism. Apart from grace your wife will respond to you according to law, lead her children according to law, and find her worth according to law. Let's pray that she would live in grace.",
      "prayer" : "Father, thank you for redeeming my wife. Thank you for becoming a curse for her. Thank you that on the cross you swallowed up every ounce of wrath that my wife deserves. Help me to see her as one that has been totally bought by the precious blood of Jesus. I pray, Lord, that she would live by grace all the days of her life. Help her to see how free in Jesus she really is. Rescue her from a heart and mind driven by performance. Help her dance in grace today. You've already taken the burden of the law off her back - help her not to pick it back up again. In Jesus' name, Amen."
    },

    {
      "title" : "she would be in awe of God",
      "passage" : "All these things my hand has made, and so all these things came to be, declares the Lord. But this is the one to whom I will look: he who is humble and contrite in spirit and trembles at my word.\nIsaiah 66:2",
      "devotion" : "Brothers, our wives must be in awe of God. The one to whom God will look is the one that trembles in awe of His majesty. Our God is awesome and worthy of us being absolutely dumbfounded in His presence. Let us pray today that our wives would be awestruck by His glory. May the sight of Him humble them, cause them to be contrite before Him, and to tremble at His word. He is glorious, brothers, may our wives know this with ever fiber of their being.",
      "prayer" : "Lord, would you cause awe to spring up in the heart of my wife. Cause her to tremble at your word. I pray that she is enamored with all of your glory. Rescue her - rescue me - from a foolish sense of familiarity with you that no longer inspires awe. Help us to see that you are inexhaustible. We know that mountains melt like wax before You. Melt our hearts before you, oh God. Awe us, for you are awesome. Amen."
    },

    {
      "title" : "her husband would provide for her",
      "passage" : "But if anyone does not provide for his relatives, and especially for members of his household, he has denied the faith and is worse than an unbeliever.\n1 Timothy 5:8",
      "devotion" : "Men, we must have a heart to provide for our families. I know that various stages of life will make providing difficult. Some men are hindered by disabilities. The issue is really the heart. God knows if we are being lazy or if we are truly working hard to provide. As men we need to do hard things. If we do not care to provide for our families this means that we are worse than unbelievers. Men, let's passionately pursue nurturing and caring for our wives and children (if applicable). May we provide for them financially, spiritually, physically, emotionally, and any other way that we are called to provide.",
      "prayer" : "Father, you are the Great Provider. You own the cattle on a thousand hills. You have all resources at your disposal. Lord, stir up in my heart a passion to work hard...really hard, for the sake of my wife. You have the heart of a Provider. You make certain that your children do not lack any good thing. Help me to live out of this same heart. May I look to their needs before my own. Help me to make changes that might be necessary to provide for her better. In Jesus' name, Amen."
    },

    {
      "title" : "he would keep her from falling",
      "passage" : "Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.\nJude 1:24-25",
      "devotion" : "If your wife is in Christ this prayer will be answered. The glorious, majestic God that reigns in all authority for all eternity has determined to save and secure your wife for Himself. He will keep her from stumbling, and he will present her blameless before His presence. So let us celebrate God's provision for her. He will do this in \"great joy\". May we respond to this truth with great joy as well. Brothers, as we strive to be faithful to God in the way that we care for our wives, let us also remember that One far more mighty than us is determined to keep them from falling.",
      "prayer" : "Lord, thank you that you hold my wife up. You have purposed to keep her from stumbling and one day you will present her holy and blameless before you. Help me to see her today in light of who she will be tomorrow. Help me to rest in your care for her - knowing that You will keep her. All the glory and honor for my wife's salvation is yours and yours alone. Thank you, Father, for your passion for my wife's heart. Amen."
    },

    {
      "title" : "she would not lean on her own understanding",
      "passage" : "Trust in the Lord with all your heart, and do not lean on your own understanding.\nProverbs 3:5",
      "devotion" : "The fool in Proverbs is self-directed. The wise person will subordinate his/her thoughts, desires, decisions, etc. to the Lord. Our wives must lean somewhere. Either they will lean on their own understanding - their gut feelings, their emotions, experience, history, or their husbands. Or they will lean on the Lord and trust Him with all of their hearts. At times the Lord calls us to do and to feel things that are contrary to our human wisdom. May our wives trust the Lord in those times.",
      "prayer" : "Father, I thank you for a renewed mind. I am grateful that you are not only redeeming our souls but also our minds as well. Because of you we do not have to build our lives on the sand of our own thoughts. Thank you for being a guide for my wife. Thank you for leading her. Lord, I pray that you would cause her to lean not on her own understanding but upon you. Help her to \"not be wise in her own eyes\" but to fear you and turn away from evil (Prov. 3:7). Amen."
    },

    {
      "title" : "she would know the depth of God's love for her",
      "passage" : "...so that Christ may dwell in your hearts through faith - that you, being rooted and grounded in love, may have strength to comprehend with all the saints what is the breadth and length and height and depth, and to know the love of Christ that surpasses knowledge, that you may be filled with all the fullness of God.\nEphesians 3:17-19",
      "devotion" : "Paul's prayer for the Ephesians is essentially that they would know how much God loves them and that He is not going anywhere. Let us pray today this same thing for our wives. It is unfathomable how much the Lord loves her. It is, as John said, an \"other-worldly love\" (1 John 3:1). And yet God inspires Paul to pray that we would comprehend that which is incomprehensible.",
      "prayer" : "Father, you love my wife more deeply than I do. Lord, I am not even sure of the depth of my own love for her, but I am sure that it has a bottom. Your love does not. I pray for my wife today that you would help her to see and to know how much you love her. May she know that you are not going anywhere, that you are here to stay, and that your love cannot be exhausted. Overwhelm her with your love. Amen."
    },

    {
      "title" : "she would shine",
      "passage" : "Do all things without grumbling or disputing, that you may be blameless and innocent, children of God without blemish in the midst of a crooked and twisted generation, among whom you shine as lights in the world, holding fast to the word of life, so that in the day of Christ I may be proud that I did not run in vain or labor in vain.\nPhilippians 2:14-16",
      "devotion" : "One of the ways that our wives can shine in this world is by being women of markedly different character. If she goes about her days without grumbling and complaining people will noticed that she is different. Of course, that is only possible because Jesus Christ is the chief affection in her heart. We have to be redeemed out of the crooked and twisted generation before we can shine as different. Having a heart that doesn't grumble but instead shines out hope is a rarity in this world. Pray today that your wife is such a jewel.",
      "prayer" : "Lord, I'm grateful that my wife does shine in this way. I am thankful that because of your salvation you have caused her to have hope and not to be a grumbler. Even still I know that she is not yet fully redeemed. Stir in her heart a passion to be cheerful. Cause her to shine like a star in a dark world. I pray that she is not embarrassed by the light - but she is embolden to shine the glory of Christ even brighter. Amen."
    },

    {
      "title" : "her husband would continue to pray for her",
      "passage" : "May the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus,\nRomans 15:5",
      "devotion" : "This is my prayer for you. I pray that you would continue to pray for your wife. Furthermore, I pray that you would encourage other men to take this challenge and pray for their wives. As you do this I pray that the God of endurance and encouragement would cause you to endure in your care for your wife. I hope that you have grown in the Lord this month and that you have been encouraged. May Christ be glorified as you continue to love your wife through praying for her.",
      "prayer" : "Lord, thank you for all those that have prayed for their wife. I pray that they would continue. Help me to continue praying for my sweet wife as well. Cause us to endure in this great endeavor. May Christ be glorified through us. Transform our marriages for His name. Use us as living examples of your love for your church. Amen."
    }
  ]
}
